espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** CACHE_L1_ICACHE_CTRL_REG register
 *  L1 instruction Cache(L1-ICache) control register
 */
#define CACHE_L1_ICACHE_CTRL_REG (DR_REG_CACHE_BASE + 0x0)
/** CACHE_L1_ICACHE_SHUT_IBUS0 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to disable IBUS0 to access icache.
 *  1: Disable
 */
#define CACHE_L1_ICACHE_SHUT_IBUS0    (BIT(0))
#define CACHE_L1_ICACHE_SHUT_IBUS0_M  (CACHE_L1_ICACHE_SHUT_IBUS0_V << CACHE_L1_ICACHE_SHUT_IBUS0_S)
#define CACHE_L1_ICACHE_SHUT_IBUS0_V  0x00000001U
#define CACHE_L1_ICACHE_SHUT_IBUS0_S  0
/** CACHE_L1_ICACHE_SHUT_IBUS1 : R/W; bitpos: [1]; default: 0;
 *  Configures whether to disable IBUS1 to access icache.
 *  1: Disable
 */
#define CACHE_L1_ICACHE_SHUT_IBUS1    (BIT(1))
#define CACHE_L1_ICACHE_SHUT_IBUS1_M  (CACHE_L1_ICACHE_SHUT_IBUS1_V << CACHE_L1_ICACHE_SHUT_IBUS1_S)
#define CACHE_L1_ICACHE_SHUT_IBUS1_V  0x00000001U
#define CACHE_L1_ICACHE_SHUT_IBUS1_S  1
/** CACHE_L1_ICACHE_SHUT_IBUS2 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to disable IBUS2 to access ROM cache.
 *  1: Disable
 */
#define CACHE_L1_ICACHE_SHUT_IBUS2    (BIT(2))
#define CACHE_L1_ICACHE_SHUT_IBUS2_M  (CACHE_L1_ICACHE_SHUT_IBUS2_V << CACHE_L1_ICACHE_SHUT_IBUS2_S)
#define CACHE_L1_ICACHE_SHUT_IBUS2_V  0x00000001U
#define CACHE_L1_ICACHE_SHUT_IBUS2_S  2
/** CACHE_L1_ICACHE_SHUT_IBUS3 : R/W; bitpos: [3]; default: 0;
 *  Configures whether to disable IBUS3 to access ROM cache.
 *  1: Disable
 */
#define CACHE_L1_ICACHE_SHUT_IBUS3    (BIT(3))
#define CACHE_L1_ICACHE_SHUT_IBUS3_M  (CACHE_L1_ICACHE_SHUT_IBUS3_V << CACHE_L1_ICACHE_SHUT_IBUS3_S)
#define CACHE_L1_ICACHE_SHUT_IBUS3_V  0x00000001U
#define CACHE_L1_ICACHE_SHUT_IBUS3_S  3
/** CACHE_L1_ICACHE_UNDEF_OP : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_UNDEF_OP    0x000000FFU
#define CACHE_L1_ICACHE_UNDEF_OP_M  (CACHE_L1_ICACHE_UNDEF_OP_V << CACHE_L1_ICACHE_UNDEF_OP_S)
#define CACHE_L1_ICACHE_UNDEF_OP_V  0x000000FFU
#define CACHE_L1_ICACHE_UNDEF_OP_S  8

/** CACHE_L1_DCACHE_CTRL_REG register
 *  L1 data Cache(L1-DCache) control register
 */
#define CACHE_L1_DCACHE_CTRL_REG (DR_REG_CACHE_BASE + 0x4)
/** CACHE_L1_DCACHE_SHUT_DBUS0 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to disable DBUS0 to access dcache.
 *  1: Disable
 */
#define CACHE_L1_DCACHE_SHUT_DBUS0    (BIT(0))
#define CACHE_L1_DCACHE_SHUT_DBUS0_M  (CACHE_L1_DCACHE_SHUT_DBUS0_V << CACHE_L1_DCACHE_SHUT_DBUS0_S)
#define CACHE_L1_DCACHE_SHUT_DBUS0_V  0x00000001U
#define CACHE_L1_DCACHE_SHUT_DBUS0_S  0
/** CACHE_L1_DCACHE_SHUT_DBUS1 : R/W; bitpos: [1]; default: 0;
 *  Configures whether to disable DBUS1 to access dcache.
 *  1: Disable
 */
#define CACHE_L1_DCACHE_SHUT_DBUS1    (BIT(1))
#define CACHE_L1_DCACHE_SHUT_DBUS1_M  (CACHE_L1_DCACHE_SHUT_DBUS1_V << CACHE_L1_DCACHE_SHUT_DBUS1_S)
#define CACHE_L1_DCACHE_SHUT_DBUS1_V  0x00000001U
#define CACHE_L1_DCACHE_SHUT_DBUS1_S  1
/** CACHE_L1_DCACHE_SHUT_DBUS2 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to disable DBUS2 to access ROM cache.
 *  1: Disable
 */
#define CACHE_L1_DCACHE_SHUT_DBUS2    (BIT(2))
#define CACHE_L1_DCACHE_SHUT_DBUS2_M  (CACHE_L1_DCACHE_SHUT_DBUS2_V << CACHE_L1_DCACHE_SHUT_DBUS2_S)
#define CACHE_L1_DCACHE_SHUT_DBUS2_V  0x00000001U
#define CACHE_L1_DCACHE_SHUT_DBUS2_S  2
/** CACHE_L1_DCACHE_SHUT_DBUS3 : R/W; bitpos: [3]; default: 0;
 *  Configures whether to disable DBUS3 to access ROM cache.
 *  1: Disable
 */
#define CACHE_L1_DCACHE_SHUT_DBUS3    (BIT(3))
#define CACHE_L1_DCACHE_SHUT_DBUS3_M  (CACHE_L1_DCACHE_SHUT_DBUS3_V << CACHE_L1_DCACHE_SHUT_DBUS3_S)
#define CACHE_L1_DCACHE_SHUT_DBUS3_V  0x00000001U
#define CACHE_L1_DCACHE_SHUT_DBUS3_S  3
/** CACHE_L1_DCACHE_SHUT_DMA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to disable DMA access L1-DCache, 0: enable, 1: disable
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_SHUT_DMA    (BIT(4))
#define CACHE_L1_DCACHE_SHUT_DMA_M  (CACHE_L1_DCACHE_SHUT_DMA_V << CACHE_L1_DCACHE_SHUT_DMA_S)
#define CACHE_L1_DCACHE_SHUT_DMA_V  0x00000001U
#define CACHE_L1_DCACHE_SHUT_DMA_S  4
/** CACHE_L1_DCACHE_UNDEF_OP : R/W; bitpos: [15:8]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_UNDEF_OP    0x000000FFU
#define CACHE_L1_DCACHE_UNDEF_OP_M  (CACHE_L1_DCACHE_UNDEF_OP_V << CACHE_L1_DCACHE_UNDEF_OP_S)
#define CACHE_L1_DCACHE_UNDEF_OP_V  0x000000FFU
#define CACHE_L1_DCACHE_UNDEF_OP_S  8

/** CACHE_L1_BYPASS_CACHE_CONF_REG register
 *  Bypass Cache configure register
 */
#define CACHE_L1_BYPASS_CACHE_CONF_REG (DR_REG_CACHE_BASE + 0x8)
/** CACHE_BYPASS_L1_ICACHE0_EN : R/W; bitpos: [0]; default: 0;
 *  Configures bypass L1-ICache0.
 *  1: Enable
 *
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_BYPASS_L1_ICACHE0_EN    (BIT(0))
#define CACHE_BYPASS_L1_ICACHE0_EN_M  (CACHE_BYPASS_L1_ICACHE0_EN_V << CACHE_BYPASS_L1_ICACHE0_EN_S)
#define CACHE_BYPASS_L1_ICACHE0_EN_V  0x00000001U
#define CACHE_BYPASS_L1_ICACHE0_EN_S  0
/** CACHE_BYPASS_L1_ICACHE1_EN : R/W; bitpos: [1]; default: 0;
 *  Configures bypass L1-ICache1.
 *  1: Enable
 *
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_BYPASS_L1_ICACHE1_EN    (BIT(1))
#define CACHE_BYPASS_L1_ICACHE1_EN_M  (CACHE_BYPASS_L1_ICACHE1_EN_V << CACHE_BYPASS_L1_ICACHE1_EN_S)
#define CACHE_BYPASS_L1_ICACHE1_EN_V  0x00000001U
#define CACHE_BYPASS_L1_ICACHE1_EN_S  1
/** CACHE_BYPASS_L1_ICACHE2_EN : R/W; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_BYPASS_L1_ICACHE2_EN    (BIT(2))
#define CACHE_BYPASS_L1_ICACHE2_EN_M  (CACHE_BYPASS_L1_ICACHE2_EN_V << CACHE_BYPASS_L1_ICACHE2_EN_S)
#define CACHE_BYPASS_L1_ICACHE2_EN_V  0x00000001U
#define CACHE_BYPASS_L1_ICACHE2_EN_S  2
/** CACHE_BYPASS_L1_ICACHE3_EN : R/W; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_BYPASS_L1_ICACHE3_EN    (BIT(3))
#define CACHE_BYPASS_L1_ICACHE3_EN_M  (CACHE_BYPASS_L1_ICACHE3_EN_V << CACHE_BYPASS_L1_ICACHE3_EN_S)
#define CACHE_BYPASS_L1_ICACHE3_EN_V  0x00000001U
#define CACHE_BYPASS_L1_ICACHE3_EN_S  3
/** CACHE_BYPASS_L1_DCACHE_EN : R/W; bitpos: [4]; default: 0;
 *  Configures bypass L1-DCache.
 *  1: Enable
 */
#define CACHE_BYPASS_L1_DCACHE_EN    (BIT(4))
#define CACHE_BYPASS_L1_DCACHE_EN_M  (CACHE_BYPASS_L1_DCACHE_EN_V << CACHE_BYPASS_L1_DCACHE_EN_S)
#define CACHE_BYPASS_L1_DCACHE_EN_V  0x00000001U
#define CACHE_BYPASS_L1_DCACHE_EN_S  4

/** CACHE_L1_CACHE_ATOMIC_CONF_REG register
 *  L1 Cache atomic feature configure register
 */
#define CACHE_L1_CACHE_ATOMIC_CONF_REG (DR_REG_CACHE_BASE + 0xc)
/** CACHE_L1_DCACHE_ATOMIC_EN : R/W; bitpos: [0]; default: 1;
 *  Configures atomic feature on L1-DCache when multiple cores access L1-DCache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_ATOMIC_EN    (BIT(0))
#define CACHE_L1_DCACHE_ATOMIC_EN_M  (CACHE_L1_DCACHE_ATOMIC_EN_V << CACHE_L1_DCACHE_ATOMIC_EN_S)
#define CACHE_L1_DCACHE_ATOMIC_EN_V  0x00000001U
#define CACHE_L1_DCACHE_ATOMIC_EN_S  0

