espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_ACACHE_CACHESIZE_CONF_REG register
 *  L1 Auxiliary Cache CacheSize mode configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_CONF_REG (DR_REG_CACHE_BASE + 0x10)
/** CACHE_L1_ACACHE_CACHESIZE_256 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_256    (BIT(0))
#define CACHE_L1_ACACHE_CACHESIZE_256_M  (CACHE_L1_ACACHE_CACHESIZE_256_V << CACHE_L1_ACACHE_CACHESIZE_256_S)
#define CACHE_L1_ACACHE_CACHESIZE_256_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_256_S  0
/** CACHE_L1_ACACHE_CACHESIZE_512 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 512 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_512    (BIT(1))
#define CACHE_L1_ACACHE_CACHESIZE_512_M  (CACHE_L1_ACACHE_CACHESIZE_512_V << CACHE_L1_ACACHE_CACHESIZE_512_S)
#define CACHE_L1_ACACHE_CACHESIZE_512_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_512_S  1
/** CACHE_L1_ACACHE_CACHESIZE_1K : HRO; bitpos: [2]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 1k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_1K    (BIT(2))
#define CACHE_L1_ACACHE_CACHESIZE_1K_M  (CACHE_L1_ACACHE_CACHESIZE_1K_V << CACHE_L1_ACACHE_CACHESIZE_1K_S)
#define CACHE_L1_ACACHE_CACHESIZE_1K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_1K_S  2
/** CACHE_L1_ACACHE_CACHESIZE_2K : HRO; bitpos: [3]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 2k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_2K    (BIT(3))
#define CACHE_L1_ACACHE_CACHESIZE_2K_M  (CACHE_L1_ACACHE_CACHESIZE_2K_V << CACHE_L1_ACACHE_CACHESIZE_2K_S)
#define CACHE_L1_ACACHE_CACHESIZE_2K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_2K_S  3
/** CACHE_L1_ACACHE_CACHESIZE_4K : HRO; bitpos: [4]; default: 1;
 *  The field is used to configure cachesize of L1-ACache as 4k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_ACACHE_CACHESIZE_4K    (BIT(4))
#define CACHE_L1_ACACHE_CACHESIZE_4K_M  (CACHE_L1_ACACHE_CACHESIZE_4K_V << CACHE_L1_ACACHE_CACHESIZE_4K_S)
#define CACHE_L1_ACACHE_CACHESIZE_4K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_4K_S  4
/** CACHE_L1_ACACHE_CACHESIZE_8K : HRO; bitpos: [5]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 8k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_8K    (BIT(5))
#define CACHE_L1_ACACHE_CACHESIZE_8K_M  (CACHE_L1_ACACHE_CACHESIZE_8K_V << CACHE_L1_ACACHE_CACHESIZE_8K_S)
#define CACHE_L1_ACACHE_CACHESIZE_8K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_8K_S  5
/** CACHE_L1_ACACHE_CACHESIZE_16K : HRO; bitpos: [6]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 16k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_16K    (BIT(6))
#define CACHE_L1_ACACHE_CACHESIZE_16K_M  (CACHE_L1_ACACHE_CACHESIZE_16K_V << CACHE_L1_ACACHE_CACHESIZE_16K_S)
#define CACHE_L1_ACACHE_CACHESIZE_16K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_16K_S  6
/** CACHE_L1_ACACHE_CACHESIZE_32K : HRO; bitpos: [7]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 32k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_32K    (BIT(7))
#define CACHE_L1_ACACHE_CACHESIZE_32K_M  (CACHE_L1_ACACHE_CACHESIZE_32K_V << CACHE_L1_ACACHE_CACHESIZE_32K_S)
#define CACHE_L1_ACACHE_CACHESIZE_32K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_32K_S  7
/** CACHE_L1_ACACHE_CACHESIZE_64K : HRO; bitpos: [8]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 64k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_64K    (BIT(8))
#define CACHE_L1_ACACHE_CACHESIZE_64K_M  (CACHE_L1_ACACHE_CACHESIZE_64K_V << CACHE_L1_ACACHE_CACHESIZE_64K_S)
#define CACHE_L1_ACACHE_CACHESIZE_64K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_64K_S  8
/** CACHE_L1_ACACHE_CACHESIZE_128K : HRO; bitpos: [9]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 128k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_128K    (BIT(9))
#define CACHE_L1_ACACHE_CACHESIZE_128K_M  (CACHE_L1_ACACHE_CACHESIZE_128K_V << CACHE_L1_ACACHE_CACHESIZE_128K_S)
#define CACHE_L1_ACACHE_CACHESIZE_128K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_128K_S  9
/** CACHE_L1_ACACHE_CACHESIZE_256K : HRO; bitpos: [10]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 256k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_256K    (BIT(10))
#define CACHE_L1_ACACHE_CACHESIZE_256K_M  (CACHE_L1_ACACHE_CACHESIZE_256K_V << CACHE_L1_ACACHE_CACHESIZE_256K_S)
#define CACHE_L1_ACACHE_CACHESIZE_256K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_256K_S  10
/** CACHE_L1_ACACHE_CACHESIZE_512K : HRO; bitpos: [11]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 512k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_512K    (BIT(11))
#define CACHE_L1_ACACHE_CACHESIZE_512K_M  (CACHE_L1_ACACHE_CACHESIZE_512K_V << CACHE_L1_ACACHE_CACHESIZE_512K_S)
#define CACHE_L1_ACACHE_CACHESIZE_512K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_512K_S  11
/** CACHE_L1_ACACHE_CACHESIZE_1024K : HRO; bitpos: [12]; default: 0;
 *  The field is used to configure cachesize of L1-ACache as 1024k bytes. This field
 *  and all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_CACHESIZE_1024K    (BIT(12))
#define CACHE_L1_ACACHE_CACHESIZE_1024K_M  (CACHE_L1_ACACHE_CACHESIZE_1024K_V << CACHE_L1_ACACHE_CACHESIZE_1024K_S)
#define CACHE_L1_ACACHE_CACHESIZE_1024K_V  0x00000001U
#define CACHE_L1_ACACHE_CACHESIZE_1024K_S  12

/** CACHE_L1_ACACHE_BLOCKSIZE_CONF_REG register
 *  L1 Auxiliary Cache BlockSize mode configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_CONF_REG (DR_REG_CACHE_BASE + 0x14)
/** CACHE_L1_ACACHE_BLOCKSIZE_8 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configureblocksize of L1-ACache as 8 bytes. This field and all
 *  other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_8    (BIT(0))
#define CACHE_L1_ACACHE_BLOCKSIZE_8_M  (CACHE_L1_ACACHE_BLOCKSIZE_8_V << CACHE_L1_ACACHE_BLOCKSIZE_8_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_8_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_8_S  0
/** CACHE_L1_ACACHE_BLOCKSIZE_16 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configureblocksize of L1-ACache as 16 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_16    (BIT(1))
#define CACHE_L1_ACACHE_BLOCKSIZE_16_M  (CACHE_L1_ACACHE_BLOCKSIZE_16_V << CACHE_L1_ACACHE_BLOCKSIZE_16_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_16_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_16_S  1
/** CACHE_L1_ACACHE_BLOCKSIZE_32 : HRO; bitpos: [2]; default: 0;
 *  The field is used to configureblocksize of L1-ACache as 32 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_32    (BIT(2))
#define CACHE_L1_ACACHE_BLOCKSIZE_32_M  (CACHE_L1_ACACHE_BLOCKSIZE_32_V << CACHE_L1_ACACHE_BLOCKSIZE_32_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_32_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_32_S  2
/** CACHE_L1_ACACHE_BLOCKSIZE_64 : HRO; bitpos: [3]; default: 1;
 *  The field is used to configureblocksize of L1-ACache as 64 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_64    (BIT(3))
#define CACHE_L1_ACACHE_BLOCKSIZE_64_M  (CACHE_L1_ACACHE_BLOCKSIZE_64_V << CACHE_L1_ACACHE_BLOCKSIZE_64_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_64_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_64_S  3
/** CACHE_L1_ACACHE_BLOCKSIZE_128 : HRO; bitpos: [4]; default: 0;
 *  The field is used to configureblocksize of L1-ACache as 128 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_128    (BIT(4))
#define CACHE_L1_ACACHE_BLOCKSIZE_128_M  (CACHE_L1_ACACHE_BLOCKSIZE_128_V << CACHE_L1_ACACHE_BLOCKSIZE_128_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_128_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_128_S  4
/** CACHE_L1_ACACHE_BLOCKSIZE_256 : HRO; bitpos: [5]; default: 0;
 *  The field is used to configureblocksize of L1-ACache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ACACHE_BLOCKSIZE_256    (BIT(5))
#define CACHE_L1_ACACHE_BLOCKSIZE_256_M  (CACHE_L1_ACACHE_BLOCKSIZE_256_V << CACHE_L1_ACACHE_BLOCKSIZE_256_S)
#define CACHE_L1_ACACHE_BLOCKSIZE_256_V  0x00000001U
#define CACHE_L1_ACACHE_BLOCKSIZE_256_S  5

/** CACHE_L1_ICACHE_CACHESIZE_CONF_REG register
 *  L1 instruction Cache CacheSize mode configure register
 */
#define CACHE_L1_ICACHE_CACHESIZE_CONF_REG (DR_REG_CACHE_BASE + 0x18)
/** CACHE_L1_ICACHE_CACHESIZE_256 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_256    (BIT(0))
#define CACHE_L1_ICACHE_CACHESIZE_256_M  (CACHE_L1_ICACHE_CACHESIZE_256_V << CACHE_L1_ICACHE_CACHESIZE_256_S)
#define CACHE_L1_ICACHE_CACHESIZE_256_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_256_S  0
/** CACHE_L1_ICACHE_CACHESIZE_512 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 512 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_512    (BIT(1))
#define CACHE_L1_ICACHE_CACHESIZE_512_M  (CACHE_L1_ICACHE_CACHESIZE_512_V << CACHE_L1_ICACHE_CACHESIZE_512_S)
#define CACHE_L1_ICACHE_CACHESIZE_512_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_512_S  1
/** CACHE_L1_ICACHE_CACHESIZE_1K : HRO; bitpos: [2]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 1k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_1K    (BIT(2))
#define CACHE_L1_ICACHE_CACHESIZE_1K_M  (CACHE_L1_ICACHE_CACHESIZE_1K_V << CACHE_L1_ICACHE_CACHESIZE_1K_S)
#define CACHE_L1_ICACHE_CACHESIZE_1K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_1K_S  2
/** CACHE_L1_ICACHE_CACHESIZE_2K : HRO; bitpos: [3]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 2k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_2K    (BIT(3))
#define CACHE_L1_ICACHE_CACHESIZE_2K_M  (CACHE_L1_ICACHE_CACHESIZE_2K_V << CACHE_L1_ICACHE_CACHESIZE_2K_S)
#define CACHE_L1_ICACHE_CACHESIZE_2K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_2K_S  3
/** CACHE_L1_ICACHE_CACHESIZE_4K : HRO; bitpos: [4]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 4k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_4K    (BIT(4))
#define CACHE_L1_ICACHE_CACHESIZE_4K_M  (CACHE_L1_ICACHE_CACHESIZE_4K_V << CACHE_L1_ICACHE_CACHESIZE_4K_S)
#define CACHE_L1_ICACHE_CACHESIZE_4K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_4K_S  4
/** CACHE_L1_ICACHE_CACHESIZE_8K : HRO; bitpos: [5]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 8k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_8K    (BIT(5))
#define CACHE_L1_ICACHE_CACHESIZE_8K_M  (CACHE_L1_ICACHE_CACHESIZE_8K_V << CACHE_L1_ICACHE_CACHESIZE_8K_S)
#define CACHE_L1_ICACHE_CACHESIZE_8K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_8K_S  5
/** CACHE_L1_ICACHE_CACHESIZE_16K : HRO; bitpos: [6]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 16k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_16K    (BIT(6))
#define CACHE_L1_ICACHE_CACHESIZE_16K_M  (CACHE_L1_ICACHE_CACHESIZE_16K_V << CACHE_L1_ICACHE_CACHESIZE_16K_S)
#define CACHE_L1_ICACHE_CACHESIZE_16K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_16K_S  6
/** CACHE_L1_ICACHE_CACHESIZE_32K : HRO; bitpos: [7]; default: 1;
 *  The field is used to configure cachesize of L1-ICache as 32k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_ICACHE_CACHESIZE_32K    (BIT(7))
#define CACHE_L1_ICACHE_CACHESIZE_32K_M  (CACHE_L1_ICACHE_CACHESIZE_32K_V << CACHE_L1_ICACHE_CACHESIZE_32K_S)
#define CACHE_L1_ICACHE_CACHESIZE_32K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_32K_S  7
/** CACHE_L1_ICACHE_CACHESIZE_64K : HRO; bitpos: [8]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 64k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_64K    (BIT(8))
#define CACHE_L1_ICACHE_CACHESIZE_64K_M  (CACHE_L1_ICACHE_CACHESIZE_64K_V << CACHE_L1_ICACHE_CACHESIZE_64K_S)
#define CACHE_L1_ICACHE_CACHESIZE_64K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_64K_S  8
/** CACHE_L1_ICACHE_CACHESIZE_128K : HRO; bitpos: [9]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 128k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_128K    (BIT(9))
#define CACHE_L1_ICACHE_CACHESIZE_128K_M  (CACHE_L1_ICACHE_CACHESIZE_128K_V << CACHE_L1_ICACHE_CACHESIZE_128K_S)
#define CACHE_L1_ICACHE_CACHESIZE_128K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_128K_S  9
/** CACHE_L1_ICACHE_CACHESIZE_256K : HRO; bitpos: [10]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 256k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_256K    (BIT(10))
#define CACHE_L1_ICACHE_CACHESIZE_256K_M  (CACHE_L1_ICACHE_CACHESIZE_256K_V << CACHE_L1_ICACHE_CACHESIZE_256K_S)
#define CACHE_L1_ICACHE_CACHESIZE_256K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_256K_S  10
/** CACHE_L1_ICACHE_CACHESIZE_512K : HRO; bitpos: [11]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 512k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_512K    (BIT(11))
#define CACHE_L1_ICACHE_CACHESIZE_512K_M  (CACHE_L1_ICACHE_CACHESIZE_512K_V << CACHE_L1_ICACHE_CACHESIZE_512K_S)
#define CACHE_L1_ICACHE_CACHESIZE_512K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_512K_S  11
/** CACHE_L1_ICACHE_CACHESIZE_1024K : HRO; bitpos: [12]; default: 0;
 *  The field is used to configure cachesize of L1-ICache as 1024k bytes. This field
 *  and all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_CACHESIZE_1024K    (BIT(12))
#define CACHE_L1_ICACHE_CACHESIZE_1024K_M  (CACHE_L1_ICACHE_CACHESIZE_1024K_V << CACHE_L1_ICACHE_CACHESIZE_1024K_S)
#define CACHE_L1_ICACHE_CACHESIZE_1024K_V  0x00000001U
#define CACHE_L1_ICACHE_CACHESIZE_1024K_S  12

/** CACHE_L1_ICACHE_BLOCKSIZE_CONF_REG register
 *  L1 instruction Cache BlockSize mode configure register
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_CONF_REG (DR_REG_CACHE_BASE + 0x1c)
/** CACHE_L1_ICACHE_BLOCKSIZE_8 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configureblocksize of L1-ICache as 8 bytes. This field and all
 *  other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_8    (BIT(0))
#define CACHE_L1_ICACHE_BLOCKSIZE_8_M  (CACHE_L1_ICACHE_BLOCKSIZE_8_V << CACHE_L1_ICACHE_BLOCKSIZE_8_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_8_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_8_S  0
/** CACHE_L1_ICACHE_BLOCKSIZE_16 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configureblocksize of L1-ICache as 16 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_16    (BIT(1))
#define CACHE_L1_ICACHE_BLOCKSIZE_16_M  (CACHE_L1_ICACHE_BLOCKSIZE_16_V << CACHE_L1_ICACHE_BLOCKSIZE_16_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_16_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_16_S  1
/** CACHE_L1_ICACHE_BLOCKSIZE_32 : HRO; bitpos: [2]; default: 0;
 *  The field is used to configureblocksize of L1-ICache as 32 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_32    (BIT(2))
#define CACHE_L1_ICACHE_BLOCKSIZE_32_M  (CACHE_L1_ICACHE_BLOCKSIZE_32_V << CACHE_L1_ICACHE_BLOCKSIZE_32_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_32_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_32_S  2
/** CACHE_L1_ICACHE_BLOCKSIZE_64 : HRO; bitpos: [3]; default: 1;
 *  The field is used to configureblocksize of L1-ICache as 64 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_64    (BIT(3))
#define CACHE_L1_ICACHE_BLOCKSIZE_64_M  (CACHE_L1_ICACHE_BLOCKSIZE_64_V << CACHE_L1_ICACHE_BLOCKSIZE_64_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_64_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_64_S  3
/** CACHE_L1_ICACHE_BLOCKSIZE_128 : HRO; bitpos: [4]; default: 0;
 *  The field is used to configureblocksize of L1-ICache as 128 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_128    (BIT(4))
#define CACHE_L1_ICACHE_BLOCKSIZE_128_M  (CACHE_L1_ICACHE_BLOCKSIZE_128_V << CACHE_L1_ICACHE_BLOCKSIZE_128_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_128_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_128_S  4
/** CACHE_L1_ICACHE_BLOCKSIZE_256 : HRO; bitpos: [5]; default: 0;
 *  The field is used to configureblocksize of L1-ICache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE_BLOCKSIZE_256    (BIT(5))
#define CACHE_L1_ICACHE_BLOCKSIZE_256_M  (CACHE_L1_ICACHE_BLOCKSIZE_256_V << CACHE_L1_ICACHE_BLOCKSIZE_256_S)
#define CACHE_L1_ICACHE_BLOCKSIZE_256_V  0x00000001U
#define CACHE_L1_ICACHE_BLOCKSIZE_256_S  5

