espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_DCACHE_CACHESIZE_CONF_REG register
 *  L1 data Cache CacheSize mode configure register
 */
#define CACHE_L1_DCACHE_CACHESIZE_CONF_REG (DR_REG_CACHE_BASE + 0x20)
/** CACHE_L1_DCACHE_CACHESIZE_256 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_256    (BIT(0))
#define CACHE_L1_DCACHE_CACHESIZE_256_M  (CACHE_L1_DCACHE_CACHESIZE_256_V << CACHE_L1_DCACHE_CACHESIZE_256_S)
#define CACHE_L1_DCACHE_CACHESIZE_256_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_256_S  0
/** CACHE_L1_DCACHE_CACHESIZE_512 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 512 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_512    (BIT(1))
#define CACHE_L1_DCACHE_CACHESIZE_512_M  (CACHE_L1_DCACHE_CACHESIZE_512_V << CACHE_L1_DCACHE_CACHESIZE_512_S)
#define CACHE_L1_DCACHE_CACHESIZE_512_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_512_S  1
/** CACHE_L1_DCACHE_CACHESIZE_1K : HRO; bitpos: [2]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 1k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_1K    (BIT(2))
#define CACHE_L1_DCACHE_CACHESIZE_1K_M  (CACHE_L1_DCACHE_CACHESIZE_1K_V << CACHE_L1_DCACHE_CACHESIZE_1K_S)
#define CACHE_L1_DCACHE_CACHESIZE_1K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_1K_S  2
/** CACHE_L1_DCACHE_CACHESIZE_2K : HRO; bitpos: [3]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 2k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_2K    (BIT(3))
#define CACHE_L1_DCACHE_CACHESIZE_2K_M  (CACHE_L1_DCACHE_CACHESIZE_2K_V << CACHE_L1_DCACHE_CACHESIZE_2K_S)
#define CACHE_L1_DCACHE_CACHESIZE_2K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_2K_S  3
/** CACHE_L1_DCACHE_CACHESIZE_4K : HRO; bitpos: [4]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 4k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_4K    (BIT(4))
#define CACHE_L1_DCACHE_CACHESIZE_4K_M  (CACHE_L1_DCACHE_CACHESIZE_4K_V << CACHE_L1_DCACHE_CACHESIZE_4K_S)
#define CACHE_L1_DCACHE_CACHESIZE_4K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_4K_S  4
/** CACHE_L1_DCACHE_CACHESIZE_8K : HRO; bitpos: [5]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 8k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_8K    (BIT(5))
#define CACHE_L1_DCACHE_CACHESIZE_8K_M  (CACHE_L1_DCACHE_CACHESIZE_8K_V << CACHE_L1_DCACHE_CACHESIZE_8K_S)
#define CACHE_L1_DCACHE_CACHESIZE_8K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_8K_S  5
/** CACHE_L1_DCACHE_CACHESIZE_16K : HRO; bitpos: [6]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 16k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_16K    (BIT(6))
#define CACHE_L1_DCACHE_CACHESIZE_16K_M  (CACHE_L1_DCACHE_CACHESIZE_16K_V << CACHE_L1_DCACHE_CACHESIZE_16K_S)
#define CACHE_L1_DCACHE_CACHESIZE_16K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_16K_S  6
/** CACHE_L1_DCACHE_CACHESIZE_32K : HRO; bitpos: [7]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 32k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_32K    (BIT(7))
#define CACHE_L1_DCACHE_CACHESIZE_32K_M  (CACHE_L1_DCACHE_CACHESIZE_32K_V << CACHE_L1_DCACHE_CACHESIZE_32K_S)
#define CACHE_L1_DCACHE_CACHESIZE_32K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_32K_S  7
/** CACHE_L1_DCACHE_CACHESIZE_64K : HRO; bitpos: [8]; default: 1;
 *  The field is used to configure cachesize of L1-DCache as 64k bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_DCACHE_CACHESIZE_64K    (BIT(8))
#define CACHE_L1_DCACHE_CACHESIZE_64K_M  (CACHE_L1_DCACHE_CACHESIZE_64K_V << CACHE_L1_DCACHE_CACHESIZE_64K_S)
#define CACHE_L1_DCACHE_CACHESIZE_64K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_64K_S  8
/** CACHE_L1_DCACHE_CACHESIZE_128K : HRO; bitpos: [9]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 128k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_128K    (BIT(9))
#define CACHE_L1_DCACHE_CACHESIZE_128K_M  (CACHE_L1_DCACHE_CACHESIZE_128K_V << CACHE_L1_DCACHE_CACHESIZE_128K_S)
#define CACHE_L1_DCACHE_CACHESIZE_128K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_128K_S  9
/** CACHE_L1_DCACHE_CACHESIZE_256K : HRO; bitpos: [10]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 256k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_256K    (BIT(10))
#define CACHE_L1_DCACHE_CACHESIZE_256K_M  (CACHE_L1_DCACHE_CACHESIZE_256K_V << CACHE_L1_DCACHE_CACHESIZE_256K_S)
#define CACHE_L1_DCACHE_CACHESIZE_256K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_256K_S  10
/** CACHE_L1_DCACHE_CACHESIZE_512K : HRO; bitpos: [11]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 512k bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_512K    (BIT(11))
#define CACHE_L1_DCACHE_CACHESIZE_512K_M  (CACHE_L1_DCACHE_CACHESIZE_512K_V << CACHE_L1_DCACHE_CACHESIZE_512K_S)
#define CACHE_L1_DCACHE_CACHESIZE_512K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_512K_S  11
/** CACHE_L1_DCACHE_CACHESIZE_1024K : HRO; bitpos: [12]; default: 0;
 *  The field is used to configure cachesize of L1-DCache as 1024k bytes. This field
 *  and all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_CACHESIZE_1024K    (BIT(12))
#define CACHE_L1_DCACHE_CACHESIZE_1024K_M  (CACHE_L1_DCACHE_CACHESIZE_1024K_V << CACHE_L1_DCACHE_CACHESIZE_1024K_S)
#define CACHE_L1_DCACHE_CACHESIZE_1024K_V  0x00000001U
#define CACHE_L1_DCACHE_CACHESIZE_1024K_S  12

