espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_DCACHE_BLOCKSIZE_CONF_REG register
 *  L1 data Cache BlockSize mode configure register
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_CONF_REG (DR_REG_CACHE_BASE + 0x24)
/** CACHE_L1_DCACHE_BLOCKSIZE_8 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 8 bytes. This field and all
 *  other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_8    (BIT(0))
#define CACHE_L1_DCACHE_BLOCKSIZE_8_M  (CACHE_L1_DCACHE_BLOCKSIZE_8_V << CACHE_L1_DCACHE_BLOCKSIZE_8_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_8_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_8_S  0
/** CACHE_L1_DCACHE_BLOCKSIZE_16 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 16 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_16    (BIT(1))
#define CACHE_L1_DCACHE_BLOCKSIZE_16_M  (CACHE_L1_DCACHE_BLOCKSIZE_16_V << CACHE_L1_DCACHE_BLOCKSIZE_16_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_16_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_16_S  1
/** CACHE_L1_DCACHE_BLOCKSIZE_32 : HRO; bitpos: [2]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 32 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_32    (BIT(2))
#define CACHE_L1_DCACHE_BLOCKSIZE_32_M  (CACHE_L1_DCACHE_BLOCKSIZE_32_V << CACHE_L1_DCACHE_BLOCKSIZE_32_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_32_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_32_S  2
/** CACHE_L1_DCACHE_BLOCKSIZE_64 : HRO; bitpos: [3]; default: 1;
 *  The field is used to configureblocksize of L1-DCache as 64 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_64    (BIT(3))
#define CACHE_L1_DCACHE_BLOCKSIZE_64_M  (CACHE_L1_DCACHE_BLOCKSIZE_64_V << CACHE_L1_DCACHE_BLOCKSIZE_64_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_64_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_64_S  3
/** CACHE_L1_DCACHE_BLOCKSIZE_128 : HRO; bitpos: [4]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 128 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_128    (BIT(4))
#define CACHE_L1_DCACHE_BLOCKSIZE_128_M  (CACHE_L1_DCACHE_BLOCKSIZE_128_V << CACHE_L1_DCACHE_BLOCKSIZE_128_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_128_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_128_S  4
/** CACHE_L1_DCACHE_BLOCKSIZE_256 : HRO; bitpos: [5]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_DCACHE_BLOCKSIZE_256    (BIT(5))
#define CACHE_L1_DCACHE_BLOCKSIZE_256_M  (CACHE_L1_DCACHE_BLOCKSIZE_256_V << CACHE_L1_DCACHE_BLOCKSIZE_256_S)
#define CACHE_L1_DCACHE_BLOCKSIZE_256_V  0x00000001U
#define CACHE_L1_DCACHE_BLOCKSIZE_256_S  5

/** CACHE_L1_CACHE_WRAP_AROUND_CTRL_REG register
 *  Cache wrap around control register
 */
#define CACHE_L1_CACHE_WRAP_AROUND_CTRL_REG (DR_REG_CACHE_BASE + 0x28)
/** CACHE_L1_ICACHE0_WRAP : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the critical word first function.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_WRAP    (BIT(0))
#define CACHE_L1_ICACHE0_WRAP_M  (CACHE_L1_ICACHE0_WRAP_V << CACHE_L1_ICACHE0_WRAP_S)
#define CACHE_L1_ICACHE0_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE0_WRAP_S  0
/** CACHE_L1_ICACHE1_WRAP : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable the critical word first function.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_WRAP    (BIT(1))
#define CACHE_L1_ICACHE1_WRAP_M  (CACHE_L1_ICACHE1_WRAP_V << CACHE_L1_ICACHE1_WRAP_S)
#define CACHE_L1_ICACHE1_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE1_WRAP_S  1
/** CACHE_L1_ICACHE2_WRAP : HRO; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_WRAP    (BIT(2))
#define CACHE_L1_ICACHE2_WRAP_M  (CACHE_L1_ICACHE2_WRAP_V << CACHE_L1_ICACHE2_WRAP_S)
#define CACHE_L1_ICACHE2_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE2_WRAP_S  2
/** CACHE_L1_ICACHE3_WRAP : HRO; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_WRAP    (BIT(3))
#define CACHE_L1_ICACHE3_WRAP_M  (CACHE_L1_ICACHE3_WRAP_V << CACHE_L1_ICACHE3_WRAP_S)
#define CACHE_L1_ICACHE3_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE3_WRAP_S  3
/** CACHE_L1_DCACHE_WRAP : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable the critical word first function.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_WRAP    (BIT(4))
#define CACHE_L1_DCACHE_WRAP_M  (CACHE_L1_DCACHE_WRAP_V << CACHE_L1_DCACHE_WRAP_S)
#define CACHE_L1_DCACHE_WRAP_V  0x00000001U
#define CACHE_L1_DCACHE_WRAP_S  4

/** CACHE_L1_CACHE_MISS_ACCESS_CTRL_REG register
 *  Cache wrap around control register
 */
#define CACHE_L1_CACHE_MISS_ACCESS_CTRL_REG (DR_REG_CACHE_BASE + 0x2c)
/** CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable early restart function.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS    (BIT(0))
#define CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS_M  (CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS_V << CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS_S)
#define CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS_V  0x00000001U
#define CACHE_L1_ICACHE0_MISS_DISABLE_ACCESS_S  0
/** CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable early restart function.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS    (BIT(1))
#define CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS_M  (CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS_V << CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS_S)
#define CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS_V  0x00000001U
#define CACHE_L1_ICACHE1_MISS_DISABLE_ACCESS_S  1
/** CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS    (BIT(2))
#define CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS_M  (CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS_V << CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS_S)
#define CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS_V  0x00000001U
#define CACHE_L1_ICACHE2_MISS_DISABLE_ACCESS_S  2
/** CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS    (BIT(3))
#define CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS_M  (CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS_V << CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS_S)
#define CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS_V  0x00000001U
#define CACHE_L1_ICACHE3_MISS_DISABLE_ACCESS_S  3
/** CACHE_L1_CACHE_MISS_DISABLE_ACCESS : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable early restart function.
 *  1: Enable
 */
#define CACHE_L1_CACHE_MISS_DISABLE_ACCESS    (BIT(4))
#define CACHE_L1_CACHE_MISS_DISABLE_ACCESS_M  (CACHE_L1_CACHE_MISS_DISABLE_ACCESS_V << CACHE_L1_CACHE_MISS_DISABLE_ACCESS_S)
#define CACHE_L1_CACHE_MISS_DISABLE_ACCESS_V  0x00000001U
#define CACHE_L1_CACHE_MISS_DISABLE_ACCESS_S  4

/** CACHE_L1_CACHE_FREEZE_CTRL_REG register
 *  Cache Freeze control register
 */
#define CACHE_L1_CACHE_FREEZE_CTRL_REG (DR_REG_CACHE_BASE + 0x30)
/** CACHE_L1_ICACHE0_FREEZE_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable freeze operation. It can be cleared by software.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_FREEZE_EN    (BIT(0))
#define CACHE_L1_ICACHE0_FREEZE_EN_M  (CACHE_L1_ICACHE0_FREEZE_EN_V << CACHE_L1_ICACHE0_FREEZE_EN_S)
#define CACHE_L1_ICACHE0_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_EN_S  0
/** CACHE_L1_ICACHE0_FREEZE_MODE : R/W; bitpos: [1]; default: 0;
 *  Configures the freeze mode.
 *  1: Assert hit if a cache miss occurs
 */
#define CACHE_L1_ICACHE0_FREEZE_MODE    (BIT(1))
#define CACHE_L1_ICACHE0_FREEZE_MODE_M  (CACHE_L1_ICACHE0_FREEZE_MODE_V << CACHE_L1_ICACHE0_FREEZE_MODE_S)
#define CACHE_L1_ICACHE0_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_MODE_S  1
/** CACHE_L1_ICACHE0_FREEZE_DONE : RO; bitpos: [2]; default: 0;
 *  Indicates whether the freeze operation has finished.
 *  1: Finished
 */
#define CACHE_L1_ICACHE0_FREEZE_DONE    (BIT(2))
#define CACHE_L1_ICACHE0_FREEZE_DONE_M  (CACHE_L1_ICACHE0_FREEZE_DONE_V << CACHE_L1_ICACHE0_FREEZE_DONE_S)
#define CACHE_L1_ICACHE0_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_DONE_S  2
/** CACHE_L1_ICACHE1_FREEZE_EN : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable freeze operation. It can be cleared by software.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_FREEZE_EN    (BIT(4))
#define CACHE_L1_ICACHE1_FREEZE_EN_M  (CACHE_L1_ICACHE1_FREEZE_EN_V << CACHE_L1_ICACHE1_FREEZE_EN_S)
#define CACHE_L1_ICACHE1_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_EN_S  4
/** CACHE_L1_ICACHE1_FREEZE_MODE : R/W; bitpos: [5]; default: 0;
 *  Configures the freeze mode.
 *  1: Assert hit if a cache miss occurs
 */
#define CACHE_L1_ICACHE1_FREEZE_MODE    (BIT(5))
#define CACHE_L1_ICACHE1_FREEZE_MODE_M  (CACHE_L1_ICACHE1_FREEZE_MODE_V << CACHE_L1_ICACHE1_FREEZE_MODE_S)
#define CACHE_L1_ICACHE1_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_MODE_S  5
/** CACHE_L1_ICACHE1_FREEZE_DONE : RO; bitpos: [6]; default: 0;
 *  Indicates whether the freeze operation has finished.
 *  1: Finished
 */
#define CACHE_L1_ICACHE1_FREEZE_DONE    (BIT(6))
#define CACHE_L1_ICACHE1_FREEZE_DONE_M  (CACHE_L1_ICACHE1_FREEZE_DONE_V << CACHE_L1_ICACHE1_FREEZE_DONE_S)
#define CACHE_L1_ICACHE1_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_DONE_S  6
/** CACHE_L1_ICACHE2_FREEZE_EN : HRO; bitpos: [8]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_FREEZE_EN    (BIT(8))
#define CACHE_L1_ICACHE2_FREEZE_EN_M  (CACHE_L1_ICACHE2_FREEZE_EN_V << CACHE_L1_ICACHE2_FREEZE_EN_S)
#define CACHE_L1_ICACHE2_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_EN_S  8
/** CACHE_L1_ICACHE2_FREEZE_MODE : HRO; bitpos: [9]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_FREEZE_MODE    (BIT(9))
#define CACHE_L1_ICACHE2_FREEZE_MODE_M  (CACHE_L1_ICACHE2_FREEZE_MODE_V << CACHE_L1_ICACHE2_FREEZE_MODE_S)
#define CACHE_L1_ICACHE2_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_MODE_S  9
/** CACHE_L1_ICACHE2_FREEZE_DONE : RO; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_FREEZE_DONE    (BIT(10))
#define CACHE_L1_ICACHE2_FREEZE_DONE_M  (CACHE_L1_ICACHE2_FREEZE_DONE_V << CACHE_L1_ICACHE2_FREEZE_DONE_S)
#define CACHE_L1_ICACHE2_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_DONE_S  10
/** CACHE_L1_ICACHE3_FREEZE_EN : HRO; bitpos: [12]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_FREEZE_EN    (BIT(12))
#define CACHE_L1_ICACHE3_FREEZE_EN_M  (CACHE_L1_ICACHE3_FREEZE_EN_V << CACHE_L1_ICACHE3_FREEZE_EN_S)
#define CACHE_L1_ICACHE3_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_EN_S  12
/** CACHE_L1_ICACHE3_FREEZE_MODE : HRO; bitpos: [13]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_FREEZE_MODE    (BIT(13))
#define CACHE_L1_ICACHE3_FREEZE_MODE_M  (CACHE_L1_ICACHE3_FREEZE_MODE_V << CACHE_L1_ICACHE3_FREEZE_MODE_S)
#define CACHE_L1_ICACHE3_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_MODE_S  13
/** CACHE_L1_ICACHE3_FREEZE_DONE : RO; bitpos: [14]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_FREEZE_DONE    (BIT(14))
#define CACHE_L1_ICACHE3_FREEZE_DONE_M  (CACHE_L1_ICACHE3_FREEZE_DONE_V << CACHE_L1_ICACHE3_FREEZE_DONE_S)
#define CACHE_L1_ICACHE3_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_DONE_S  14
/** CACHE_L1_DCACHE_FREEZE_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether to enable freeze operation. It can be cleared by software.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_FREEZE_EN    (BIT(16))
#define CACHE_L1_DCACHE_FREEZE_EN_M  (CACHE_L1_DCACHE_FREEZE_EN_V << CACHE_L1_DCACHE_FREEZE_EN_S)
#define CACHE_L1_DCACHE_FREEZE_EN_V  0x00000001U
#define CACHE_L1_DCACHE_FREEZE_EN_S  16
/** CACHE_L1_DCACHE_FREEZE_MODE : R/W; bitpos: [17]; default: 0;
 *  Configures the freeze mode.
 *  1: Assert hit if a cache miss occurs
 */
#define CACHE_L1_DCACHE_FREEZE_MODE    (BIT(17))
#define CACHE_L1_DCACHE_FREEZE_MODE_M  (CACHE_L1_DCACHE_FREEZE_MODE_V << CACHE_L1_DCACHE_FREEZE_MODE_S)
#define CACHE_L1_DCACHE_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_DCACHE_FREEZE_MODE_S  17
/** CACHE_L1_DCACHE_FREEZE_DONE : RO; bitpos: [18]; default: 0;
 *  Indicates whether the freeze operation has finished.
 *  1: Finished
 */
#define CACHE_L1_DCACHE_FREEZE_DONE    (BIT(18))
#define CACHE_L1_DCACHE_FREEZE_DONE_M  (CACHE_L1_DCACHE_FREEZE_DONE_V << CACHE_L1_DCACHE_FREEZE_DONE_S)
#define CACHE_L1_DCACHE_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_DCACHE_FREEZE_DONE_S  18

/** CACHE_L1_CACHE_DATA_MEM_ACS_CONF_REG register
 *  Cache data memory access configure register
 */
#define CACHE_L1_CACHE_DATA_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x34)
/** CACHE_L1_ICACHE0_DATA_MEM_RD_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache data memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN    (BIT(0))
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE0_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE0_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_RD_EN_S  0
/** CACHE_L1_ICACHE0_DATA_MEM_WR_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache data
 *  memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN    (BIT(1))
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE0_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE0_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_WR_EN_S  1
/** CACHE_L1_ICACHE1_DATA_MEM_RD_EN : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache data memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN    (BIT(4))
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE1_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE1_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_RD_EN_S  4
/** CACHE_L1_ICACHE1_DATA_MEM_WR_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache data
 *  memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN    (BIT(5))
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE1_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE1_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_WR_EN_S  5
/** CACHE_L1_ICACHE2_DATA_MEM_RD_EN : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN    (BIT(8))
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE2_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE2_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_RD_EN_S  8
/** CACHE_L1_ICACHE2_DATA_MEM_WR_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN    (BIT(9))
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE2_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE2_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_WR_EN_S  9
/** CACHE_L1_ICACHE3_DATA_MEM_RD_EN : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN    (BIT(12))
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_M  (CACHE_L1_ICACHE3_DATA_MEM_RD_EN_V << CACHE_L1_ICACHE3_DATA_MEM_RD_EN_S)
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_RD_EN_S  12
/** CACHE_L1_ICACHE3_DATA_MEM_WR_EN : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN    (BIT(13))
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_M  (CACHE_L1_ICACHE3_DATA_MEM_WR_EN_V << CACHE_L1_ICACHE3_DATA_MEM_WR_EN_S)
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_WR_EN_S  13
/** CACHE_L1_DCACHE_DATA_MEM_RD_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache data memory.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN    (BIT(16))
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_M  (CACHE_L1_DCACHE_DATA_MEM_RD_EN_V << CACHE_L1_DCACHE_DATA_MEM_RD_EN_S)
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_DCACHE_DATA_MEM_RD_EN_S  16
/** CACHE_L1_DCACHE_DATA_MEM_WR_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache data
 *  memory.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN    (BIT(17))
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_M  (CACHE_L1_DCACHE_DATA_MEM_WR_EN_V << CACHE_L1_DCACHE_DATA_MEM_WR_EN_S)
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_DCACHE_DATA_MEM_WR_EN_S  17

