espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_CACHE_TAG_MEM_ACS_CONF_REG register
 *  Cache tag memory access configure register
 */
#define CACHE_L1_CACHE_TAG_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x38)
/** CACHE_L1_ICACHE0_TAG_MEM_RD_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN    (BIT(0))
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE0_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE0_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_RD_EN_S  0
/** CACHE_L1_ICACHE0_TAG_MEM_WR_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN    (BIT(1))
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE0_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE0_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_WR_EN_S  1
/** CACHE_L1_ICACHE1_TAG_MEM_RD_EN : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN    (BIT(4))
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE1_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE1_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_RD_EN_S  4
/** CACHE_L1_ICACHE1_TAG_MEM_WR_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN    (BIT(5))
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE1_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE1_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_WR_EN_S  5
/** CACHE_L1_ICACHE2_TAG_MEM_RD_EN : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN    (BIT(8))
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE2_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE2_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_RD_EN_S  8
/** CACHE_L1_ICACHE2_TAG_MEM_WR_EN : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN    (BIT(9))
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE2_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE2_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_WR_EN_S  9
/** CACHE_L1_ICACHE3_TAG_MEM_RD_EN : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN    (BIT(12))
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_M  (CACHE_L1_ICACHE3_TAG_MEM_RD_EN_V << CACHE_L1_ICACHE3_TAG_MEM_RD_EN_S)
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_RD_EN_S  12
/** CACHE_L1_ICACHE3_TAG_MEM_WR_EN : R/W; bitpos: [13]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN    (BIT(13))
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_M  (CACHE_L1_ICACHE3_TAG_MEM_WR_EN_V << CACHE_L1_ICACHE3_TAG_MEM_WR_EN_S)
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_WR_EN_S  13
/** CACHE_L1_DCACHE_TAG_MEM_RD_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether to enable the configuration bus to read the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN    (BIT(16))
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_M  (CACHE_L1_DCACHE_TAG_MEM_RD_EN_V << CACHE_L1_DCACHE_TAG_MEM_RD_EN_S)
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L1_DCACHE_TAG_MEM_RD_EN_S  16
/** CACHE_L1_DCACHE_TAG_MEM_WR_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether to enable the configuration bus to write the L1 cache tag memory.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN    (BIT(17))
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_M  (CACHE_L1_DCACHE_TAG_MEM_WR_EN_V << CACHE_L1_DCACHE_TAG_MEM_WR_EN_S)
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L1_DCACHE_TAG_MEM_WR_EN_S  17

/** CACHE_L1_ICACHE0_PRELOCK_CONF_REG register
 *  L1 instruction Cache 0 prelock configure register
 */
#define CACHE_L1_ICACHE0_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x3c)
/** CACHE_L1_ICACHE0_PRELOCK_SCT0_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the prelocking function in Section 0 of icache.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_EN_M  (CACHE_L1_ICACHE0_PRELOCK_SCT0_EN_V << CACHE_L1_ICACHE0_PRELOCK_SCT0_EN_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_EN_S  0
/** CACHE_L1_ICACHE0_PRELOCK_SCT1_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable the prelocking function in Section 1 of icache.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_EN_M  (CACHE_L1_ICACHE0_PRELOCK_SCT1_EN_V << CACHE_L1_ICACHE0_PRELOCK_SCT1_EN_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_EN_S  1
/** CACHE_L1_ICACHE0_PRELOCK_RGID : R/W; bitpos: [5:2]; default: 0;
 *  Configures the gid of l1 icache0 prelock.
 */
#define CACHE_L1_ICACHE0_PRELOCK_RGID    0x0000000FU
#define CACHE_L1_ICACHE0_PRELOCK_RGID_M  (CACHE_L1_ICACHE0_PRELOCK_RGID_V << CACHE_L1_ICACHE0_PRELOCK_RGID_S)
#define CACHE_L1_ICACHE0_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE0_PRELOCK_RGID_S  2

/** CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_REG register
 *  L1 instruction Cache 0 prelock section0 address configure register
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x40)
/** CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section of prelock on L1-ICache0, which
 *  should be used together with L1_ICACHE0_PRELOCK_SCT0_SIZE_REG
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_M  (CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_V << CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_REG register
 *  L1 instruction Cache 0 prelock section1 address configure register
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x44)
/** CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section of prelock on L1-ICache0, which
 *  should be used together with L1_ICACHE0_PRELOCK_SCT1_SIZE_REG
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_M  (CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_V << CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE0_PRELOCK_SCT_SIZE_REG register
 *  L1 instruction Cache 0 prelock section size configure register
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x48)
/** CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE : R/W; bitpos: [13:0]; default: 16383;
 *  Configures the size of the first section of prelock on L1-ICache0, which should be
 *  used together with L1_ICACHE0_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE_M  (CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE_V << CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE : R/W; bitpos: [29:16]; default: 16383;
 *  Configures the size of the second section of prelock on L1-ICache0, which should be
 *  used together with L1_ICACHE0_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE_M  (CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE_V << CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE_S)
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOCK_SCT1_SIZE_S  16

/** CACHE_L1_ICACHE1_PRELOCK_CONF_REG register
 *  L1 instruction Cache 1 prelock configure register
 */
#define CACHE_L1_ICACHE1_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x4c)
/** CACHE_L1_ICACHE1_PRELOCK_SCT0_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the prelocking function in Section 0 of icache.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_EN_M  (CACHE_L1_ICACHE1_PRELOCK_SCT0_EN_V << CACHE_L1_ICACHE1_PRELOCK_SCT0_EN_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_EN_S  0
/** CACHE_L1_ICACHE1_PRELOCK_SCT1_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable the prelocking function in Section 1 of icache.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_EN_M  (CACHE_L1_ICACHE1_PRELOCK_SCT1_EN_V << CACHE_L1_ICACHE1_PRELOCK_SCT1_EN_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_EN_S  1
/** CACHE_L1_ICACHE1_PRELOCK_RGID : R/W; bitpos: [5:2]; default: 0;
 *  Configures the gid of l1 icache1 prelock.
 */
#define CACHE_L1_ICACHE1_PRELOCK_RGID    0x0000000FU
#define CACHE_L1_ICACHE1_PRELOCK_RGID_M  (CACHE_L1_ICACHE1_PRELOCK_RGID_V << CACHE_L1_ICACHE1_PRELOCK_RGID_S)
#define CACHE_L1_ICACHE1_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE1_PRELOCK_RGID_S  2

/** CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_REG register
 *  L1 instruction Cache 1 prelock section0 address configure register
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x50)
/** CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start address of the first section of prelock
 *  on L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT0_SIZE_REG
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_M  (CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_V << CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_REG register
 *  L1 instruction Cache 1 prelock section1 address configure register
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x54)
/** CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section of prelock on L1-ICache1, which
 *  should be used together with L1_ICACHE1_PRELOCK_SCT1_SIZE_REG
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_M  (CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_V << CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE1_PRELOCK_SCT_SIZE_REG register
 *  L1 instruction Cache 1 prelock section size configure register
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x58)
/** CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE : R/W; bitpos: [13:0]; default: 16383;
 *  Configures the size of the first section of prelock on L1-ICache1, which should be
 *  used together with L1_ICACHE1_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE_M  (CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE_V << CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE : R/W; bitpos: [29:16]; default: 16383;
 *  Configures the size of the second section of prelock on L1-ICache1, which should be
 *  used together with L1_ICACHE1_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE_M  (CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE_V << CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE_S)
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOCK_SCT1_SIZE_S  16

/** CACHE_L1_ICACHE2_PRELOCK_CONF_REG register
 *  L1 instruction Cache 2 prelock configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x5c)
/** CACHE_L1_ICACHE2_PRELOCK_SCT0_EN : HRO; bitpos: [0]; default: 0;
 *  Configures the first section of prelock function on L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_EN_M  (CACHE_L1_ICACHE2_PRELOCK_SCT0_EN_V << CACHE_L1_ICACHE2_PRELOCK_SCT0_EN_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_EN_S  0
/** CACHE_L1_ICACHE2_PRELOCK_SCT1_EN : HRO; bitpos: [1]; default: 0;
 *  Configures the second section of prelock function on L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_EN_M  (CACHE_L1_ICACHE2_PRELOCK_SCT1_EN_V << CACHE_L1_ICACHE2_PRELOCK_SCT1_EN_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_EN_S  1
/** CACHE_L1_ICACHE2_PRELOCK_RGID : HRO; bitpos: [5:2]; default: 0;
 *  Configures the gid of l1 icache2 prelock.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_RGID    0x0000000FU
#define CACHE_L1_ICACHE2_PRELOCK_RGID_M  (CACHE_L1_ICACHE2_PRELOCK_RGID_V << CACHE_L1_ICACHE2_PRELOCK_RGID_S)
#define CACHE_L1_ICACHE2_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE2_PRELOCK_RGID_S  2

/** CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_REG register
 *  L1 instruction Cache 2 prelock section0 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x60)
/** CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section of prelock on L1-ICache2, which
 *  should be used together with L1_ICACHE2_PRELOCK_SCT0_SIZE_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_M  (CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_V << CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_REG register
 *  L1 instruction Cache 2 prelock section1 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x64)
/** CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section of prelock on L1-ICache2, which
 *  should be used together with L1_ICACHE2_PRELOCK_SCT1_SIZE_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_M  (CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_V << CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_S)
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOCK_SCT1_ADDR_S  0

