espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_LOCK_SIZE_REG register
 *  Lock (manual lock) size configure register
 */
#define CACHE_LOCK_SIZE_REG (DR_REG_CACHE_BASE + 0x98)
/** CACHE_LOCK_SIZE : R/W; bitpos: [15:0]; default: 0;
 *  Configures the size of the lock/unlock operation, which should be used together
 *  with CACHE_LOCK_ADDR_REG
 */
#define CACHE_LOCK_SIZE    0x0000FFFFU
#define CACHE_LOCK_SIZE_M  (CACHE_LOCK_SIZE_V << CACHE_LOCK_SIZE_S)
#define CACHE_LOCK_SIZE_V  0x0000FFFFU
#define CACHE_LOCK_SIZE_S  0

/** CACHE_SYNC_CTRL_REG register
 *  Sync-class operation control register
 */
#define CACHE_SYNC_CTRL_REG (DR_REG_CACHE_BASE + 0x9c)
/** CACHE_INVALIDATE_ENA : R/W/SC; bitpos: [0]; default: 1;
 *  Configures whether to enable the invalidation operation. Hardware will clear it
 *  once the operation has finished.
 *  Please note that this field, along with the other fields (CLEAN_ENA, WRITEBACK_ENA,
 *  WRITEBACK_INVALIDATE_ENA), is mutually exclusive. In other words, only one of these
 *  fields can be set to 1 at any given time.
 */
#define CACHE_INVALIDATE_ENA    (BIT(0))
#define CACHE_INVALIDATE_ENA_M  (CACHE_INVALIDATE_ENA_V << CACHE_INVALIDATE_ENA_S)
#define CACHE_INVALIDATE_ENA_V  0x00000001U
#define CACHE_INVALIDATE_ENA_S  0
/** CACHE_CLEAN_ENA : R/W/SC; bitpos: [1]; default: 0;
 *  Configures whether to enable the clean operation. Hardware will clear it once the
 *  operation has finished.
 *  1: Enable
 */
#define CACHE_CLEAN_ENA    (BIT(1))
#define CACHE_CLEAN_ENA_M  (CACHE_CLEAN_ENA_V << CACHE_CLEAN_ENA_S)
#define CACHE_CLEAN_ENA_V  0x00000001U
#define CACHE_CLEAN_ENA_S  1
/** CACHE_WRITEBACK_ENA : R/W/SC; bitpos: [2]; default: 0;
 *  Configures whether to enable the write-back operation. Hardware will clear it once
 *  the operation has finished.
 *  1: Enable
 */
#define CACHE_WRITEBACK_ENA    (BIT(2))
#define CACHE_WRITEBACK_ENA_M  (CACHE_WRITEBACK_ENA_V << CACHE_WRITEBACK_ENA_S)
#define CACHE_WRITEBACK_ENA_V  0x00000001U
#define CACHE_WRITEBACK_ENA_S  2
/** CACHE_WRITEBACK_INVALIDATE_ENA : R/W/SC; bitpos: [3]; default: 0;
 *  Configures whether to enable the write-back invalidation operation. Hardware will
 *  clear it once the operation has finished.
 *  1: Enable
 */
#define CACHE_WRITEBACK_INVALIDATE_ENA    (BIT(3))
#define CACHE_WRITEBACK_INVALIDATE_ENA_M  (CACHE_WRITEBACK_INVALIDATE_ENA_V << CACHE_WRITEBACK_INVALIDATE_ENA_S)
#define CACHE_WRITEBACK_INVALIDATE_ENA_V  0x00000001U
#define CACHE_WRITEBACK_INVALIDATE_ENA_S  3
/** CACHE_SYNC_DONE : RO; bitpos: [4]; default: 0;
 *  Indicates whether the synchronization operation has finished.
 *  1: Finished
 */
#define CACHE_SYNC_DONE    (BIT(4))
#define CACHE_SYNC_DONE_M  (CACHE_SYNC_DONE_V << CACHE_SYNC_DONE_S)
#define CACHE_SYNC_DONE_V  0x00000001U
#define CACHE_SYNC_DONE_S  4
/** CACHE_SYNC_RGID : R/W; bitpos: [8:5]; default: 0;
 *  Configures the gid of cache sync operation (invalidate, clean, writeback,
 *  writeback_invalidate)
 */
#define CACHE_SYNC_RGID    0x0000000FU
#define CACHE_SYNC_RGID_M  (CACHE_SYNC_RGID_V << CACHE_SYNC_RGID_S)
#define CACHE_SYNC_RGID_V  0x0000000FU
#define CACHE_SYNC_RGID_S  5

/** CACHE_SYNC_MAP_REG register
 *  Sync map configure register
 */
#define CACHE_SYNC_MAP_REG (DR_REG_CACHE_BASE + 0xa0)
/** CACHE_SYNC_MAP : R/W; bitpos: [5:0]; default: 31;
 *  Configures which cache to perform the locking or the unlocking operation.
 *  Other bits: Reserved
 */
#define CACHE_SYNC_MAP    0x0000003FU
#define CACHE_SYNC_MAP_M  (CACHE_SYNC_MAP_V << CACHE_SYNC_MAP_S)
#define CACHE_SYNC_MAP_V  0x0000003FU
#define CACHE_SYNC_MAP_S  0

/** CACHE_SYNC_ADDR_REG register
 *  Sync address configure register
 */
#define CACHE_SYNC_ADDR_REG (DR_REG_CACHE_BASE + 0xa4)
/** CACHE_SYNC_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the sync operation, which should be used together
 *  with CACHE_SYNC_SIZE_REG
 */
#define CACHE_SYNC_ADDR    0xFFFFFFFFU
#define CACHE_SYNC_ADDR_M  (CACHE_SYNC_ADDR_V << CACHE_SYNC_ADDR_S)
#define CACHE_SYNC_ADDR_V  0xFFFFFFFFU
#define CACHE_SYNC_ADDR_S  0

/** CACHE_SYNC_SIZE_REG register
 *  Sync size configure register
 */
#define CACHE_SYNC_SIZE_REG (DR_REG_CACHE_BASE + 0xa8)
/** CACHE_SYNC_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the sync operation, which should be used together with
 *  CACHE_SYNC_ADDR_REG
 */
#define CACHE_SYNC_SIZE    0x0FFFFFFFU
#define CACHE_SYNC_SIZE_M  (CACHE_SYNC_SIZE_V << CACHE_SYNC_SIZE_S)
#define CACHE_SYNC_SIZE_V  0x0FFFFFFFU
#define CACHE_SYNC_SIZE_S  0

/** CACHE_L1_ICACHE0_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 0 preload-operation control register
 */
#define CACHE_L1_ICACHE0_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xac)
/** CACHE_L1_ICACHE0_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  Configures whether to enable the preloading operation in icache0. Hardware will
 *  clear it once the operation has finished.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE0_PRELOAD_ENA_M  (CACHE_L1_ICACHE0_PRELOAD_ENA_V << CACHE_L1_ICACHE0_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE0_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE0_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  Represents whether the preloading operation has finished.
 *  1: Finished
 */
#define CACHE_L1_ICACHE0_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE0_PRELOAD_DONE_M  (CACHE_L1_ICACHE0_PRELOAD_DONE_V << CACHE_L1_ICACHE0_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE0_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE0_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  Configures the direction of the preloading operation.
 *  1: Descending
 */
#define CACHE_L1_ICACHE0_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE0_PRELOAD_ORDER_M  (CACHE_L1_ICACHE0_PRELOAD_ORDER_V << CACHE_L1_ICACHE0_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE0_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE0_PRELOAD_RGID : R/W; bitpos: [6:3]; default: 0;
 *  Configures the gid of l1 icache0 preload.
 */
#define CACHE_L1_ICACHE0_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE0_PRELOAD_RGID_M  (CACHE_L1_ICACHE0_PRELOAD_RGID_V << CACHE_L1_ICACHE0_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE0_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE0_PRELOAD_RGID_S  3
/** CACHE_L1_ICACHE0_PRELOAD_MODE : R/W; bitpos: [7]; default: 0;
 *  Configures the mode of l1 icache0 preload, 0: load data from next level memory, 1:
 *  not load data from next level memory.
 */
#define CACHE_L1_ICACHE0_PRELOAD_MODE    (BIT(7))
#define CACHE_L1_ICACHE0_PRELOAD_MODE_M  (CACHE_L1_ICACHE0_PRELOAD_MODE_V << CACHE_L1_ICACHE0_PRELOAD_MODE_S)
#define CACHE_L1_ICACHE0_PRELOAD_MODE_V  0x00000001U
#define CACHE_L1_ICACHE0_PRELOAD_MODE_S  7

/** CACHE_L1_ICACHE0_PRELOAD_ADDR_REG register
 *  icache0 preload address configuration register
 */
#define CACHE_L1_ICACHE0_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xb0)
/** CACHE_L1_ICACHE0_PRELOAD_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of preload on L1-ICache0, which should be used
 *  together with L1_ICACHE0_PRELOAD_SIZE_REG
 */
#define CACHE_L1_ICACHE0_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOAD_ADDR_M  (CACHE_L1_ICACHE0_PRELOAD_ADDR_V << CACHE_L1_ICACHE0_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE0_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_PRELOAD_ADDR_S  0

