espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_ICACHE0_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 0 preload size configure register
 */
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xb4)
/** CACHE_L1_ICACHE0_PRELOAD_SIZE : R/W; bitpos: [13:0]; default: 0;
 *  Configures the size of the first section of prelock on L1-ICache0, which should be
 *  used together with L1_ICACHE0_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE0_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_M  (CACHE_L1_ICACHE0_PRELOAD_SIZE_V << CACHE_L1_ICACHE0_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE1_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 1 preload-operation control register
 */
#define CACHE_L1_ICACHE1_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xb8)
/** CACHE_L1_ICACHE1_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  Configures whether to enable the preloading operation in icache1. Hardware will
 *  clear it once the operation has finished.
 *  1: Enable
 */
#define CACHE_L1_ICACHE1_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE1_PRELOAD_ENA_M  (CACHE_L1_ICACHE1_PRELOAD_ENA_V << CACHE_L1_ICACHE1_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE1_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE1_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  Represents whether the preloading operation has finished.
 *  1: Finished
 */
#define CACHE_L1_ICACHE1_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE1_PRELOAD_DONE_M  (CACHE_L1_ICACHE1_PRELOAD_DONE_V << CACHE_L1_ICACHE1_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE1_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE1_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  Configures the direction of the preloading operation.
 *  1: Descending
 */
#define CACHE_L1_ICACHE1_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_M  (CACHE_L1_ICACHE1_PRELOAD_ORDER_V << CACHE_L1_ICACHE1_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE1_PRELOAD_RGID : R/W; bitpos: [6:3]; default: 0;
 *  Configures the gid of l1 icache1 preload.
 */
#define CACHE_L1_ICACHE1_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE1_PRELOAD_RGID_M  (CACHE_L1_ICACHE1_PRELOAD_RGID_V << CACHE_L1_ICACHE1_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE1_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE1_PRELOAD_RGID_S  3
/** CACHE_L1_ICACHE1_PRELOAD_MODE : R/W; bitpos: [7]; default: 0;
 *  Configures the mode of l1 icache1 preload, 0: load data from next level memory, 1:
 *  not load data from next level memory.
 */
#define CACHE_L1_ICACHE1_PRELOAD_MODE    (BIT(7))
#define CACHE_L1_ICACHE1_PRELOAD_MODE_M  (CACHE_L1_ICACHE1_PRELOAD_MODE_V << CACHE_L1_ICACHE1_PRELOAD_MODE_S)
#define CACHE_L1_ICACHE1_PRELOAD_MODE_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_MODE_S  7

/** CACHE_L1_ICACHE1_PRELOAD_ADDR_REG register
 *  icache1 preload address configuration register
 */
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xbc)
/** CACHE_L1_ICACHE1_PRELOAD_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of preload on L1-ICache1, which should be used
 *  together with L1_ICACHE1_PRELOAD_SIZE_REG
 */
#define CACHE_L1_ICACHE1_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_M  (CACHE_L1_ICACHE1_PRELOAD_ADDR_V << CACHE_L1_ICACHE1_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE1_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 1 preload size configure register
 */
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xc0)
/** CACHE_L1_ICACHE1_PRELOAD_SIZE : R/W; bitpos: [13:0]; default: 0;
 *  Configures the size of the first section of prelock on L1-ICache1, which should be
 *  used together with L1_ICACHE1_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE1_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_M  (CACHE_L1_ICACHE1_PRELOAD_SIZE_V << CACHE_L1_ICACHE1_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE2_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 2 preload-operation control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xc4)
/** CACHE_L1_ICACHE2_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  Configures preload operation on L1-ICache2. It will be cleared by hardware
 *  automatically after preload operation is done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE2_PRELOAD_ENA_M  (CACHE_L1_ICACHE2_PRELOAD_ENA_V << CACHE_L1_ICACHE2_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE2_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE2_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE2_PRELOAD_DONE_M  (CACHE_L1_ICACHE2_PRELOAD_DONE_V << CACHE_L1_ICACHE2_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE2_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE2_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  Configures the direction of preload operation. 0: ascending, 1: descending.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_M  (CACHE_L1_ICACHE2_PRELOAD_ORDER_V << CACHE_L1_ICACHE2_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE2_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  Configures the gid of l1 icache2 preload.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE2_PRELOAD_RGID_M  (CACHE_L1_ICACHE2_PRELOAD_RGID_V << CACHE_L1_ICACHE2_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE2_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE2_PRELOAD_RGID_S  3
/** CACHE_L1_ICACHE2_PRELOAD_MODE : HRO; bitpos: [7]; default: 0;
 *  Configures the mode of l1 icache2 preload, 0: load data from next level memory, 1:
 *  not load data from next level memory.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_MODE    (BIT(7))
#define CACHE_L1_ICACHE2_PRELOAD_MODE_M  (CACHE_L1_ICACHE2_PRELOAD_MODE_V << CACHE_L1_ICACHE2_PRELOAD_MODE_S)
#define CACHE_L1_ICACHE2_PRELOAD_MODE_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_MODE_S  7

/** CACHE_L1_ICACHE2_PRELOAD_ADDR_REG register
 *  L1 instruction Cache 2 preload address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xc8)
/** CACHE_L1_ICACHE2_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of preload on L1-ICache2, which should be used
 *  together with L1_ICACHE2_PRELOAD_SIZE_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_M  (CACHE_L1_ICACHE2_PRELOAD_ADDR_V << CACHE_L1_ICACHE2_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE2_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 2 preload size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xcc)
/** CACHE_L1_ICACHE2_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Configures the size of the first section of prelock on L1-ICache2, which should be
 *  used together with L1_ICACHE2_PRELOAD_ADDR_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_M  (CACHE_L1_ICACHE2_PRELOAD_SIZE_V << CACHE_L1_ICACHE2_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE3_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 3 preload-operation control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xd0)
/** CACHE_L1_ICACHE3_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  Configures preload operation on L1-ICache3. It will be cleared by hardware
 *  automatically after preload operation is done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE3_PRELOAD_ENA_M  (CACHE_L1_ICACHE3_PRELOAD_ENA_V << CACHE_L1_ICACHE3_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE3_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE3_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE3_PRELOAD_DONE_M  (CACHE_L1_ICACHE3_PRELOAD_DONE_V << CACHE_L1_ICACHE3_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE3_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE3_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  Configures the direction of preload operation. 0: ascending, 1: descending.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_M  (CACHE_L1_ICACHE3_PRELOAD_ORDER_V << CACHE_L1_ICACHE3_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE3_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  Configures the gid of l1 icache3 preload.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE3_PRELOAD_RGID_M  (CACHE_L1_ICACHE3_PRELOAD_RGID_V << CACHE_L1_ICACHE3_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE3_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE3_PRELOAD_RGID_S  3
/** CACHE_L1_ICACHE3_PRELOAD_MODE : HRO; bitpos: [7]; default: 0;
 *  Configures the mode of l1 icache3 preload, 0: load data from next level memory, 1:
 *  not load data from next level memory.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_MODE    (BIT(7))
#define CACHE_L1_ICACHE3_PRELOAD_MODE_M  (CACHE_L1_ICACHE3_PRELOAD_MODE_V << CACHE_L1_ICACHE3_PRELOAD_MODE_S)
#define CACHE_L1_ICACHE3_PRELOAD_MODE_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_MODE_S  7

/** CACHE_L1_ICACHE3_PRELOAD_ADDR_REG register
 *  L1 instruction Cache 3 preload address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xd4)
/** CACHE_L1_ICACHE3_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of preload on L1-ICache3, which should be used
 *  together with L1_ICACHE3_PRELOAD_SIZE_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_M  (CACHE_L1_ICACHE3_PRELOAD_ADDR_V << CACHE_L1_ICACHE3_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE3_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 3 preload size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xd8)
/** CACHE_L1_ICACHE3_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Configures the size of the first section of prelock on L1-ICache3, which should be
 *  used together with L1_ICACHE3_PRELOAD_ADDR_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_M  (CACHE_L1_ICACHE3_PRELOAD_SIZE_V << CACHE_L1_ICACHE3_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_S  0

/** CACHE_L1_DCACHE_PRELOAD_CTRL_REG register
 *  L1 data Cache  preload-operation control register
 */
#define CACHE_L1_DCACHE_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xdc)
/** CACHE_L1_DCACHE_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  Configures whether to enable the preloading operation in dcache. Hardware will
 *  clear it once the operation has finished.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_DCACHE_PRELOAD_ENA_M  (CACHE_L1_DCACHE_PRELOAD_ENA_V << CACHE_L1_DCACHE_PRELOAD_ENA_S)
#define CACHE_L1_DCACHE_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOAD_ENA_S  0
/** CACHE_L1_DCACHE_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  Represents whether the preloading operation has finished.
 *  1: Finished
 */
#define CACHE_L1_DCACHE_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_DCACHE_PRELOAD_DONE_M  (CACHE_L1_DCACHE_PRELOAD_DONE_V << CACHE_L1_DCACHE_PRELOAD_DONE_S)
#define CACHE_L1_DCACHE_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOAD_DONE_S  1
/** CACHE_L1_DCACHE_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  Configures the direction of the preloading operation.
 *  1: Descending
 */
#define CACHE_L1_DCACHE_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_DCACHE_PRELOAD_ORDER_M  (CACHE_L1_DCACHE_PRELOAD_ORDER_V << CACHE_L1_DCACHE_PRELOAD_ORDER_S)
#define CACHE_L1_DCACHE_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOAD_ORDER_S  2
/** CACHE_L1_DCACHE_PRELOAD_RGID : R/W; bitpos: [6:3]; default: 0;
 *  Configures the gid of l1 dcache preload.
 */
#define CACHE_L1_DCACHE_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_DCACHE_PRELOAD_RGID_M  (CACHE_L1_DCACHE_PRELOAD_RGID_V << CACHE_L1_DCACHE_PRELOAD_RGID_S)
#define CACHE_L1_DCACHE_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_DCACHE_PRELOAD_RGID_S  3
/** CACHE_L1_DCACHE_PRELOAD_MODE : R/W; bitpos: [7]; default: 0;
 *  Configures the mode of l1 dcache preload, 0: load data from next level memory, 1:
 *  not load data from next level memory.
 */
#define CACHE_L1_DCACHE_PRELOAD_MODE    (BIT(7))
#define CACHE_L1_DCACHE_PRELOAD_MODE_M  (CACHE_L1_DCACHE_PRELOAD_MODE_V << CACHE_L1_DCACHE_PRELOAD_MODE_S)
#define CACHE_L1_DCACHE_PRELOAD_MODE_V  0x00000001U
#define CACHE_L1_DCACHE_PRELOAD_MODE_S  7

/** CACHE_L1_DCACHE_PRELOAD_ADDR_REG register
 *  dcache preload address configuration register
 */
#define CACHE_L1_DCACHE_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xe0)
/** CACHE_L1_DCACHE_PRELOAD_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of preload on L1-DCache, which should be used together
 *  with L1_DCACHE_PRELOAD_SIZE_REG
 */
#define CACHE_L1_DCACHE_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOAD_ADDR_M  (CACHE_L1_DCACHE_PRELOAD_ADDR_V << CACHE_L1_DCACHE_PRELOAD_ADDR_S)
#define CACHE_L1_DCACHE_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_PRELOAD_ADDR_S  0

/** CACHE_L1_DCACHE_PRELOAD_SIZE_REG register
 *  L1 data Cache  preload size configure register
 */
#define CACHE_L1_DCACHE_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xe4)
/** CACHE_L1_DCACHE_PRELOAD_SIZE : R/W; bitpos: [13:0]; default: 0;
 *  Configures the size of the first section of prelock on L1-DCache, which should be
 *  used together with L1_DCACHE_PRELOAD_ADDR_REG
 */
#define CACHE_L1_DCACHE_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_DCACHE_PRELOAD_SIZE_M  (CACHE_L1_DCACHE_PRELOAD_SIZE_V << CACHE_L1_DCACHE_PRELOAD_SIZE_S)
#define CACHE_L1_DCACHE_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_DCACHE_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE0_AUTOLOAD_CTRL_REG register
 *  L1 instruction Cache 0 autoload-operation control register
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xe8)
/** CACHE_L1_ICACHE0_AUTOLOAD_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the autoloading operation in icache0.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE0_AUTOLOAD_ENA_M  (CACHE_L1_ICACHE0_AUTOLOAD_ENA_V << CACHE_L1_ICACHE0_AUTOLOAD_ENA_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_AUTOLOAD_ENA_S  0
/** CACHE_L1_ICACHE0_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  Indicates whether the autoloading operation in icache0 has finished.
 *  1: Finished
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE0_AUTOLOAD_DONE_M  (CACHE_L1_ICACHE0_AUTOLOAD_DONE_V << CACHE_L1_ICACHE0_AUTOLOAD_DONE_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE0_AUTOLOAD_DONE_S  1
/** CACHE_L1_ICACHE0_AUTOLOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  Configures the direction of the autoloading operation in icache0.
 *  1: Descending
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE0_AUTOLOAD_ORDER_M  (CACHE_L1_ICACHE0_AUTOLOAD_ORDER_V << CACHE_L1_ICACHE0_AUTOLOAD_ORDER_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE0_AUTOLOAD_ORDER_S  2
/** CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE : R/W; bitpos: [4:3]; default: 0;
 *  Configures the trigger mode of the autoloading operation in icache0.
 *  2: Triggered by cache miss or hit
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE_V << CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L1_ICACHE0_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA : R/W; bitpos: [8]; default: 0;
 *  Configures whether to enable Section 0 for the autoloading operation in icache0.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA : R/W; bitpos: [9]; default: 0;
 *  Configures whether to enable Section 1 for the autoloading operation in icache0.
 *  1: Enable
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L1_ICACHE0_AUTOLOAD_RGID : R/W; bitpos: [13:10]; default: 0;
 *  Configures the gid of l1 icache0 autoload.
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE0_AUTOLOAD_RGID_M  (CACHE_L1_ICACHE0_AUTOLOAD_RGID_V << CACHE_L1_ICACHE0_AUTOLOAD_RGID_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE0_AUTOLOAD_RGID_S  10

/** CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_REG register
 *  L1 instruction Cache 0 autoload section 0 address configure register
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0xec)
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section for autoload operation on
 *  L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_REG register
 *  L1 instruction Cache 0 autoload section 0 size configure register
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0xf0)
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the first section for autoload operation on L1-ICache0. Note
 *  that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_ADDR and
 *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_REG register
 *  L1 instruction Cache 0 autoload section 1 address configure register
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0xf4)
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section for autoload operation on
 *  L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_REG register
 *  L1 instruction Cache 0 autoload section 1 size configure register
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0xf8)
/** CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the second section for autoload operation on L1-ICache0.
 *  Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_ADDR and
 *  L1_ICACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_M  (CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_V << CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE0_AUTOLOAD_SCT1_SIZE_S  0

