espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_ICACHE2_AUTOLOAD_CTRL_REG register
 *  L1 instruction Cache 2 autoload-operation control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x110)
/** CACHE_L1_ICACHE2_AUTOLOAD_ENA : HRO; bitpos: [0]; default: 0;
 *  Configures and disable autoload operation on L1-ICache2.  1: enable, 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_ENA_S  0
/** CACHE_L1_ICACHE2_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether autoload operation on L1-ICache2 is finished or
 *  not. 0: not finished. 1: finished.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_M  (CACHE_L1_ICACHE2_AUTOLOAD_DONE_V << CACHE_L1_ICACHE2_AUTOLOAD_DONE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_DONE_S  1
/** CACHE_L1_ICACHE2_AUTOLOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  Configures the direction of autoload operation on L1-ICache2. 0: ascending. 1:
 *  descending.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_M  (CACHE_L1_ICACHE2_AUTOLOAD_ORDER_V << CACHE_L1_ICACHE2_AUTOLOAD_ORDER_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_ORDER_S  2
/** CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE : HRO; bitpos: [4:3]; default: 0;
 *  The field is used to configure trigger mode of autoload operation on L1-ICache2.
 *  0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_V << CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L1_ICACHE2_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA : HRO; bitpos: [8]; default: 0;
 *  Configures the first section for autoload operation on L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA : HRO; bitpos: [9]; default: 0;
 *  Configures the second section for autoload operation on L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L1_ICACHE2_AUTOLOAD_RGID : HRO; bitpos: [13:10]; default: 0;
 *  Configures the gid of l1 icache2 autoload.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_M  (CACHE_L1_ICACHE2_AUTOLOAD_RGID_V << CACHE_L1_ICACHE2_AUTOLOAD_RGID_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE2_AUTOLOAD_RGID_S  10

/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_REG register
 *  L1 instruction Cache 2 autoload section 0 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x114)
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section for autoload operation on
 *  L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_REG register
 *  L1 instruction Cache 2 autoload section 0 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0x118)
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the first section for autoload operation on L1-ICache2. Note
 *  that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_ADDR and
 *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_REG register
 *  L1 instruction Cache 2 autoload section 1 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x11c)
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section for autoload operation on
 *  L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_REG register
 *  L1 instruction Cache 2 autoload section 1 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0x120)
/** CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the second section for autoload operation on L1-ICache2.
 *  Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_ADDR and
 *  L1_ICACHE_AUTOLOAD_SCT1_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_M  (CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_V << CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE2_AUTOLOAD_SCT1_SIZE_S  0

/** CACHE_L1_ICACHE3_AUTOLOAD_CTRL_REG register
 *  L1 instruction Cache 3 autoload-operation control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x124)
/** CACHE_L1_ICACHE3_AUTOLOAD_ENA : HRO; bitpos: [0]; default: 0;
 *  Configures and disable autoload operation on L1-ICache3.  1: enable, 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE3_AUTOLOAD_ENA_M  (CACHE_L1_ICACHE3_AUTOLOAD_ENA_V << CACHE_L1_ICACHE3_AUTOLOAD_ENA_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_AUTOLOAD_ENA_S  0
/** CACHE_L1_ICACHE3_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether autoload operation on L1-ICache3 is finished or
 *  not. 0: not finished. 1: finished.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE3_AUTOLOAD_DONE_M  (CACHE_L1_ICACHE3_AUTOLOAD_DONE_V << CACHE_L1_ICACHE3_AUTOLOAD_DONE_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE3_AUTOLOAD_DONE_S  1
/** CACHE_L1_ICACHE3_AUTOLOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  Configures the direction of autoload operation on L1-ICache3. 0: ascending. 1:
 *  descending.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE3_AUTOLOAD_ORDER_M  (CACHE_L1_ICACHE3_AUTOLOAD_ORDER_V << CACHE_L1_ICACHE3_AUTOLOAD_ORDER_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE3_AUTOLOAD_ORDER_S  2
/** CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE : HRO; bitpos: [4:3]; default: 0;
 *  The field is used to configure trigger mode of autoload operation on L1-ICache3.
 *  0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE_V << CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L1_ICACHE3_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA : HRO; bitpos: [8]; default: 0;
 *  Configures the first section for autoload operation on L1-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA : HRO; bitpos: [9]; default: 0;
 *  Configures the second section for autoload operation on L1-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L1_ICACHE3_AUTOLOAD_RGID : HRO; bitpos: [13:10]; default: 0;
 *  Configures the gid of l1 icache3 autoload.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE3_AUTOLOAD_RGID_M  (CACHE_L1_ICACHE3_AUTOLOAD_RGID_V << CACHE_L1_ICACHE3_AUTOLOAD_RGID_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE3_AUTOLOAD_RGID_S  10

/** CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_REG register
 *  L1 instruction Cache 3 autoload section 0 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x128)
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section for autoload operation on
 *  L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_REG register
 *  L1 instruction Cache 3 autoload section 0 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0x12c)
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the first section for autoload operation on L1-ICache3. Note
 *  that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_ADDR and
 *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_REG register
 *  L1 instruction Cache 3 autoload section 1 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x130)
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section for autoload operation on
 *  L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT1_SIZE
 *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_REG register
 *  L1 instruction Cache 3 autoload section 1 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0x134)
/** CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE    0x0FFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_M  (CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_V << CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_ICACHE3_AUTOLOAD_SCT1_SIZE_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_CTRL_REG register
 *  L1 data Cache autoload-operation control register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x138)
/** CACHE_L1_DCACHE_AUTOLOAD_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the autoloading operation in dcache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_DCACHE_AUTOLOAD_ENA_M  (CACHE_L1_DCACHE_AUTOLOAD_ENA_V << CACHE_L1_DCACHE_AUTOLOAD_ENA_S)
#define CACHE_L1_DCACHE_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_ENA_S  0
/** CACHE_L1_DCACHE_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  Indicates whether the autoloading operation in dcache has finished.
 *  1: Finished
 */
#define CACHE_L1_DCACHE_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_DCACHE_AUTOLOAD_DONE_M  (CACHE_L1_DCACHE_AUTOLOAD_DONE_V << CACHE_L1_DCACHE_AUTOLOAD_DONE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_DONE_S  1
/** CACHE_L1_DCACHE_AUTOLOAD_ORDER : R/W; bitpos: [2]; default: 0;
 *  Configures the direction of the autoloading operation in dcache.
 *  1: Descending
 */
#define CACHE_L1_DCACHE_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_DCACHE_AUTOLOAD_ORDER_M  (CACHE_L1_DCACHE_AUTOLOAD_ORDER_V << CACHE_L1_DCACHE_AUTOLOAD_ORDER_S)
#define CACHE_L1_DCACHE_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_ORDER_S  2
/** CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE : R/W; bitpos: [4:3]; default: 0;
 *  Configures the trigger mode of the autoloading operation in dcache.
 *  2: Triggered by cache miss or hit
 */
#define CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE_V << CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L1_DCACHE_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA : R/W; bitpos: [8]; default: 0;
 *  Configures whether to enable Section 0 for the autoloading operation in dcache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA_V << CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA : R/W; bitpos: [9]; default: 0;
 *  Configures whether to enable Section 1 for the autoloading operation in dcache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA_V << CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA : R/W; bitpos: [10]; default: 0;
 *  Configures whether to enable Section 2 for the autoloading operation in dcache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA    (BIT(10))
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA_V << CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ENA_S  10
/** CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA : R/W; bitpos: [11]; default: 0;
 *  Configures whether to enable Section 3 for the autoloading operation in dcache.
 *  1: Enable
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA    (BIT(11))
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA_V << CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ENA_S  11
/** CACHE_L1_DCACHE_AUTOLOAD_RGID : R/W; bitpos: [15:12]; default: 0;
 *  Configures the gid of l1 dcache autoload.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L1_DCACHE_AUTOLOAD_RGID_M  (CACHE_L1_DCACHE_AUTOLOAD_RGID_V << CACHE_L1_DCACHE_AUTOLOAD_RGID_S)
#define CACHE_L1_DCACHE_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L1_DCACHE_AUTOLOAD_RGID_S  12

/** CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_REG register
 *  L1 data Cache autoload section 0 address configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x13c)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section for autoload operation on
 *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_SIZE
 *  and L1_DCACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_V << CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_REG register
 *  L1 data Cache autoload section 0 size configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0x140)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the first section for autoload operation on L1-DCache. Note
 *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_ADDR and
 *  L1_DCACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE    0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_V << CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_REG register
 *  L1 data Cache autoload section 1 address configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x144)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section for autoload operation on
 *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_SIZE
 *  and L1_DCACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_V << CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_REG register
 *  L1 data Cache autoload section 1 size configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0x148)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the second section for autoload operation on L1-DCache. Note
 *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_ADDR and
 *  L1_DCACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE    0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_V << CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT1_SIZE_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_REG register
 *  L1 data Cache autoload section 2 address configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_REG (DR_REG_CACHE_BASE + 0x14c)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the third section for autoload operation on
 *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_SIZE
 *  and L1_DCACHE_AUTOLOAD_SCT2_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_V << CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_ADDR_S  0

