espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_REG register
 *  L1 data Cache autoload section 2 size configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_REG (DR_REG_CACHE_BASE + 0x150)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the third section for autoload operation on L1-DCache. Note
 *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_ADDR and
 *  L1_DCACHE_AUTOLOAD_SCT2_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE    0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_V << CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT2_SIZE_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_REG register
 *  L1 data Cache autoload section 1 address configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_REG (DR_REG_CACHE_BASE + 0x154)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of the fourth section for autoload operation on
 *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_SIZE
 *  and L1_DCACHE_AUTOLOAD_SCT3_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_V << CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_ADDR_S  0

/** CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_REG register
 *  L1 data Cache autoload section 1 size configure register
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_REG (DR_REG_CACHE_BASE + 0x158)
/** CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE : R/W; bitpos: [27:0]; default: 0;
 *  Configures the size of the fourth section for autoload operation on L1-DCache. Note
 *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_ADDR and
 *  L1_DCACHE_AUTOLOAD_SCT3_ENA.
 */
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE    0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_M  (CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_V << CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_S)
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_V  0x0FFFFFFFU
#define CACHE_L1_DCACHE_AUTOLOAD_SCT3_SIZE_S  0

/** CACHE_L1_CACHE_ACS_CNT_INT_ENA_REG register
 *  Cache Access Counter Interrupt enable register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_ENA_REG (DR_REG_CACHE_BASE + 0x15c)
/** CACHE_L1_IBUS0_OVF_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L1-ICache0 due to
 *  bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_ENA    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_ENA_M  (CACHE_L1_IBUS0_OVF_INT_ENA_V << CACHE_L1_IBUS0_OVF_INT_ENA_S)
#define CACHE_L1_IBUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_ENA_S  0
/** CACHE_L1_IBUS1_OVF_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L1-ICache1 due to
 *  bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_ENA    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_ENA_M  (CACHE_L1_IBUS1_OVF_INT_ENA_V << CACHE_L1_IBUS1_OVF_INT_ENA_S)
#define CACHE_L1_IBUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_ENA_S  1
/** CACHE_L1_IBUS2_OVF_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_ENA    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_ENA_M  (CACHE_L1_IBUS2_OVF_INT_ENA_V << CACHE_L1_IBUS2_OVF_INT_ENA_S)
#define CACHE_L1_IBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_ENA_S  2
/** CACHE_L1_IBUS3_OVF_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_ENA    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_ENA_M  (CACHE_L1_IBUS3_OVF_INT_ENA_V << CACHE_L1_IBUS3_OVF_INT_ENA_S)
#define CACHE_L1_IBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_ENA_S  3
/** CACHE_L1_DBUS0_OVF_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L1-DCache due to
 *  bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_OVF_INT_ENA    (BIT(4))
#define CACHE_L1_DBUS0_OVF_INT_ENA_M  (CACHE_L1_DBUS0_OVF_INT_ENA_V << CACHE_L1_DBUS0_OVF_INT_ENA_S)
#define CACHE_L1_DBUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS0_OVF_INT_ENA_S  4
/** CACHE_L1_DBUS1_OVF_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L1-DCache due to
 *  bus1 accesses L1-DCache.
 */
#define CACHE_L1_DBUS1_OVF_INT_ENA    (BIT(5))
#define CACHE_L1_DBUS1_OVF_INT_ENA_M  (CACHE_L1_DBUS1_OVF_INT_ENA_V << CACHE_L1_DBUS1_OVF_INT_ENA_S)
#define CACHE_L1_DBUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS1_OVF_INT_ENA_S  5
/** CACHE_L1_DBUS2_OVF_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_ENA    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_ENA_M  (CACHE_L1_DBUS2_OVF_INT_ENA_V << CACHE_L1_DBUS2_OVF_INT_ENA_S)
#define CACHE_L1_DBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_ENA_S  6
/** CACHE_L1_DBUS3_OVF_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_ENA    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_ENA_M  (CACHE_L1_DBUS3_OVF_INT_ENA_V << CACHE_L1_DBUS3_OVF_INT_ENA_S)
#define CACHE_L1_DBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_ENA_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_CLR_REG register
 *  Cache Access Counter Interrupt clear register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_CLR_REG (DR_REG_CACHE_BASE + 0x160)
/** CACHE_L1_IBUS0_OVF_INT_CLR : WT; bitpos: [0]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-ICache0 due
 *  to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_CLR    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_CLR_M  (CACHE_L1_IBUS0_OVF_INT_CLR_V << CACHE_L1_IBUS0_OVF_INT_CLR_S)
#define CACHE_L1_IBUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_CLR_S  0
/** CACHE_L1_IBUS1_OVF_INT_CLR : WT; bitpos: [1]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-ICache1 due
 *  to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_CLR    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_CLR_M  (CACHE_L1_IBUS1_OVF_INT_CLR_V << CACHE_L1_IBUS1_OVF_INT_CLR_S)
#define CACHE_L1_IBUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_CLR_S  1
/** CACHE_L1_IBUS2_OVF_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_CLR    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_CLR_M  (CACHE_L1_IBUS2_OVF_INT_CLR_V << CACHE_L1_IBUS2_OVF_INT_CLR_S)
#define CACHE_L1_IBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_CLR_S  2
/** CACHE_L1_IBUS3_OVF_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_CLR    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_CLR_M  (CACHE_L1_IBUS3_OVF_INT_CLR_V << CACHE_L1_IBUS3_OVF_INT_CLR_S)
#define CACHE_L1_IBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_CLR_S  3
/** CACHE_L1_DBUS0_OVF_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
 *  to bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_OVF_INT_CLR    (BIT(4))
#define CACHE_L1_DBUS0_OVF_INT_CLR_M  (CACHE_L1_DBUS0_OVF_INT_CLR_V << CACHE_L1_DBUS0_OVF_INT_CLR_S)
#define CACHE_L1_DBUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS0_OVF_INT_CLR_S  4
/** CACHE_L1_DBUS1_OVF_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
 *  to bus1 accesses L1-DCache.
 */
#define CACHE_L1_DBUS1_OVF_INT_CLR    (BIT(5))
#define CACHE_L1_DBUS1_OVF_INT_CLR_M  (CACHE_L1_DBUS1_OVF_INT_CLR_V << CACHE_L1_DBUS1_OVF_INT_CLR_S)
#define CACHE_L1_DBUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS1_OVF_INT_CLR_S  5
/** CACHE_L1_DBUS2_OVF_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_CLR    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_CLR_M  (CACHE_L1_DBUS2_OVF_INT_CLR_V << CACHE_L1_DBUS2_OVF_INT_CLR_S)
#define CACHE_L1_DBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_CLR_S  6
/** CACHE_L1_DBUS3_OVF_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_CLR    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_CLR_M  (CACHE_L1_DBUS3_OVF_INT_CLR_V << CACHE_L1_DBUS3_OVF_INT_CLR_S)
#define CACHE_L1_DBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_CLR_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_RAW_REG register
 *  Cache Access Counter Interrupt raw register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_RAW_REG (DR_REG_CACHE_BASE + 0x164)
/** CACHE_L1_IBUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache0
 *  due to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_RAW    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_RAW_M  (CACHE_L1_IBUS0_OVF_INT_RAW_V << CACHE_L1_IBUS0_OVF_INT_RAW_S)
#define CACHE_L1_IBUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_RAW_S  0
/** CACHE_L1_IBUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache1
 *  due to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_RAW    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_RAW_M  (CACHE_L1_IBUS1_OVF_INT_RAW_V << CACHE_L1_IBUS1_OVF_INT_RAW_S)
#define CACHE_L1_IBUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_RAW_S  1
/** CACHE_L1_IBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache2
 *  due to bus2 accesses L1-ICache2.
 */
#define CACHE_L1_IBUS2_OVF_INT_RAW    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_RAW_M  (CACHE_L1_IBUS2_OVF_INT_RAW_V << CACHE_L1_IBUS2_OVF_INT_RAW_S)
#define CACHE_L1_IBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_RAW_S  2
/** CACHE_L1_IBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache3
 *  due to bus3 accesses L1-ICache3.
 */
#define CACHE_L1_IBUS3_OVF_INT_RAW    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_RAW_M  (CACHE_L1_IBUS3_OVF_INT_RAW_V << CACHE_L1_IBUS3_OVF_INT_RAW_S)
#define CACHE_L1_IBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_RAW_S  3
/** CACHE_L1_DBUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_OVF_INT_RAW    (BIT(4))
#define CACHE_L1_DBUS0_OVF_INT_RAW_M  (CACHE_L1_DBUS0_OVF_INT_RAW_V << CACHE_L1_DBUS0_OVF_INT_RAW_S)
#define CACHE_L1_DBUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS0_OVF_INT_RAW_S  4
/** CACHE_L1_DBUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus1 accesses L1-DCache.
 */
#define CACHE_L1_DBUS1_OVF_INT_RAW    (BIT(5))
#define CACHE_L1_DBUS1_OVF_INT_RAW_M  (CACHE_L1_DBUS1_OVF_INT_RAW_V << CACHE_L1_DBUS1_OVF_INT_RAW_S)
#define CACHE_L1_DBUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS1_OVF_INT_RAW_S  5
/** CACHE_L1_DBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus2 accesses L1-DCache.
 */
#define CACHE_L1_DBUS2_OVF_INT_RAW    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_RAW_M  (CACHE_L1_DBUS2_OVF_INT_RAW_V << CACHE_L1_DBUS2_OVF_INT_RAW_S)
#define CACHE_L1_DBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_RAW_S  6
/** CACHE_L1_DBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus3 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_OVF_INT_RAW    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_RAW_M  (CACHE_L1_DBUS3_OVF_INT_RAW_V << CACHE_L1_DBUS3_OVF_INT_RAW_S)
#define CACHE_L1_DBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_RAW_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_ST_REG register
 *  Cache Access Counter Interrupt status register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_ST_REG (DR_REG_CACHE_BASE + 0x168)
/** CACHE_L1_IBUS0_OVF_INT_ST : RO; bitpos: [0]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-ICache0 due to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_ST    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_ST_M  (CACHE_L1_IBUS0_OVF_INT_ST_V << CACHE_L1_IBUS0_OVF_INT_ST_S)
#define CACHE_L1_IBUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_ST_S  0
/** CACHE_L1_IBUS1_OVF_INT_ST : RO; bitpos: [1]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-ICache1 due to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_ST    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_ST_M  (CACHE_L1_IBUS1_OVF_INT_ST_V << CACHE_L1_IBUS1_OVF_INT_ST_S)
#define CACHE_L1_IBUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_ST_S  1
/** CACHE_L1_IBUS2_OVF_INT_ST : RO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_ST    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_ST_M  (CACHE_L1_IBUS2_OVF_INT_ST_V << CACHE_L1_IBUS2_OVF_INT_ST_S)
#define CACHE_L1_IBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_ST_S  2
/** CACHE_L1_IBUS3_OVF_INT_ST : RO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_ST    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_ST_M  (CACHE_L1_IBUS3_OVF_INT_ST_V << CACHE_L1_IBUS3_OVF_INT_ST_S)
#define CACHE_L1_IBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_ST_S  3
/** CACHE_L1_DBUS0_OVF_INT_ST : RO; bitpos: [4]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-DCache due to bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_OVF_INT_ST    (BIT(4))
#define CACHE_L1_DBUS0_OVF_INT_ST_M  (CACHE_L1_DBUS0_OVF_INT_ST_V << CACHE_L1_DBUS0_OVF_INT_ST_S)
#define CACHE_L1_DBUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS0_OVF_INT_ST_S  4
/** CACHE_L1_DBUS1_OVF_INT_ST : RO; bitpos: [5]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-DCache due to bus1 accesses L1-DCache.
 */
#define CACHE_L1_DBUS1_OVF_INT_ST    (BIT(5))
#define CACHE_L1_DBUS1_OVF_INT_ST_M  (CACHE_L1_DBUS1_OVF_INT_ST_V << CACHE_L1_DBUS1_OVF_INT_ST_S)
#define CACHE_L1_DBUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS1_OVF_INT_ST_S  5
/** CACHE_L1_DBUS2_OVF_INT_ST : RO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_ST    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_ST_M  (CACHE_L1_DBUS2_OVF_INT_ST_V << CACHE_L1_DBUS2_OVF_INT_ST_S)
#define CACHE_L1_DBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_ST_S  6
/** CACHE_L1_DBUS3_OVF_INT_ST : RO; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_ST    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_ST_M  (CACHE_L1_DBUS3_OVF_INT_ST_V << CACHE_L1_DBUS3_OVF_INT_ST_S)
#define CACHE_L1_DBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_ST_S  7

/** CACHE_L1_CACHE_ACS_FAIL_CTRL_REG register
 *  Cache Access Fail Configuration register
 */
#define CACHE_L1_CACHE_ACS_FAIL_CTRL_REG (DR_REG_CACHE_BASE + 0x16c)
/** CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE : R/W; bitpos: [0]; default: 0;
 *  Configures l1 icache0 access fail check mode. 0: the access fail is not propagated
 *  to the request, 1: the access fail is propagated to the request
 */
#define CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE    (BIT(0))
#define CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE_M  (CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE_V << CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L1_ICACHE0_ACS_FAIL_CHECK_MODE_S  0
/** CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE : R/W; bitpos: [1]; default: 0;
 *  Configures l1 icache1 access fail check mode. 0: the access fail is not propagated
 *  to the request, 1: the access fail is propagated to the request
 */
#define CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE    (BIT(1))
#define CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE_M  (CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE_V << CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L1_ICACHE1_ACS_FAIL_CHECK_MODE_S  1
/** CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE : R/W; bitpos: [2]; default: 0;
 *  Configures l1 icache2 access fail check mode. 0: the access fail is not propagated
 *  to the request, 1: the access fail is propagated to the request
 */
#define CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE    (BIT(2))
#define CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE_M  (CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE_V << CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L1_ICACHE2_ACS_FAIL_CHECK_MODE_S  2
/** CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE : R/W; bitpos: [3]; default: 0;
 *  Configures l1 icache3 access fail check mode. 0: the access fail is not propagated
 *  to the request, 1: the access fail is propagated to the request
 */
#define CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE    (BIT(3))
#define CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE_M  (CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE_V << CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L1_ICACHE3_ACS_FAIL_CHECK_MODE_S  3
/** CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE : R/W; bitpos: [4]; default: 0;
 *  Configures l1 dcache access fail check mode. 0: the access fail is not propagated
 *  to the request, 1: the access fail is propagated to the request
 */
#define CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE    (BIT(4))
#define CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE_M  (CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE_V << CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L1_DCACHE_ACS_FAIL_CHECK_MODE_S  4

/** CACHE_L1_CACHE_ACS_FAIL_INT_ENA_REG register
 *  Cache Access Fail Interrupt enable register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_ENA_REG (DR_REG_CACHE_BASE + 0x170)
/** CACHE_L1_ICACHE0_FAIL_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures interrupt of access fail that occurs in L1-ICache0 due to cpu accesses
 *  L1-ICache0.
 */
#define CACHE_L1_ICACHE0_FAIL_INT_ENA    (BIT(0))
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_M  (CACHE_L1_ICACHE0_FAIL_INT_ENA_V << CACHE_L1_ICACHE0_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_S  0
/** CACHE_L1_ICACHE1_FAIL_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Configures interrupt of access fail that occurs in L1-ICache1 due to cpu accesses
 *  L1-ICache1.
 */
#define CACHE_L1_ICACHE1_FAIL_INT_ENA    (BIT(1))
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_M  (CACHE_L1_ICACHE1_FAIL_INT_ENA_V << CACHE_L1_ICACHE1_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_S  1
/** CACHE_L1_ICACHE2_FAIL_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_ENA    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_M  (CACHE_L1_ICACHE2_FAIL_INT_ENA_V << CACHE_L1_ICACHE2_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_S  2
/** CACHE_L1_ICACHE3_FAIL_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FAIL_INT_ENA    (BIT(3))
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_M  (CACHE_L1_ICACHE3_FAIL_INT_ENA_V << CACHE_L1_ICACHE3_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_S  3
/** CACHE_L1_DCACHE_FAIL_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Configures interrupt of access fail that occurs in L1-DCache due to cpu accesses
 *  L1-DCache.
 */
#define CACHE_L1_DCACHE_FAIL_INT_ENA    (BIT(4))
#define CACHE_L1_DCACHE_FAIL_INT_ENA_M  (CACHE_L1_DCACHE_FAIL_INT_ENA_V << CACHE_L1_DCACHE_FAIL_INT_ENA_S)
#define CACHE_L1_DCACHE_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_FAIL_INT_ENA_S  4

