espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_DBUS3_ACS_CONFLICT_CNT_REG register
 *  L1-DCache bus3 Conflict-Access Counter register
 */
#define CACHE_L1_DBUS3_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x208)
/** CACHE_L1_DBUS3_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus3 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS3_CONFLICT_CNT_M  (CACHE_L1_DBUS3_CONFLICT_CNT_V << CACHE_L1_DBUS3_CONFLICT_CNT_S)
#define CACHE_L1_DBUS3_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS3_CONFLICT_CNT_S  0

/** CACHE_L1_DBUS3_ACS_NXTLVL_RD_CNT_REG register
 *  L1-DCache bus3 Next-Level-Access Counter register
 */
#define CACHE_L1_DBUS3_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x20c)
/** CACHE_L1_DBUS3_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-DCache accesses L2-Cache due to
 *  bus3 accessing L1-DCache.
 */
#define CACHE_L1_DBUS3_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS3_NXTLVL_RD_CNT_M  (CACHE_L1_DBUS3_NXTLVL_RD_CNT_V << CACHE_L1_DBUS3_NXTLVL_RD_CNT_S)
#define CACHE_L1_DBUS3_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS3_NXTLVL_RD_CNT_S  0

/** CACHE_L1_DBUS3_ACS_NXTLVL_WR_CNT_REG register
 *  L1-DCache bus3 WB-Access Counter register
 */
#define CACHE_L1_DBUS3_ACS_NXTLVL_WR_CNT_REG (DR_REG_CACHE_BASE + 0x210)
/** CACHE_L1_DBUS3_NXTLVL_WR_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of write back when bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_NXTLVL_WR_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS3_NXTLVL_WR_CNT_M  (CACHE_L1_DBUS3_NXTLVL_WR_CNT_V << CACHE_L1_DBUS3_NXTLVL_WR_CNT_S)
#define CACHE_L1_DBUS3_NXTLVL_WR_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS3_NXTLVL_WR_CNT_S  0

/** CACHE_L1_ICACHE0_ACS_FAIL_ID_ATTR_REG register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
#define CACHE_L1_ICACHE0_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x214)
/** CACHE_L1_ICACHE0_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when cache0 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE0_FAIL_ID    0x0000FFFFU
#define CACHE_L1_ICACHE0_FAIL_ID_M  (CACHE_L1_ICACHE0_FAIL_ID_V << CACHE_L1_ICACHE0_FAIL_ID_S)
#define CACHE_L1_ICACHE0_FAIL_ID_V  0x0000FFFFU
#define CACHE_L1_ICACHE0_FAIL_ID_S  0
/** CACHE_L1_ICACHE0_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when cache0 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE0_FAIL_ATTR    0x0000FFFFU
#define CACHE_L1_ICACHE0_FAIL_ATTR_M  (CACHE_L1_ICACHE0_FAIL_ATTR_V << CACHE_L1_ICACHE0_FAIL_ATTR_S)
#define CACHE_L1_ICACHE0_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L1_ICACHE0_FAIL_ATTR_S  16

/** CACHE_L1_ICACHE0_ACS_FAIL_ADDR_REG register
 *  L1-ICache0 Access Fail Address information register
 */
#define CACHE_L1_ICACHE0_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x218)
/** CACHE_L1_ICACHE0_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when cache0 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE0_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE0_FAIL_ADDR_M  (CACHE_L1_ICACHE0_FAIL_ADDR_V << CACHE_L1_ICACHE0_FAIL_ADDR_S)
#define CACHE_L1_ICACHE0_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE0_FAIL_ADDR_S  0

/** CACHE_L1_ICACHE1_ACS_FAIL_ID_ATTR_REG register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
#define CACHE_L1_ICACHE1_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x21c)
/** CACHE_L1_ICACHE1_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when cache1 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE1_FAIL_ID    0x0000FFFFU
#define CACHE_L1_ICACHE1_FAIL_ID_M  (CACHE_L1_ICACHE1_FAIL_ID_V << CACHE_L1_ICACHE1_FAIL_ID_S)
#define CACHE_L1_ICACHE1_FAIL_ID_V  0x0000FFFFU
#define CACHE_L1_ICACHE1_FAIL_ID_S  0
/** CACHE_L1_ICACHE1_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when cache1 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE1_FAIL_ATTR    0x0000FFFFU
#define CACHE_L1_ICACHE1_FAIL_ATTR_M  (CACHE_L1_ICACHE1_FAIL_ATTR_V << CACHE_L1_ICACHE1_FAIL_ATTR_S)
#define CACHE_L1_ICACHE1_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L1_ICACHE1_FAIL_ATTR_S  16

/** CACHE_L1_ICACHE1_ACS_FAIL_ADDR_REG register
 *  L1-ICache0 Access Fail Address information register
 */
#define CACHE_L1_ICACHE1_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x220)
/** CACHE_L1_ICACHE1_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when cache1 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE1_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE1_FAIL_ADDR_M  (CACHE_L1_ICACHE1_FAIL_ADDR_V << CACHE_L1_ICACHE1_FAIL_ADDR_S)
#define CACHE_L1_ICACHE1_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE1_FAIL_ADDR_S  0

/** CACHE_L1_ICACHE2_ACS_FAIL_ID_ATTR_REG register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
#define CACHE_L1_ICACHE2_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x224)
/** CACHE_L1_ICACHE2_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when cache2 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE2_FAIL_ID    0x0000FFFFU
#define CACHE_L1_ICACHE2_FAIL_ID_M  (CACHE_L1_ICACHE2_FAIL_ID_V << CACHE_L1_ICACHE2_FAIL_ID_S)
#define CACHE_L1_ICACHE2_FAIL_ID_V  0x0000FFFFU
#define CACHE_L1_ICACHE2_FAIL_ID_S  0
/** CACHE_L1_ICACHE2_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when cache2 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE2_FAIL_ATTR    0x0000FFFFU
#define CACHE_L1_ICACHE2_FAIL_ATTR_M  (CACHE_L1_ICACHE2_FAIL_ATTR_V << CACHE_L1_ICACHE2_FAIL_ATTR_S)
#define CACHE_L1_ICACHE2_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L1_ICACHE2_FAIL_ATTR_S  16

/** CACHE_L1_ICACHE2_ACS_FAIL_ADDR_REG register
 *  L1-ICache0 Access Fail Address information register
 */
#define CACHE_L1_ICACHE2_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x228)
/** CACHE_L1_ICACHE2_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when cache2 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE2_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_FAIL_ADDR_M  (CACHE_L1_ICACHE2_FAIL_ADDR_V << CACHE_L1_ICACHE2_FAIL_ADDR_S)
#define CACHE_L1_ICACHE2_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_FAIL_ADDR_S  0

