espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_ICACHE3_ACS_FAIL_ID_ATTR_REG register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
#define CACHE_L1_ICACHE3_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x22c)
/** CACHE_L1_ICACHE3_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when cache3 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE3_FAIL_ID    0x0000FFFFU
#define CACHE_L1_ICACHE3_FAIL_ID_M  (CACHE_L1_ICACHE3_FAIL_ID_V << CACHE_L1_ICACHE3_FAIL_ID_S)
#define CACHE_L1_ICACHE3_FAIL_ID_V  0x0000FFFFU
#define CACHE_L1_ICACHE3_FAIL_ID_S  0
/** CACHE_L1_ICACHE3_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when cache3 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE3_FAIL_ATTR    0x0000FFFFU
#define CACHE_L1_ICACHE3_FAIL_ATTR_M  (CACHE_L1_ICACHE3_FAIL_ATTR_V << CACHE_L1_ICACHE3_FAIL_ATTR_S)
#define CACHE_L1_ICACHE3_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L1_ICACHE3_FAIL_ATTR_S  16

/** CACHE_L1_ICACHE3_ACS_FAIL_ADDR_REG register
 *  L1-ICache0 Access Fail Address information register
 */
#define CACHE_L1_ICACHE3_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x230)
/** CACHE_L1_ICACHE3_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when cache3 accesses L1-ICache.
 */
#define CACHE_L1_ICACHE3_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_FAIL_ADDR_M  (CACHE_L1_ICACHE3_FAIL_ADDR_V << CACHE_L1_ICACHE3_FAIL_ADDR_S)
#define CACHE_L1_ICACHE3_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_FAIL_ADDR_S  0

/** CACHE_L1_DCACHE_ACS_FAIL_ID_ATTR_REG register
 *  L1-DCache Access Fail ID/attribution information register
 */
#define CACHE_L1_DCACHE_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x234)
/** CACHE_L1_DCACHE_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when cache accesses L1-DCache.
 */
#define CACHE_L1_DCACHE_FAIL_ID    0x0000FFFFU
#define CACHE_L1_DCACHE_FAIL_ID_M  (CACHE_L1_DCACHE_FAIL_ID_V << CACHE_L1_DCACHE_FAIL_ID_S)
#define CACHE_L1_DCACHE_FAIL_ID_V  0x0000FFFFU
#define CACHE_L1_DCACHE_FAIL_ID_S  0
/** CACHE_L1_DCACHE_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when cache accesses L1-DCache.
 */
#define CACHE_L1_DCACHE_FAIL_ATTR    0x0000FFFFU
#define CACHE_L1_DCACHE_FAIL_ATTR_M  (CACHE_L1_DCACHE_FAIL_ATTR_V << CACHE_L1_DCACHE_FAIL_ATTR_S)
#define CACHE_L1_DCACHE_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L1_DCACHE_FAIL_ATTR_S  16

/** CACHE_L1_DCACHE_ACS_FAIL_ADDR_REG register
 *  L1-DCache Access Fail Address information register
 */
#define CACHE_L1_DCACHE_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x238)
/** CACHE_L1_DCACHE_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when cache accesses L1-DCache.
 */
#define CACHE_L1_DCACHE_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L1_DCACHE_FAIL_ADDR_M  (CACHE_L1_DCACHE_FAIL_ADDR_V << CACHE_L1_DCACHE_FAIL_ADDR_S)
#define CACHE_L1_DCACHE_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_DCACHE_FAIL_ADDR_S  0

/** CACHE_L1_CACHE_SYNC_PRELOAD_INT_ENA_REG register
 *  L1-Cache Access Fail Interrupt enable register
 */
#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_ENA_REG (DR_REG_CACHE_BASE + 0x23c)
/** CACHE_L1_ICACHE0_PLD_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures interrupt of L1-ICache0 preload-operation. If preload operation is done,
 *  interrupt occurs.
 */
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ENA    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ENA_M  (CACHE_L1_ICACHE0_PLD_DONE_INT_ENA_V << CACHE_L1_ICACHE0_PLD_DONE_INT_ENA_S)
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ENA_S  0
/** CACHE_L1_ICACHE1_PLD_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Configures interrupt of L1-ICache1 preload-operation. If preload operation is done,
 *  interrupt occurs.
 */
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ENA    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ENA_M  (CACHE_L1_ICACHE1_PLD_DONE_INT_ENA_V << CACHE_L1_ICACHE1_PLD_DONE_INT_ENA_S)
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ENA_S  1
/** CACHE_L1_ICACHE2_PLD_DONE_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ENA    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ENA_M  (CACHE_L1_ICACHE2_PLD_DONE_INT_ENA_V << CACHE_L1_ICACHE2_PLD_DONE_INT_ENA_S)
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ENA_S  2
/** CACHE_L1_ICACHE3_PLD_DONE_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ENA    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ENA_M  (CACHE_L1_ICACHE3_PLD_DONE_INT_ENA_V << CACHE_L1_ICACHE3_PLD_DONE_INT_ENA_S)
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ENA_S  3
/** CACHE_L1_DCACHE_PLD_DONE_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Configures interrupt of L1-DCache preload-operation. If preload operation is done,
 *  interrupt occurs.
 */
#define CACHE_L1_DCACHE_PLD_DONE_INT_ENA    (BIT(4))
#define CACHE_L1_DCACHE_PLD_DONE_INT_ENA_M  (CACHE_L1_DCACHE_PLD_DONE_INT_ENA_V << CACHE_L1_DCACHE_PLD_DONE_INT_ENA_S)
#define CACHE_L1_DCACHE_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_DONE_INT_ENA_S  4
/** CACHE_SYNC_DONE_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Configures interrupt of Cache sync-operation done.
 */
#define CACHE_SYNC_DONE_INT_ENA    (BIT(6))
#define CACHE_SYNC_DONE_INT_ENA_M  (CACHE_SYNC_DONE_INT_ENA_V << CACHE_SYNC_DONE_INT_ENA_S)
#define CACHE_SYNC_DONE_INT_ENA_V  0x00000001U
#define CACHE_SYNC_DONE_INT_ENA_S  6
/** CACHE_L1_ICACHE0_PLD_ERR_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Configures interrupt of L1-ICache0 preload-operation error.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ENA    (BIT(7))
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ENA_M  (CACHE_L1_ICACHE0_PLD_ERR_INT_ENA_V << CACHE_L1_ICACHE0_PLD_ERR_INT_ENA_S)
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ENA_S  7
/** CACHE_L1_ICACHE1_PLD_ERR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  Configures interrupt of L1-ICache1 preload-operation error.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ENA    (BIT(8))
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ENA_M  (CACHE_L1_ICACHE1_PLD_ERR_INT_ENA_V << CACHE_L1_ICACHE1_PLD_ERR_INT_ENA_S)
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ENA_S  8
/** CACHE_L1_ICACHE2_PLD_ERR_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ENA    (BIT(9))
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ENA_M  (CACHE_L1_ICACHE2_PLD_ERR_INT_ENA_V << CACHE_L1_ICACHE2_PLD_ERR_INT_ENA_S)
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ENA_S  9
/** CACHE_L1_ICACHE3_PLD_ERR_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ENA    (BIT(10))
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ENA_M  (CACHE_L1_ICACHE3_PLD_ERR_INT_ENA_V << CACHE_L1_ICACHE3_PLD_ERR_INT_ENA_S)
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ENA_S  10
/** CACHE_L1_DCACHE_PLD_ERR_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  Configures interrupt of L1-DCache preload-operation error.
 */
#define CACHE_L1_DCACHE_PLD_ERR_INT_ENA    (BIT(11))
#define CACHE_L1_DCACHE_PLD_ERR_INT_ENA_M  (CACHE_L1_DCACHE_PLD_ERR_INT_ENA_V << CACHE_L1_DCACHE_PLD_ERR_INT_ENA_S)
#define CACHE_L1_DCACHE_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_ERR_INT_ENA_S  11
/** CACHE_SYNC_ERR_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  Configures interrupt of Cache sync-operation error.
 */
#define CACHE_SYNC_ERR_INT_ENA    (BIT(13))
#define CACHE_SYNC_ERR_INT_ENA_M  (CACHE_SYNC_ERR_INT_ENA_V << CACHE_SYNC_ERR_INT_ENA_S)
#define CACHE_SYNC_ERR_INT_ENA_V  0x00000001U
#define CACHE_SYNC_ERR_INT_ENA_S  13

/** CACHE_L1_CACHE_SYNC_PRELOAD_INT_CLR_REG register
 *  Sync Preload operation Interrupt clear register
 */
#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_CLR_REG (DR_REG_CACHE_BASE + 0x240)
/** CACHE_L1_ICACHE0_PLD_DONE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  The bit is used to clear interrupt that occurs only when L1-ICache0
 *  preload-operation is done.
 */
#define CACHE_L1_ICACHE0_PLD_DONE_INT_CLR    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_DONE_INT_CLR_M  (CACHE_L1_ICACHE0_PLD_DONE_INT_CLR_V << CACHE_L1_ICACHE0_PLD_DONE_INT_CLR_S)
#define CACHE_L1_ICACHE0_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_DONE_INT_CLR_S  0
/** CACHE_L1_ICACHE1_PLD_DONE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  The bit is used to clear interrupt that occurs only when L1-ICache1
 *  preload-operation is done.
 */
#define CACHE_L1_ICACHE1_PLD_DONE_INT_CLR    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_DONE_INT_CLR_M  (CACHE_L1_ICACHE1_PLD_DONE_INT_CLR_V << CACHE_L1_ICACHE1_PLD_DONE_INT_CLR_S)
#define CACHE_L1_ICACHE1_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_DONE_INT_CLR_S  1
/** CACHE_L1_ICACHE2_PLD_DONE_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_DONE_INT_CLR    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_DONE_INT_CLR_M  (CACHE_L1_ICACHE2_PLD_DONE_INT_CLR_V << CACHE_L1_ICACHE2_PLD_DONE_INT_CLR_S)
#define CACHE_L1_ICACHE2_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_DONE_INT_CLR_S  2
/** CACHE_L1_ICACHE3_PLD_DONE_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_DONE_INT_CLR    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_DONE_INT_CLR_M  (CACHE_L1_ICACHE3_PLD_DONE_INT_CLR_V << CACHE_L1_ICACHE3_PLD_DONE_INT_CLR_S)
#define CACHE_L1_ICACHE3_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_DONE_INT_CLR_S  3
/** CACHE_L1_DCACHE_PLD_DONE_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The bit is used to clear interrupt that occurs only when L1-DCache
 *  preload-operation is done.
 */
#define CACHE_L1_DCACHE_PLD_DONE_INT_CLR    (BIT(4))
#define CACHE_L1_DCACHE_PLD_DONE_INT_CLR_M  (CACHE_L1_DCACHE_PLD_DONE_INT_CLR_V << CACHE_L1_DCACHE_PLD_DONE_INT_CLR_S)
#define CACHE_L1_DCACHE_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_DONE_INT_CLR_S  4
/** CACHE_SYNC_DONE_INT_CLR : WT; bitpos: [6]; default: 0;
 *  The bit is used to clear interrupt that occurs only when Cache sync-operation is
 *  done.
 */
#define CACHE_SYNC_DONE_INT_CLR    (BIT(6))
#define CACHE_SYNC_DONE_INT_CLR_M  (CACHE_SYNC_DONE_INT_CLR_V << CACHE_SYNC_DONE_INT_CLR_S)
#define CACHE_SYNC_DONE_INT_CLR_V  0x00000001U
#define CACHE_SYNC_DONE_INT_CLR_S  6
/** CACHE_L1_ICACHE0_PLD_ERR_INT_CLR : WT; bitpos: [7]; default: 0;
 *  The bit is used to clear interrupt of L1-ICache0 preload-operation error.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_INT_CLR    (BIT(7))
#define CACHE_L1_ICACHE0_PLD_ERR_INT_CLR_M  (CACHE_L1_ICACHE0_PLD_ERR_INT_CLR_V << CACHE_L1_ICACHE0_PLD_ERR_INT_CLR_S)
#define CACHE_L1_ICACHE0_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_ERR_INT_CLR_S  7
/** CACHE_L1_ICACHE1_PLD_ERR_INT_CLR : WT; bitpos: [8]; default: 0;
 *  The bit is used to clear interrupt of L1-ICache1 preload-operation error.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_INT_CLR    (BIT(8))
#define CACHE_L1_ICACHE1_PLD_ERR_INT_CLR_M  (CACHE_L1_ICACHE1_PLD_ERR_INT_CLR_V << CACHE_L1_ICACHE1_PLD_ERR_INT_CLR_S)
#define CACHE_L1_ICACHE1_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_ERR_INT_CLR_S  8
/** CACHE_L1_ICACHE2_PLD_ERR_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_ERR_INT_CLR    (BIT(9))
#define CACHE_L1_ICACHE2_PLD_ERR_INT_CLR_M  (CACHE_L1_ICACHE2_PLD_ERR_INT_CLR_V << CACHE_L1_ICACHE2_PLD_ERR_INT_CLR_S)
#define CACHE_L1_ICACHE2_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_ERR_INT_CLR_S  9
/** CACHE_L1_ICACHE3_PLD_ERR_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_ERR_INT_CLR    (BIT(10))
#define CACHE_L1_ICACHE3_PLD_ERR_INT_CLR_M  (CACHE_L1_ICACHE3_PLD_ERR_INT_CLR_V << CACHE_L1_ICACHE3_PLD_ERR_INT_CLR_S)
#define CACHE_L1_ICACHE3_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_ERR_INT_CLR_S  10
/** CACHE_L1_DCACHE_PLD_ERR_INT_CLR : WT; bitpos: [11]; default: 0;
 *  The bit is used to clear interrupt of L1-DCache preload-operation error.
 */
#define CACHE_L1_DCACHE_PLD_ERR_INT_CLR    (BIT(11))
#define CACHE_L1_DCACHE_PLD_ERR_INT_CLR_M  (CACHE_L1_DCACHE_PLD_ERR_INT_CLR_V << CACHE_L1_DCACHE_PLD_ERR_INT_CLR_S)
#define CACHE_L1_DCACHE_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_ERR_INT_CLR_S  11
/** CACHE_SYNC_ERR_INT_CLR : WT; bitpos: [13]; default: 0;
 *  The bit is used to clear interrupt of Cache sync-operation error.
 */
#define CACHE_SYNC_ERR_INT_CLR    (BIT(13))
#define CACHE_SYNC_ERR_INT_CLR_M  (CACHE_SYNC_ERR_INT_CLR_V << CACHE_SYNC_ERR_INT_CLR_S)
#define CACHE_SYNC_ERR_INT_CLR_V  0x00000001U
#define CACHE_SYNC_ERR_INT_CLR_S  13

/** CACHE_L1_CACHE_SYNC_PRELOAD_INT_RAW_REG register
 *  Sync Preload operation Interrupt raw register
 */
#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_RAW_REG (DR_REG_CACHE_BASE + 0x244)
/** CACHE_L1_ICACHE0_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation is
 *  done.
 */
#define CACHE_L1_ICACHE0_PLD_DONE_INT_RAW    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_DONE_INT_RAW_M  (CACHE_L1_ICACHE0_PLD_DONE_INT_RAW_V << CACHE_L1_ICACHE0_PLD_DONE_INT_RAW_S)
#define CACHE_L1_ICACHE0_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_DONE_INT_RAW_S  0
/** CACHE_L1_ICACHE1_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation is
 *  done.
 */
#define CACHE_L1_ICACHE1_PLD_DONE_INT_RAW    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_DONE_INT_RAW_M  (CACHE_L1_ICACHE1_PLD_DONE_INT_RAW_V << CACHE_L1_ICACHE1_PLD_DONE_INT_RAW_S)
#define CACHE_L1_ICACHE1_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_DONE_INT_RAW_S  1
/** CACHE_L1_ICACHE2_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_DONE_INT_RAW    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_DONE_INT_RAW_M  (CACHE_L1_ICACHE2_PLD_DONE_INT_RAW_V << CACHE_L1_ICACHE2_PLD_DONE_INT_RAW_S)
#define CACHE_L1_ICACHE2_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_DONE_INT_RAW_S  2
/** CACHE_L1_ICACHE3_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_DONE_INT_RAW    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_DONE_INT_RAW_M  (CACHE_L1_ICACHE3_PLD_DONE_INT_RAW_V << CACHE_L1_ICACHE3_PLD_DONE_INT_RAW_S)
#define CACHE_L1_ICACHE3_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_DONE_INT_RAW_S  3
/** CACHE_L1_DCACHE_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-DCache preload-operation is
 *  done.
 */
#define CACHE_L1_DCACHE_PLD_DONE_INT_RAW    (BIT(4))
#define CACHE_L1_DCACHE_PLD_DONE_INT_RAW_M  (CACHE_L1_DCACHE_PLD_DONE_INT_RAW_V << CACHE_L1_DCACHE_PLD_DONE_INT_RAW_S)
#define CACHE_L1_DCACHE_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_DONE_INT_RAW_S  4
/** CACHE_SYNC_DONE_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw bit of the interrupt that occurs only when Cache sync-operation is done.
 */
#define CACHE_SYNC_DONE_INT_RAW    (BIT(6))
#define CACHE_SYNC_DONE_INT_RAW_M  (CACHE_SYNC_DONE_INT_RAW_V << CACHE_SYNC_DONE_INT_RAW_S)
#define CACHE_SYNC_DONE_INT_RAW_V  0x00000001U
#define CACHE_SYNC_DONE_INT_RAW_S  6
/** CACHE_L1_ICACHE0_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation
 *  error occurs.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_INT_RAW    (BIT(7))
#define CACHE_L1_ICACHE0_PLD_ERR_INT_RAW_M  (CACHE_L1_ICACHE0_PLD_ERR_INT_RAW_V << CACHE_L1_ICACHE0_PLD_ERR_INT_RAW_S)
#define CACHE_L1_ICACHE0_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_ERR_INT_RAW_S  7
/** CACHE_L1_ICACHE1_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation
 *  error occurs.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_INT_RAW    (BIT(8))
#define CACHE_L1_ICACHE1_PLD_ERR_INT_RAW_M  (CACHE_L1_ICACHE1_PLD_ERR_INT_RAW_V << CACHE_L1_ICACHE1_PLD_ERR_INT_RAW_S)
#define CACHE_L1_ICACHE1_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_ERR_INT_RAW_S  8
/** CACHE_L1_ICACHE2_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_PLD_ERR_INT_RAW    (BIT(9))
#define CACHE_L1_ICACHE2_PLD_ERR_INT_RAW_M  (CACHE_L1_ICACHE2_PLD_ERR_INT_RAW_V << CACHE_L1_ICACHE2_PLD_ERR_INT_RAW_S)
#define CACHE_L1_ICACHE2_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_ERR_INT_RAW_S  9
/** CACHE_L1_ICACHE3_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_PLD_ERR_INT_RAW    (BIT(10))
#define CACHE_L1_ICACHE3_PLD_ERR_INT_RAW_M  (CACHE_L1_ICACHE3_PLD_ERR_INT_RAW_V << CACHE_L1_ICACHE3_PLD_ERR_INT_RAW_S)
#define CACHE_L1_ICACHE3_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_ERR_INT_RAW_S  10
/** CACHE_L1_DCACHE_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw bit of the interrupt that occurs only when L1-DCache preload-operation
 *  error occurs.
 */
#define CACHE_L1_DCACHE_PLD_ERR_INT_RAW    (BIT(11))
#define CACHE_L1_DCACHE_PLD_ERR_INT_RAW_M  (CACHE_L1_DCACHE_PLD_ERR_INT_RAW_V << CACHE_L1_DCACHE_PLD_ERR_INT_RAW_S)
#define CACHE_L1_DCACHE_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L1_DCACHE_PLD_ERR_INT_RAW_S  11
/** CACHE_SYNC_ERR_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw bit of the interrupt that occurs only when Cache sync-operation error
 *  occurs.
 */
#define CACHE_SYNC_ERR_INT_RAW    (BIT(13))
#define CACHE_SYNC_ERR_INT_RAW_M  (CACHE_SYNC_ERR_INT_RAW_V << CACHE_SYNC_ERR_INT_RAW_S)
#define CACHE_SYNC_ERR_INT_RAW_V  0x00000001U
#define CACHE_SYNC_ERR_INT_RAW_S  13

