espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L1_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG register
 *  Cache Autoload buffer clear control register
 */
#define CACHE_L1_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG (DR_REG_CACHE_BASE + 0x258)
/** CACHE_L1_ICACHE0_ALD_BUF_CLR : R/W; bitpos: [0]; default: 0;
 *  Configures clear autoload-buffer inside L1-ICache0. If this bit is active, autoload
 *  will not work in L1-ICache0. This bit should not be active when autoload works in
 *  L1-ICache0.
 */
#define CACHE_L1_ICACHE0_ALD_BUF_CLR    (BIT(0))
#define CACHE_L1_ICACHE0_ALD_BUF_CLR_M  (CACHE_L1_ICACHE0_ALD_BUF_CLR_V << CACHE_L1_ICACHE0_ALD_BUF_CLR_S)
#define CACHE_L1_ICACHE0_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L1_ICACHE0_ALD_BUF_CLR_S  0
/** CACHE_L1_ICACHE1_ALD_BUF_CLR : R/W; bitpos: [1]; default: 0;
 *  Configures clear autoload-buffer inside L1-ICache1. If this bit is active, autoload
 *  will not work in L1-ICache1. This bit should not be active when autoload works in
 *  L1-ICache1.
 */
#define CACHE_L1_ICACHE1_ALD_BUF_CLR    (BIT(1))
#define CACHE_L1_ICACHE1_ALD_BUF_CLR_M  (CACHE_L1_ICACHE1_ALD_BUF_CLR_V << CACHE_L1_ICACHE1_ALD_BUF_CLR_S)
#define CACHE_L1_ICACHE1_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L1_ICACHE1_ALD_BUF_CLR_S  1
/** CACHE_L1_ICACHE2_ALD_BUF_CLR : R/W; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_ALD_BUF_CLR    (BIT(2))
#define CACHE_L1_ICACHE2_ALD_BUF_CLR_M  (CACHE_L1_ICACHE2_ALD_BUF_CLR_V << CACHE_L1_ICACHE2_ALD_BUF_CLR_S)
#define CACHE_L1_ICACHE2_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_ALD_BUF_CLR_S  2
/** CACHE_L1_ICACHE3_ALD_BUF_CLR : R/W; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_ALD_BUF_CLR    (BIT(3))
#define CACHE_L1_ICACHE3_ALD_BUF_CLR_M  (CACHE_L1_ICACHE3_ALD_BUF_CLR_V << CACHE_L1_ICACHE3_ALD_BUF_CLR_S)
#define CACHE_L1_ICACHE3_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L1_ICACHE3_ALD_BUF_CLR_S  3
/** CACHE_L1_DCACHE_ALD_BUF_CLR : R/W; bitpos: [4]; default: 0;
 *  Configures clear autoload-buffer inside L1-DCache. If this bit is active, autoload
 *  will not work in L1-DCache. This bit should not be active when autoload works in
 *  L1-DCache.
 */
#define CACHE_L1_DCACHE_ALD_BUF_CLR    (BIT(4))
#define CACHE_L1_DCACHE_ALD_BUF_CLR_M  (CACHE_L1_DCACHE_ALD_BUF_CLR_V << CACHE_L1_DCACHE_ALD_BUF_CLR_S)
#define CACHE_L1_DCACHE_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L1_DCACHE_ALD_BUF_CLR_S  4

/** CACHE_L1_UNALLOCATE_BUFFER_CLEAR_REG register
 *  Unallocate request buffer clear registers
 */
#define CACHE_L1_UNALLOCATE_BUFFER_CLEAR_REG (DR_REG_CACHE_BASE + 0x25c)
/** CACHE_L1_ICACHE0_UNALLOC_CLR : R/W; bitpos: [0]; default: 0;
 *  The bit is used to clear the unallocate request buffer of l1 icache0 where the
 *  unallocate request is responded but not completed.
 */
#define CACHE_L1_ICACHE0_UNALLOC_CLR    (BIT(0))
#define CACHE_L1_ICACHE0_UNALLOC_CLR_M  (CACHE_L1_ICACHE0_UNALLOC_CLR_V << CACHE_L1_ICACHE0_UNALLOC_CLR_S)
#define CACHE_L1_ICACHE0_UNALLOC_CLR_V  0x00000001U
#define CACHE_L1_ICACHE0_UNALLOC_CLR_S  0
/** CACHE_L1_ICACHE1_UNALLOC_CLR : R/W; bitpos: [1]; default: 0;
 *  The bit is used to clear the unallocate request buffer of l1 icache1 where the
 *  unallocate request is responded but not completed.
 */
#define CACHE_L1_ICACHE1_UNALLOC_CLR    (BIT(1))
#define CACHE_L1_ICACHE1_UNALLOC_CLR_M  (CACHE_L1_ICACHE1_UNALLOC_CLR_V << CACHE_L1_ICACHE1_UNALLOC_CLR_S)
#define CACHE_L1_ICACHE1_UNALLOC_CLR_V  0x00000001U
#define CACHE_L1_ICACHE1_UNALLOC_CLR_S  1
/** CACHE_L1_ICACHE2_UNALLOC_CLR : R/W; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_UNALLOC_CLR    (BIT(2))
#define CACHE_L1_ICACHE2_UNALLOC_CLR_M  (CACHE_L1_ICACHE2_UNALLOC_CLR_V << CACHE_L1_ICACHE2_UNALLOC_CLR_S)
#define CACHE_L1_ICACHE2_UNALLOC_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_UNALLOC_CLR_S  2
/** CACHE_L1_ICACHE3_UNALLOC_CLR : R/W; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_UNALLOC_CLR    (BIT(3))
#define CACHE_L1_ICACHE3_UNALLOC_CLR_M  (CACHE_L1_ICACHE3_UNALLOC_CLR_V << CACHE_L1_ICACHE3_UNALLOC_CLR_S)
#define CACHE_L1_ICACHE3_UNALLOC_CLR_V  0x00000001U
#define CACHE_L1_ICACHE3_UNALLOC_CLR_S  3
/** CACHE_L1_DCACHE_UNALLOC_CLR : R/W; bitpos: [4]; default: 0;
 *  The bit is used to clear the unallocate request buffer of l1 dcache where the
 *  unallocate request is responded but not completed.
 */
#define CACHE_L1_DCACHE_UNALLOC_CLR    (BIT(4))
#define CACHE_L1_DCACHE_UNALLOC_CLR_M  (CACHE_L1_DCACHE_UNALLOC_CLR_V << CACHE_L1_DCACHE_UNALLOC_CLR_S)
#define CACHE_L1_DCACHE_UNALLOC_CLR_V  0x00000001U
#define CACHE_L1_DCACHE_UNALLOC_CLR_S  4

/** CACHE_L1_CACHE_OBJECT_CTRL_REG register
 *  Cache Tag and Data memory Object control register
 */
#define CACHE_L1_CACHE_OBJECT_CTRL_REG (DR_REG_CACHE_BASE + 0x260)
/** CACHE_L1_ICACHE0_TAG_OBJECT : R/W; bitpos: [0]; default: 0;
 *  Configures set L1-ICache0 tag memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_ICACHE0_TAG_OBJECT    (BIT(0))
#define CACHE_L1_ICACHE0_TAG_OBJECT_M  (CACHE_L1_ICACHE0_TAG_OBJECT_V << CACHE_L1_ICACHE0_TAG_OBJECT_S)
#define CACHE_L1_ICACHE0_TAG_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_OBJECT_S  0
/** CACHE_L1_ICACHE1_TAG_OBJECT : R/W; bitpos: [1]; default: 0;
 *  Configures set L1-ICache1 tag memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_ICACHE1_TAG_OBJECT    (BIT(1))
#define CACHE_L1_ICACHE1_TAG_OBJECT_M  (CACHE_L1_ICACHE1_TAG_OBJECT_V << CACHE_L1_ICACHE1_TAG_OBJECT_S)
#define CACHE_L1_ICACHE1_TAG_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_OBJECT_S  1
/** CACHE_L1_ICACHE2_TAG_OBJECT : R/W; bitpos: [2]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_TAG_OBJECT    (BIT(2))
#define CACHE_L1_ICACHE2_TAG_OBJECT_M  (CACHE_L1_ICACHE2_TAG_OBJECT_V << CACHE_L1_ICACHE2_TAG_OBJECT_S)
#define CACHE_L1_ICACHE2_TAG_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_OBJECT_S  2
/** CACHE_L1_ICACHE3_TAG_OBJECT : R/W; bitpos: [3]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_TAG_OBJECT    (BIT(3))
#define CACHE_L1_ICACHE3_TAG_OBJECT_M  (CACHE_L1_ICACHE3_TAG_OBJECT_V << CACHE_L1_ICACHE3_TAG_OBJECT_S)
#define CACHE_L1_ICACHE3_TAG_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_OBJECT_S  3
/** CACHE_L1_DCACHE_TAG_OBJECT : R/W; bitpos: [4]; default: 0;
 *  Configures set L1-DCache tag memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_DCACHE_TAG_OBJECT    (BIT(4))
#define CACHE_L1_DCACHE_TAG_OBJECT_M  (CACHE_L1_DCACHE_TAG_OBJECT_V << CACHE_L1_DCACHE_TAG_OBJECT_S)
#define CACHE_L1_DCACHE_TAG_OBJECT_V  0x00000001U
#define CACHE_L1_DCACHE_TAG_OBJECT_S  4
/** CACHE_L1_ICACHE0_MEM_OBJECT : R/W; bitpos: [6]; default: 0;
 *  Configures set L1-ICache0 data memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_ICACHE0_MEM_OBJECT    (BIT(6))
#define CACHE_L1_ICACHE0_MEM_OBJECT_M  (CACHE_L1_ICACHE0_MEM_OBJECT_V << CACHE_L1_ICACHE0_MEM_OBJECT_S)
#define CACHE_L1_ICACHE0_MEM_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE0_MEM_OBJECT_S  6
/** CACHE_L1_ICACHE1_MEM_OBJECT : R/W; bitpos: [7]; default: 0;
 *  Configures set L1-ICache1 data memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_ICACHE1_MEM_OBJECT    (BIT(7))
#define CACHE_L1_ICACHE1_MEM_OBJECT_M  (CACHE_L1_ICACHE1_MEM_OBJECT_V << CACHE_L1_ICACHE1_MEM_OBJECT_S)
#define CACHE_L1_ICACHE1_MEM_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE1_MEM_OBJECT_S  7
/** CACHE_L1_ICACHE2_MEM_OBJECT : R/W; bitpos: [8]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE2_MEM_OBJECT    (BIT(8))
#define CACHE_L1_ICACHE2_MEM_OBJECT_M  (CACHE_L1_ICACHE2_MEM_OBJECT_V << CACHE_L1_ICACHE2_MEM_OBJECT_S)
#define CACHE_L1_ICACHE2_MEM_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE2_MEM_OBJECT_S  8
/** CACHE_L1_ICACHE3_MEM_OBJECT : R/W; bitpos: [9]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L1_ICACHE3_MEM_OBJECT    (BIT(9))
#define CACHE_L1_ICACHE3_MEM_OBJECT_M  (CACHE_L1_ICACHE3_MEM_OBJECT_V << CACHE_L1_ICACHE3_MEM_OBJECT_S)
#define CACHE_L1_ICACHE3_MEM_OBJECT_V  0x00000001U
#define CACHE_L1_ICACHE3_MEM_OBJECT_S  9
/** CACHE_L1_DCACHE_MEM_OBJECT : R/W; bitpos: [10]; default: 0;
 *  Configures set L1-DCache data memory as object. This bit should be onehot with the
 *  others fields inside this register.
 */
#define CACHE_L1_DCACHE_MEM_OBJECT    (BIT(10))
#define CACHE_L1_DCACHE_MEM_OBJECT_M  (CACHE_L1_DCACHE_MEM_OBJECT_V << CACHE_L1_DCACHE_MEM_OBJECT_S)
#define CACHE_L1_DCACHE_MEM_OBJECT_V  0x00000001U
#define CACHE_L1_DCACHE_MEM_OBJECT_S  10

/** CACHE_L1_CACHE_WAY_OBJECT_REG register
 *  Cache Tag and Data memory way register
 */
#define CACHE_L1_CACHE_WAY_OBJECT_REG (DR_REG_CACHE_BASE + 0x264)
/** CACHE_L1_CACHE_WAY_OBJECT : R/W; bitpos: [2:0]; default: 0;
 *  Configures way of the tag-object will be accessed.
 *  1: way1
 */
#define CACHE_L1_CACHE_WAY_OBJECT    0x00000007U
#define CACHE_L1_CACHE_WAY_OBJECT_M  (CACHE_L1_CACHE_WAY_OBJECT_V << CACHE_L1_CACHE_WAY_OBJECT_S)
#define CACHE_L1_CACHE_WAY_OBJECT_V  0x00000007U
#define CACHE_L1_CACHE_WAY_OBJECT_S  0

/** CACHE_L1_CACHE_ADDR_REG register
 *  Cache address register
 */
#define CACHE_L1_CACHE_ADDR_REG (DR_REG_CACHE_BASE + 0x268)
/** CACHE_L1_CACHE_ADDR : R/W; bitpos: [31:0]; default: 1073741824;
 *  Those bits stores the address which will decide where inside the specified tag
 *  memory object will be accessed.
 */
#define CACHE_L1_CACHE_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_ADDR_M  (CACHE_L1_CACHE_ADDR_V << CACHE_L1_CACHE_ADDR_S)
#define CACHE_L1_CACHE_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_ADDR_S  0

/** CACHE_L1_CACHE_DEBUG_BUS_REG register
 *  Cache Tag/data memory content register
 */
#define CACHE_L1_CACHE_DEBUG_BUS_REG (DR_REG_CACHE_BASE + 0x26c)
/** CACHE_L1_CACHE_DEBUG_BUS : R/W; bitpos: [31:0]; default: 620;
 *  This is a constant place where we can write data to or read data from the tag/data
 *  memory on the specified cache.
 */
#define CACHE_L1_CACHE_DEBUG_BUS    0xFFFFFFFFU
#define CACHE_L1_CACHE_DEBUG_BUS_M  (CACHE_L1_CACHE_DEBUG_BUS_V << CACHE_L1_CACHE_DEBUG_BUS_S)
#define CACHE_L1_CACHE_DEBUG_BUS_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_DEBUG_BUS_S  0

/** CACHE_LEVEL_SPLIT0_REG register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_LEVEL_SPLIT0_REG (DR_REG_CACHE_BASE + 0x270)
/** CACHE_LEVEL_SPLIT0 : HRO; bitpos: [31:0]; default: 624;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_LEVEL_SPLIT0    0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT0_M  (CACHE_LEVEL_SPLIT0_V << CACHE_LEVEL_SPLIT0_S)
#define CACHE_LEVEL_SPLIT0_V  0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT0_S  0

/** CACHE_L2_CACHE_CTRL_REG register
 *  L2 Cache(L2-Cache) control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_CTRL_REG (DR_REG_CACHE_BASE + 0x274)
/** CACHE_L2_CACHE_SHUT_DMA : HRO; bitpos: [4]; default: 1;
 *  The bit is used to disable DMA access L2-Cache, 0: enable, 1: disable
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_SHUT_DMA    (BIT(4))
#define CACHE_L2_CACHE_SHUT_DMA_M  (CACHE_L2_CACHE_SHUT_DMA_V << CACHE_L2_CACHE_SHUT_DMA_S)
#define CACHE_L2_CACHE_SHUT_DMA_V  0x00000001U
#define CACHE_L2_CACHE_SHUT_DMA_S  4
/** CACHE_L2_CACHE_UNDEF_OP : HRO; bitpos: [15:8]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_UNDEF_OP    0x000000FFU
#define CACHE_L2_CACHE_UNDEF_OP_M  (CACHE_L2_CACHE_UNDEF_OP_V << CACHE_L2_CACHE_UNDEF_OP_S)
#define CACHE_L2_CACHE_UNDEF_OP_V  0x000000FFU
#define CACHE_L2_CACHE_UNDEF_OP_S  8

