espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_CACHE_PRELOAD_SIZE_REG register
 *  L2 Cache preload size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0x2b0)
/** CACHE_L2_CACHE_PRELOAD_SIZE : HRO; bitpos: [15:0]; default: 0;
 *  Configures the size of the first section of prelock on L2-Cache, which should be
 *  used together with L2_CACHE_PRELOAD_ADDR_REG
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PRELOAD_SIZE    0x0000FFFFU
#define CACHE_L2_CACHE_PRELOAD_SIZE_M  (CACHE_L2_CACHE_PRELOAD_SIZE_V << CACHE_L2_CACHE_PRELOAD_SIZE_S)
#define CACHE_L2_CACHE_PRELOAD_SIZE_V  0x0000FFFFU
#define CACHE_L2_CACHE_PRELOAD_SIZE_S  0

/** CACHE_L2_CACHE_AUTOLOAD_CTRL_REG register
 *  L2 Cache autoload-operation control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x2b4)
/** CACHE_L2_CACHE_AUTOLOAD_ENA : HRO; bitpos: [0]; default: 0;
 *  Configures and disable autoload operation on L2-Cache.  1: enable, 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L2_CACHE_AUTOLOAD_ENA_M  (CACHE_L2_CACHE_AUTOLOAD_ENA_V << CACHE_L2_CACHE_AUTOLOAD_ENA_S)
#define CACHE_L2_CACHE_AUTOLOAD_ENA_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_ENA_S  0
/** CACHE_L2_CACHE_AUTOLOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether autoload operation on L2-Cache is finished or
 *  not. 0: not finished. 1: finished.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L2_CACHE_AUTOLOAD_DONE_M  (CACHE_L2_CACHE_AUTOLOAD_DONE_V << CACHE_L2_CACHE_AUTOLOAD_DONE_S)
#define CACHE_L2_CACHE_AUTOLOAD_DONE_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_DONE_S  1
/** CACHE_L2_CACHE_AUTOLOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  Configures the direction of autoload operation on L2-Cache. 0: ascending. 1:
 *  descending.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L2_CACHE_AUTOLOAD_ORDER_M  (CACHE_L2_CACHE_AUTOLOAD_ORDER_V << CACHE_L2_CACHE_AUTOLOAD_ORDER_S)
#define CACHE_L2_CACHE_AUTOLOAD_ORDER_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_ORDER_S  2
/** CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE : HRO; bitpos: [4:3]; default: 0;
 *  The field is used to configure trigger mode of autoload operation on L2-Cache. 0/3:
 *  miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE    0x00000003U
#define CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE_M  (CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE_V << CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE_S)
#define CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE_V  0x00000003U
#define CACHE_L2_CACHE_AUTOLOAD_TRIGGER_MODE_S  3
/** CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA : HRO; bitpos: [8]; default: 0;
 *  Configures the first section for autoload operation on L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA_M  (CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA_V << CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ENA_S  8
/** CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA : HRO; bitpos: [9]; default: 0;
 *  Configures the second section for autoload operation on L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA_M  (CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA_V << CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ENA_S  9
/** CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA : HRO; bitpos: [10]; default: 0;
 *  Configures the third section for autoload operation on L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA    (BIT(10))
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA_M  (CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA_V << CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ENA_S  10
/** CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA : HRO; bitpos: [11]; default: 0;
 *  Configures the fourth section for autoload operation on L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA    (BIT(11))
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA_M  (CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA_V << CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA_V  0x00000001U
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ENA_S  11
/** CACHE_L2_CACHE_AUTOLOAD_RGID : HRO; bitpos: [15:12]; default: 0;
 *  Configures the gid of l2 cache autoload.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_RGID    0x0000000FU
#define CACHE_L2_CACHE_AUTOLOAD_RGID_M  (CACHE_L2_CACHE_AUTOLOAD_RGID_V << CACHE_L2_CACHE_AUTOLOAD_RGID_S)
#define CACHE_L2_CACHE_AUTOLOAD_RGID_V  0x0000000FU
#define CACHE_L2_CACHE_AUTOLOAD_RGID_S  12

/** CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_REG register
 *  L2 Cache autoload section 0 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x2b8)
/** CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the first section for autoload operation on
 *  L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_SIZE and
 *  L2_CACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_M  (CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_V << CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_REG register
 *  L2 Cache autoload section 0 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0x2bc)
/** CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the first section for autoload operation on L2-Cache. Note
 *  that it should be used together with L2_CACHE_AUTOLOAD_SCT0_ADDR and
 *  L2_CACHE_AUTOLOAD_SCT0_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE    0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_M  (CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_V << CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_V  0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_REG register
 *  L2 Cache autoload section 1 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x2c0)
/** CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the second section for autoload operation on
 *  L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT1_SIZE and
 *  L2_CACHE_AUTOLOAD_SCT1_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_M  (CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_V << CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_REG register
 *  L2 Cache autoload section 1 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0x2c4)
/** CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the second section for autoload operation on L2-Cache. Note
 *  that it should be used together with L2_CACHE_AUTOLOAD_SCT1_ADDR and
 *  L2_CACHE_AUTOLOAD_SCT1_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE    0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_M  (CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_V << CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_V  0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT1_SIZE_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_REG register
 *  L2 Cache autoload section 2 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_REG (DR_REG_CACHE_BASE + 0x2c8)
/** CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the third section for autoload operation on
 *  L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT2_SIZE and
 *  L2_CACHE_AUTOLOAD_SCT2_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_M  (CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_V << CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_ADDR_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_REG register
 *  L2 Cache autoload section 2 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_REG (DR_REG_CACHE_BASE + 0x2cc)
/** CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the third section for autoload operation on L2-Cache. Note
 *  that it should be used together with L2_CACHE_AUTOLOAD_SCT2_ADDR and
 *  L2_CACHE_AUTOLOAD_SCT2_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE    0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_M  (CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_V << CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_V  0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT2_SIZE_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_REG register
 *  L2 Cache autoload section 3 address configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_REG (DR_REG_CACHE_BASE + 0x2d0)
/** CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Configures the start address of the fourth section for autoload operation on
 *  L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT3_SIZE and
 *  L2_CACHE_AUTOLOAD_SCT3_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_M  (CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_V << CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_ADDR_S  0

/** CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_REG register
 *  L2 Cache autoload section 3 size configure register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_REG (DR_REG_CACHE_BASE + 0x2d4)
/** CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE : HRO; bitpos: [27:0]; default: 0;
 *  Configures the size of the fourth section for autoload operation on L2-Cache. Note
 *  that it should be used together with L2_CACHE_AUTOLOAD_SCT3_ADDR and
 *  L2_CACHE_AUTOLOAD_SCT3_ENA.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE    0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_M  (CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_V << CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_S)
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_V  0x0FFFFFFFU
#define CACHE_L2_CACHE_AUTOLOAD_SCT3_SIZE_S  0

/** CACHE_L2_CACHE_ACS_CNT_INT_ENA_REG register
 *  Cache Access Counter Interrupt enable register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_CNT_INT_ENA_REG (DR_REG_CACHE_BASE + 0x2d8)
/** CACHE_L2_IBUS0_OVF_INT_ENA : HRO; bitpos: [8]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
 *  bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_OVF_INT_ENA    (BIT(8))
#define CACHE_L2_IBUS0_OVF_INT_ENA_M  (CACHE_L2_IBUS0_OVF_INT_ENA_V << CACHE_L2_IBUS0_OVF_INT_ENA_S)
#define CACHE_L2_IBUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_IBUS0_OVF_INT_ENA_S  8
/** CACHE_L2_IBUS1_OVF_INT_ENA : HRO; bitpos: [9]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
 *  bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_OVF_INT_ENA    (BIT(9))
#define CACHE_L2_IBUS1_OVF_INT_ENA_M  (CACHE_L2_IBUS1_OVF_INT_ENA_V << CACHE_L2_IBUS1_OVF_INT_ENA_S)
#define CACHE_L2_IBUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_IBUS1_OVF_INT_ENA_S  9
/** CACHE_L2_IBUS2_OVF_INT_ENA : HRO; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_OVF_INT_ENA    (BIT(10))
#define CACHE_L2_IBUS2_OVF_INT_ENA_M  (CACHE_L2_IBUS2_OVF_INT_ENA_V << CACHE_L2_IBUS2_OVF_INT_ENA_S)
#define CACHE_L2_IBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_IBUS2_OVF_INT_ENA_S  10
/** CACHE_L2_IBUS3_OVF_INT_ENA : HRO; bitpos: [11]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_OVF_INT_ENA    (BIT(11))
#define CACHE_L2_IBUS3_OVF_INT_ENA_M  (CACHE_L2_IBUS3_OVF_INT_ENA_V << CACHE_L2_IBUS3_OVF_INT_ENA_S)
#define CACHE_L2_IBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_IBUS3_OVF_INT_ENA_S  11
/** CACHE_L2_DBUS0_OVF_INT_ENA : HRO; bitpos: [12]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
 *  bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_OVF_INT_ENA    (BIT(12))
#define CACHE_L2_DBUS0_OVF_INT_ENA_M  (CACHE_L2_DBUS0_OVF_INT_ENA_V << CACHE_L2_DBUS0_OVF_INT_ENA_S)
#define CACHE_L2_DBUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_DBUS0_OVF_INT_ENA_S  12
/** CACHE_L2_DBUS1_OVF_INT_ENA : HRO; bitpos: [13]; default: 0;
 *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
 *  bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_OVF_INT_ENA    (BIT(13))
#define CACHE_L2_DBUS1_OVF_INT_ENA_M  (CACHE_L2_DBUS1_OVF_INT_ENA_V << CACHE_L2_DBUS1_OVF_INT_ENA_S)
#define CACHE_L2_DBUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_DBUS1_OVF_INT_ENA_S  13
/** CACHE_L2_DBUS2_OVF_INT_ENA : HRO; bitpos: [14]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_OVF_INT_ENA    (BIT(14))
#define CACHE_L2_DBUS2_OVF_INT_ENA_M  (CACHE_L2_DBUS2_OVF_INT_ENA_V << CACHE_L2_DBUS2_OVF_INT_ENA_S)
#define CACHE_L2_DBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_DBUS2_OVF_INT_ENA_S  14
/** CACHE_L2_DBUS3_OVF_INT_ENA : HRO; bitpos: [15]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_OVF_INT_ENA    (BIT(15))
#define CACHE_L2_DBUS3_OVF_INT_ENA_M  (CACHE_L2_DBUS3_OVF_INT_ENA_V << CACHE_L2_DBUS3_OVF_INT_ENA_S)
#define CACHE_L2_DBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L2_DBUS3_OVF_INT_ENA_S  15

/** CACHE_L2_CACHE_ACS_CNT_INT_CLR_REG register
 *  Cache Access Counter Interrupt clear register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_CNT_INT_CLR_REG (DR_REG_CACHE_BASE + 0x2dc)
/** CACHE_L2_IBUS0_OVF_INT_CLR : WT; bitpos: [8]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
 *  to bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_OVF_INT_CLR    (BIT(8))
#define CACHE_L2_IBUS0_OVF_INT_CLR_M  (CACHE_L2_IBUS0_OVF_INT_CLR_V << CACHE_L2_IBUS0_OVF_INT_CLR_S)
#define CACHE_L2_IBUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_IBUS0_OVF_INT_CLR_S  8
/** CACHE_L2_IBUS1_OVF_INT_CLR : WT; bitpos: [9]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
 *  to bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_OVF_INT_CLR    (BIT(9))
#define CACHE_L2_IBUS1_OVF_INT_CLR_M  (CACHE_L2_IBUS1_OVF_INT_CLR_V << CACHE_L2_IBUS1_OVF_INT_CLR_S)
#define CACHE_L2_IBUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_IBUS1_OVF_INT_CLR_S  9
/** CACHE_L2_IBUS2_OVF_INT_CLR : HRO; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_OVF_INT_CLR    (BIT(10))
#define CACHE_L2_IBUS2_OVF_INT_CLR_M  (CACHE_L2_IBUS2_OVF_INT_CLR_V << CACHE_L2_IBUS2_OVF_INT_CLR_S)
#define CACHE_L2_IBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_IBUS2_OVF_INT_CLR_S  10
/** CACHE_L2_IBUS3_OVF_INT_CLR : HRO; bitpos: [11]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_OVF_INT_CLR    (BIT(11))
#define CACHE_L2_IBUS3_OVF_INT_CLR_M  (CACHE_L2_IBUS3_OVF_INT_CLR_V << CACHE_L2_IBUS3_OVF_INT_CLR_S)
#define CACHE_L2_IBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_IBUS3_OVF_INT_CLR_S  11
/** CACHE_L2_DBUS0_OVF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
 *  to bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_OVF_INT_CLR    (BIT(12))
#define CACHE_L2_DBUS0_OVF_INT_CLR_M  (CACHE_L2_DBUS0_OVF_INT_CLR_V << CACHE_L2_DBUS0_OVF_INT_CLR_S)
#define CACHE_L2_DBUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_DBUS0_OVF_INT_CLR_S  12
/** CACHE_L2_DBUS1_OVF_INT_CLR : WT; bitpos: [13]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
 *  to bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_OVF_INT_CLR    (BIT(13))
#define CACHE_L2_DBUS1_OVF_INT_CLR_M  (CACHE_L2_DBUS1_OVF_INT_CLR_V << CACHE_L2_DBUS1_OVF_INT_CLR_S)
#define CACHE_L2_DBUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_DBUS1_OVF_INT_CLR_S  13
/** CACHE_L2_DBUS2_OVF_INT_CLR : HRO; bitpos: [14]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_OVF_INT_CLR    (BIT(14))
#define CACHE_L2_DBUS2_OVF_INT_CLR_M  (CACHE_L2_DBUS2_OVF_INT_CLR_V << CACHE_L2_DBUS2_OVF_INT_CLR_S)
#define CACHE_L2_DBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_DBUS2_OVF_INT_CLR_S  14
/** CACHE_L2_DBUS3_OVF_INT_CLR : HRO; bitpos: [15]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_OVF_INT_CLR    (BIT(15))
#define CACHE_L2_DBUS3_OVF_INT_CLR_M  (CACHE_L2_DBUS3_OVF_INT_CLR_V << CACHE_L2_DBUS3_OVF_INT_CLR_S)
#define CACHE_L2_DBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L2_DBUS3_OVF_INT_CLR_S  15

