espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_CACHE_ACS_CNT_INT_RAW_REG register
 *  Cache Access Counter Interrupt raw register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_CNT_INT_RAW_REG (DR_REG_CACHE_BASE + 0x2e0)
/** CACHE_L2_IBUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus0 accesses L2-ICache0.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_OVF_INT_RAW    (BIT(8))
#define CACHE_L2_IBUS0_OVF_INT_RAW_M  (CACHE_L2_IBUS0_OVF_INT_RAW_V << CACHE_L2_IBUS0_OVF_INT_RAW_S)
#define CACHE_L2_IBUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_IBUS0_OVF_INT_RAW_S  8
/** CACHE_L2_IBUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus1 accesses L2-ICache1.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_OVF_INT_RAW    (BIT(9))
#define CACHE_L2_IBUS1_OVF_INT_RAW_M  (CACHE_L2_IBUS1_OVF_INT_RAW_V << CACHE_L2_IBUS1_OVF_INT_RAW_S)
#define CACHE_L2_IBUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_IBUS1_OVF_INT_RAW_S  9
/** CACHE_L2_IBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus2 accesses L2-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_OVF_INT_RAW    (BIT(10))
#define CACHE_L2_IBUS2_OVF_INT_RAW_M  (CACHE_L2_IBUS2_OVF_INT_RAW_V << CACHE_L2_IBUS2_OVF_INT_RAW_S)
#define CACHE_L2_IBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_IBUS2_OVF_INT_RAW_S  10
/** CACHE_L2_IBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus3 accesses L2-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_OVF_INT_RAW    (BIT(11))
#define CACHE_L2_IBUS3_OVF_INT_RAW_M  (CACHE_L2_IBUS3_OVF_INT_RAW_V << CACHE_L2_IBUS3_OVF_INT_RAW_S)
#define CACHE_L2_IBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_IBUS3_OVF_INT_RAW_S  11
/** CACHE_L2_DBUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus0 accesses L2-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_OVF_INT_RAW    (BIT(12))
#define CACHE_L2_DBUS0_OVF_INT_RAW_M  (CACHE_L2_DBUS0_OVF_INT_RAW_V << CACHE_L2_DBUS0_OVF_INT_RAW_S)
#define CACHE_L2_DBUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_DBUS0_OVF_INT_RAW_S  12
/** CACHE_L2_DBUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus1 accesses L2-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_OVF_INT_RAW    (BIT(13))
#define CACHE_L2_DBUS1_OVF_INT_RAW_M  (CACHE_L2_DBUS1_OVF_INT_RAW_V << CACHE_L2_DBUS1_OVF_INT_RAW_S)
#define CACHE_L2_DBUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_DBUS1_OVF_INT_RAW_S  13
/** CACHE_L2_DBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus2 accesses L2-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_OVF_INT_RAW    (BIT(14))
#define CACHE_L2_DBUS2_OVF_INT_RAW_M  (CACHE_L2_DBUS2_OVF_INT_RAW_V << CACHE_L2_DBUS2_OVF_INT_RAW_S)
#define CACHE_L2_DBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_DBUS2_OVF_INT_RAW_S  14
/** CACHE_L2_DBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
 *  due to bus3 accesses L2-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_OVF_INT_RAW    (BIT(15))
#define CACHE_L2_DBUS3_OVF_INT_RAW_M  (CACHE_L2_DBUS3_OVF_INT_RAW_V << CACHE_L2_DBUS3_OVF_INT_RAW_S)
#define CACHE_L2_DBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L2_DBUS3_OVF_INT_RAW_S  15

/** CACHE_L2_CACHE_ACS_CNT_INT_ST_REG register
 *  Cache Access Counter Interrupt status register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_CNT_INT_ST_REG (DR_REG_CACHE_BASE + 0x2e4)
/** CACHE_L2_IBUS0_OVF_INT_ST : RO; bitpos: [8]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L2-Cache due to bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_OVF_INT_ST    (BIT(8))
#define CACHE_L2_IBUS0_OVF_INT_ST_M  (CACHE_L2_IBUS0_OVF_INT_ST_V << CACHE_L2_IBUS0_OVF_INT_ST_S)
#define CACHE_L2_IBUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_IBUS0_OVF_INT_ST_S  8
/** CACHE_L2_IBUS1_OVF_INT_ST : RO; bitpos: [9]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L2-Cache due to bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_OVF_INT_ST    (BIT(9))
#define CACHE_L2_IBUS1_OVF_INT_ST_M  (CACHE_L2_IBUS1_OVF_INT_ST_V << CACHE_L2_IBUS1_OVF_INT_ST_S)
#define CACHE_L2_IBUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_IBUS1_OVF_INT_ST_S  9
/** CACHE_L2_IBUS2_OVF_INT_ST : HRO; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_OVF_INT_ST    (BIT(10))
#define CACHE_L2_IBUS2_OVF_INT_ST_M  (CACHE_L2_IBUS2_OVF_INT_ST_V << CACHE_L2_IBUS2_OVF_INT_ST_S)
#define CACHE_L2_IBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_IBUS2_OVF_INT_ST_S  10
/** CACHE_L2_IBUS3_OVF_INT_ST : HRO; bitpos: [11]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_OVF_INT_ST    (BIT(11))
#define CACHE_L2_IBUS3_OVF_INT_ST_M  (CACHE_L2_IBUS3_OVF_INT_ST_V << CACHE_L2_IBUS3_OVF_INT_ST_S)
#define CACHE_L2_IBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_IBUS3_OVF_INT_ST_S  11
/** CACHE_L2_DBUS0_OVF_INT_ST : RO; bitpos: [12]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L2-Cache due to bus0 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_OVF_INT_ST    (BIT(12))
#define CACHE_L2_DBUS0_OVF_INT_ST_M  (CACHE_L2_DBUS0_OVF_INT_ST_V << CACHE_L2_DBUS0_OVF_INT_ST_S)
#define CACHE_L2_DBUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_DBUS0_OVF_INT_ST_S  12
/** CACHE_L2_DBUS1_OVF_INT_ST : RO; bitpos: [13]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L2-Cache due to bus1 accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_OVF_INT_ST    (BIT(13))
#define CACHE_L2_DBUS1_OVF_INT_ST_M  (CACHE_L2_DBUS1_OVF_INT_ST_V << CACHE_L2_DBUS1_OVF_INT_ST_S)
#define CACHE_L2_DBUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_DBUS1_OVF_INT_ST_S  13
/** CACHE_L2_DBUS2_OVF_INT_ST : HRO; bitpos: [14]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_OVF_INT_ST    (BIT(14))
#define CACHE_L2_DBUS2_OVF_INT_ST_M  (CACHE_L2_DBUS2_OVF_INT_ST_V << CACHE_L2_DBUS2_OVF_INT_ST_S)
#define CACHE_L2_DBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_DBUS2_OVF_INT_ST_S  14
/** CACHE_L2_DBUS3_OVF_INT_ST : HRO; bitpos: [15]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_OVF_INT_ST    (BIT(15))
#define CACHE_L2_DBUS3_OVF_INT_ST_M  (CACHE_L2_DBUS3_OVF_INT_ST_V << CACHE_L2_DBUS3_OVF_INT_ST_S)
#define CACHE_L2_DBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L2_DBUS3_OVF_INT_ST_S  15

/** CACHE_L2_CACHE_ACS_FAIL_CTRL_REG register
 *  Cache Access Fail Configuration register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_CTRL_REG (DR_REG_CACHE_BASE + 0x2e8)
/** CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE : HRO; bitpos: [0]; default: 0;
 *  Configures l2 cache access fail check mode. 0: the access fail is not propagated to
 *  the request, 1: the access fail is propagated to the request
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE    (BIT(0))
#define CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE_M  (CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE_V << CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE_S)
#define CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE_V  0x00000001U
#define CACHE_L2_CACHE_ACS_FAIL_CHECK_MODE_S  0

/** CACHE_L2_CACHE_ACS_FAIL_INT_ENA_REG register
 *  Cache Access Fail Interrupt enable register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_INT_ENA_REG (DR_REG_CACHE_BASE + 0x2ec)
/** CACHE_L2_CACHE_FAIL_INT_ENA : HRO; bitpos: [5]; default: 0;
 *  Configures interrupt of access fail that occurs in L2-Cache due to l1 cache
 *  accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_INT_ENA    (BIT(5))
#define CACHE_L2_CACHE_FAIL_INT_ENA_M  (CACHE_L2_CACHE_FAIL_INT_ENA_V << CACHE_L2_CACHE_FAIL_INT_ENA_S)
#define CACHE_L2_CACHE_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L2_CACHE_FAIL_INT_ENA_S  5

