espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_CACHE_ACS_FAIL_INT_CLR_REG register
 *  L1-Cache Access Fail Interrupt clear register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_INT_CLR_REG (DR_REG_CACHE_BASE + 0x2f0)
/** CACHE_L2_CACHE_FAIL_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The bit is used to clear interrupt of access fail that occurs in L2-Cache due to l1
 *  cache accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_INT_CLR    (BIT(5))
#define CACHE_L2_CACHE_FAIL_INT_CLR_M  (CACHE_L2_CACHE_FAIL_INT_CLR_V << CACHE_L2_CACHE_FAIL_INT_CLR_S)
#define CACHE_L2_CACHE_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L2_CACHE_FAIL_INT_CLR_S  5

/** CACHE_L2_CACHE_ACS_FAIL_INT_RAW_REG register
 *  Cache Access Fail Interrupt raw register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_INT_RAW_REG (DR_REG_CACHE_BASE + 0x2f4)
/** CACHE_L2_CACHE_FAIL_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_INT_RAW    (BIT(5))
#define CACHE_L2_CACHE_FAIL_INT_RAW_M  (CACHE_L2_CACHE_FAIL_INT_RAW_V << CACHE_L2_CACHE_FAIL_INT_RAW_S)
#define CACHE_L2_CACHE_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L2_CACHE_FAIL_INT_RAW_S  5

/** CACHE_L2_CACHE_ACS_FAIL_INT_ST_REG register
 *  Cache Access Fail Interrupt status register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_INT_ST_REG (DR_REG_CACHE_BASE + 0x2f8)
/** CACHE_L2_CACHE_FAIL_INT_ST : RO; bitpos: [5]; default: 0;
 *  The bit indicates the interrupt status of access fail that occurs in L2-Cache due
 *  to l1 cache accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_INT_ST    (BIT(5))
#define CACHE_L2_CACHE_FAIL_INT_ST_M  (CACHE_L2_CACHE_FAIL_INT_ST_V << CACHE_L2_CACHE_FAIL_INT_ST_S)
#define CACHE_L2_CACHE_FAIL_INT_ST_V  0x00000001U
#define CACHE_L2_CACHE_FAIL_INT_ST_S  5

/** CACHE_L2_CACHE_ACS_CNT_CTRL_REG register
 *  Cache Access Counter enable and clear register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_CNT_CTRL_REG (DR_REG_CACHE_BASE + 0x2fc)
/** CACHE_L2_IBUS0_CNT_ENA : HRO; bitpos: [8]; default: 0;
 *  Configures ibus0 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_CNT_ENA    (BIT(8))
#define CACHE_L2_IBUS0_CNT_ENA_M  (CACHE_L2_IBUS0_CNT_ENA_V << CACHE_L2_IBUS0_CNT_ENA_S)
#define CACHE_L2_IBUS0_CNT_ENA_V  0x00000001U
#define CACHE_L2_IBUS0_CNT_ENA_S  8
/** CACHE_L2_IBUS1_CNT_ENA : HRO; bitpos: [9]; default: 0;
 *  Configures ibus1 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_CNT_ENA    (BIT(9))
#define CACHE_L2_IBUS1_CNT_ENA_M  (CACHE_L2_IBUS1_CNT_ENA_V << CACHE_L2_IBUS1_CNT_ENA_S)
#define CACHE_L2_IBUS1_CNT_ENA_V  0x00000001U
#define CACHE_L2_IBUS1_CNT_ENA_S  9
/** CACHE_L2_IBUS2_CNT_ENA : HRO; bitpos: [10]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_CNT_ENA    (BIT(10))
#define CACHE_L2_IBUS2_CNT_ENA_M  (CACHE_L2_IBUS2_CNT_ENA_V << CACHE_L2_IBUS2_CNT_ENA_S)
#define CACHE_L2_IBUS2_CNT_ENA_V  0x00000001U
#define CACHE_L2_IBUS2_CNT_ENA_S  10
/** CACHE_L2_IBUS3_CNT_ENA : HRO; bitpos: [11]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_CNT_ENA    (BIT(11))
#define CACHE_L2_IBUS3_CNT_ENA_M  (CACHE_L2_IBUS3_CNT_ENA_V << CACHE_L2_IBUS3_CNT_ENA_S)
#define CACHE_L2_IBUS3_CNT_ENA_V  0x00000001U
#define CACHE_L2_IBUS3_CNT_ENA_S  11
/** CACHE_L2_DBUS0_CNT_ENA : HRO; bitpos: [12]; default: 0;
 *  Configures dbus0 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_CNT_ENA    (BIT(12))
#define CACHE_L2_DBUS0_CNT_ENA_M  (CACHE_L2_DBUS0_CNT_ENA_V << CACHE_L2_DBUS0_CNT_ENA_S)
#define CACHE_L2_DBUS0_CNT_ENA_V  0x00000001U
#define CACHE_L2_DBUS0_CNT_ENA_S  12
/** CACHE_L2_DBUS1_CNT_ENA : HRO; bitpos: [13]; default: 0;
 *  Configures dbus1 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_CNT_ENA    (BIT(13))
#define CACHE_L2_DBUS1_CNT_ENA_M  (CACHE_L2_DBUS1_CNT_ENA_V << CACHE_L2_DBUS1_CNT_ENA_S)
#define CACHE_L2_DBUS1_CNT_ENA_V  0x00000001U
#define CACHE_L2_DBUS1_CNT_ENA_S  13
/** CACHE_L2_DBUS2_CNT_ENA : HRO; bitpos: [14]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_CNT_ENA    (BIT(14))
#define CACHE_L2_DBUS2_CNT_ENA_M  (CACHE_L2_DBUS2_CNT_ENA_V << CACHE_L2_DBUS2_CNT_ENA_S)
#define CACHE_L2_DBUS2_CNT_ENA_V  0x00000001U
#define CACHE_L2_DBUS2_CNT_ENA_S  14
/** CACHE_L2_DBUS3_CNT_ENA : HRO; bitpos: [15]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_CNT_ENA    (BIT(15))
#define CACHE_L2_DBUS3_CNT_ENA_M  (CACHE_L2_DBUS3_CNT_ENA_V << CACHE_L2_DBUS3_CNT_ENA_S)
#define CACHE_L2_DBUS3_CNT_ENA_V  0x00000001U
#define CACHE_L2_DBUS3_CNT_ENA_S  15
/** CACHE_L2_IBUS0_CNT_CLR : WT; bitpos: [24]; default: 0;
 *  The bit is used to clear ibus0 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_CNT_CLR    (BIT(24))
#define CACHE_L2_IBUS0_CNT_CLR_M  (CACHE_L2_IBUS0_CNT_CLR_V << CACHE_L2_IBUS0_CNT_CLR_S)
#define CACHE_L2_IBUS0_CNT_CLR_V  0x00000001U
#define CACHE_L2_IBUS0_CNT_CLR_S  24
/** CACHE_L2_IBUS1_CNT_CLR : WT; bitpos: [25]; default: 0;
 *  The bit is used to clear ibus1 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_CNT_CLR    (BIT(25))
#define CACHE_L2_IBUS1_CNT_CLR_M  (CACHE_L2_IBUS1_CNT_CLR_V << CACHE_L2_IBUS1_CNT_CLR_S)
#define CACHE_L2_IBUS1_CNT_CLR_V  0x00000001U
#define CACHE_L2_IBUS1_CNT_CLR_S  25
/** CACHE_L2_IBUS2_CNT_CLR : HRO; bitpos: [26]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_CNT_CLR    (BIT(26))
#define CACHE_L2_IBUS2_CNT_CLR_M  (CACHE_L2_IBUS2_CNT_CLR_V << CACHE_L2_IBUS2_CNT_CLR_S)
#define CACHE_L2_IBUS2_CNT_CLR_V  0x00000001U
#define CACHE_L2_IBUS2_CNT_CLR_S  26
/** CACHE_L2_IBUS3_CNT_CLR : HRO; bitpos: [27]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_CNT_CLR    (BIT(27))
#define CACHE_L2_IBUS3_CNT_CLR_M  (CACHE_L2_IBUS3_CNT_CLR_V << CACHE_L2_IBUS3_CNT_CLR_S)
#define CACHE_L2_IBUS3_CNT_CLR_V  0x00000001U
#define CACHE_L2_IBUS3_CNT_CLR_S  27
/** CACHE_L2_DBUS0_CNT_CLR : WT; bitpos: [28]; default: 0;
 *  The bit is used to clear dbus0 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS0_CNT_CLR    (BIT(28))
#define CACHE_L2_DBUS0_CNT_CLR_M  (CACHE_L2_DBUS0_CNT_CLR_V << CACHE_L2_DBUS0_CNT_CLR_S)
#define CACHE_L2_DBUS0_CNT_CLR_V  0x00000001U
#define CACHE_L2_DBUS0_CNT_CLR_S  28
/** CACHE_L2_DBUS1_CNT_CLR : WT; bitpos: [29]; default: 0;
 *  The bit is used to clear dbus1 counter in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS1_CNT_CLR    (BIT(29))
#define CACHE_L2_DBUS1_CNT_CLR_M  (CACHE_L2_DBUS1_CNT_CLR_V << CACHE_L2_DBUS1_CNT_CLR_S)
#define CACHE_L2_DBUS1_CNT_CLR_V  0x00000001U
#define CACHE_L2_DBUS1_CNT_CLR_S  29
/** CACHE_L2_DBUS2_CNT_CLR : HRO; bitpos: [30]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS2_CNT_CLR    (BIT(30))
#define CACHE_L2_DBUS2_CNT_CLR_M  (CACHE_L2_DBUS2_CNT_CLR_V << CACHE_L2_DBUS2_CNT_CLR_S)
#define CACHE_L2_DBUS2_CNT_CLR_V  0x00000001U
#define CACHE_L2_DBUS2_CNT_CLR_S  30
/** CACHE_L2_DBUS3_CNT_CLR : HRO; bitpos: [31]; default: 0;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_CNT_CLR    (BIT(31))
#define CACHE_L2_DBUS3_CNT_CLR_M  (CACHE_L2_DBUS3_CNT_CLR_V << CACHE_L2_DBUS3_CNT_CLR_S)
#define CACHE_L2_DBUS3_CNT_CLR_V  0x00000001U
#define CACHE_L2_DBUS3_CNT_CLR_S  31

/** CACHE_L2_IBUS0_ACS_HIT_CNT_REG register
 *  L2-Cache bus0 Hit-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS0_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x300)
/** CACHE_L2_IBUS0_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-ICache0 accesses L2-Cache due to
 *  bus0 accessing L1-ICache0.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS0_HIT_CNT_M  (CACHE_L2_IBUS0_HIT_CNT_V << CACHE_L2_IBUS0_HIT_CNT_S)
#define CACHE_L2_IBUS0_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS0_HIT_CNT_S  0

/** CACHE_L2_IBUS0_ACS_MISS_CNT_REG register
 *  L2-Cache bus0 Miss-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS0_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x304)
/** CACHE_L2_IBUS0_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-ICache0 accesses L2-Cache due to
 *  bus0 accessing L1-ICache0.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS0_MISS_CNT_M  (CACHE_L2_IBUS0_MISS_CNT_V << CACHE_L2_IBUS0_MISS_CNT_S)
#define CACHE_L2_IBUS0_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS0_MISS_CNT_S  0

