espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_IBUS0_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus0 Conflict-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS0_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x308)
/** CACHE_L2_IBUS0_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-ICache0 accesses
 *  L2-Cache due to bus0 accessing L1-ICache0.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS0_CONFLICT_CNT_M  (CACHE_L2_IBUS0_CONFLICT_CNT_V << CACHE_L2_IBUS0_CONFLICT_CNT_S)
#define CACHE_L2_IBUS0_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS0_CONFLICT_CNT_S  0

/** CACHE_L2_IBUS0_ACS_NXTLVL_RD_CNT_REG register
 *  L2-Cache bus0 Next-Level-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS0_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x30c)
/** CACHE_L2_IBUS0_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-ICache0 accessing L2-Cache due to bus0 accessing L1-ICache0.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS0_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS0_NXTLVL_RD_CNT_M  (CACHE_L2_IBUS0_NXTLVL_RD_CNT_V << CACHE_L2_IBUS0_NXTLVL_RD_CNT_S)
#define CACHE_L2_IBUS0_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS0_NXTLVL_RD_CNT_S  0

/** CACHE_L2_IBUS1_ACS_HIT_CNT_REG register
 *  L2-Cache bus1 Hit-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS1_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x310)
/** CACHE_L2_IBUS1_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-ICache1 accesses L2-Cache due to
 *  bus1 accessing L1-ICache1.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS1_HIT_CNT_M  (CACHE_L2_IBUS1_HIT_CNT_V << CACHE_L2_IBUS1_HIT_CNT_S)
#define CACHE_L2_IBUS1_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS1_HIT_CNT_S  0

/** CACHE_L2_IBUS1_ACS_MISS_CNT_REG register
 *  L2-Cache bus1 Miss-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS1_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x314)
/** CACHE_L2_IBUS1_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-ICache1 accesses L2-Cache due to
 *  bus1 accessing L1-ICache1.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS1_MISS_CNT_M  (CACHE_L2_IBUS1_MISS_CNT_V << CACHE_L2_IBUS1_MISS_CNT_S)
#define CACHE_L2_IBUS1_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS1_MISS_CNT_S  0

/** CACHE_L2_IBUS1_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus1 Conflict-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS1_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x318)
/** CACHE_L2_IBUS1_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-ICache1 accesses
 *  L2-Cache due to bus1 accessing L1-ICache1.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS1_CONFLICT_CNT_M  (CACHE_L2_IBUS1_CONFLICT_CNT_V << CACHE_L2_IBUS1_CONFLICT_CNT_S)
#define CACHE_L2_IBUS1_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS1_CONFLICT_CNT_S  0

/** CACHE_L2_IBUS1_ACS_NXTLVL_RD_CNT_REG register
 *  L2-Cache bus1 Next-Level-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS1_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x31c)
/** CACHE_L2_IBUS1_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-ICache1 accessing L2-Cache due to bus1 accessing L1-ICache1.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS1_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS1_NXTLVL_RD_CNT_M  (CACHE_L2_IBUS1_NXTLVL_RD_CNT_V << CACHE_L2_IBUS1_NXTLVL_RD_CNT_S)
#define CACHE_L2_IBUS1_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS1_NXTLVL_RD_CNT_S  0

/** CACHE_L2_IBUS2_ACS_HIT_CNT_REG register
 *  L2-Cache bus2 Hit-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS2_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x320)
/** CACHE_L2_IBUS2_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-ICache2 accesses L2-Cache due to
 *  bus2 accessing L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS2_HIT_CNT_M  (CACHE_L2_IBUS2_HIT_CNT_V << CACHE_L2_IBUS2_HIT_CNT_S)
#define CACHE_L2_IBUS2_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS2_HIT_CNT_S  0

/** CACHE_L2_IBUS2_ACS_MISS_CNT_REG register
 *  L2-Cache bus2 Miss-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS2_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x324)
/** CACHE_L2_IBUS2_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-ICache2 accesses L2-Cache due to
 *  bus2 accessing L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS2_MISS_CNT_M  (CACHE_L2_IBUS2_MISS_CNT_V << CACHE_L2_IBUS2_MISS_CNT_S)
#define CACHE_L2_IBUS2_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS2_MISS_CNT_S  0

/** CACHE_L2_IBUS2_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus2 Conflict-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS2_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x328)
/** CACHE_L2_IBUS2_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-ICache2 accesses
 *  L2-Cache due to bus2 accessing L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS2_CONFLICT_CNT_M  (CACHE_L2_IBUS2_CONFLICT_CNT_V << CACHE_L2_IBUS2_CONFLICT_CNT_S)
#define CACHE_L2_IBUS2_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS2_CONFLICT_CNT_S  0

/** CACHE_L2_IBUS2_ACS_NXTLVL_RD_CNT_REG register
 *  L2-Cache bus2 Next-Level-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS2_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x32c)
/** CACHE_L2_IBUS2_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-ICache2 accessing L2-Cache due to bus2 accessing L1-ICache2.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS2_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS2_NXTLVL_RD_CNT_M  (CACHE_L2_IBUS2_NXTLVL_RD_CNT_V << CACHE_L2_IBUS2_NXTLVL_RD_CNT_S)
#define CACHE_L2_IBUS2_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS2_NXTLVL_RD_CNT_S  0

/** CACHE_L2_IBUS3_ACS_HIT_CNT_REG register
 *  L2-Cache bus3 Hit-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS3_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x330)
/** CACHE_L2_IBUS3_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-ICache3 accesses L2-Cache due to
 *  bus3 accessing L1-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS3_HIT_CNT_M  (CACHE_L2_IBUS3_HIT_CNT_V << CACHE_L2_IBUS3_HIT_CNT_S)
#define CACHE_L2_IBUS3_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS3_HIT_CNT_S  0

/** CACHE_L2_IBUS3_ACS_MISS_CNT_REG register
 *  L2-Cache bus3 Miss-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS3_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x334)
/** CACHE_L2_IBUS3_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-ICache3 accesses L2-Cache due to
 *  bus3 accessing L1-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS3_MISS_CNT_M  (CACHE_L2_IBUS3_MISS_CNT_V << CACHE_L2_IBUS3_MISS_CNT_S)
#define CACHE_L2_IBUS3_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS3_MISS_CNT_S  0

/** CACHE_L2_IBUS3_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus3 Conflict-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_IBUS3_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x338)
/** CACHE_L2_IBUS3_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-ICache3 accesses
 *  L2-Cache due to bus3 accessing L1-ICache3.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_IBUS3_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS3_CONFLICT_CNT_M  (CACHE_L2_IBUS3_CONFLICT_CNT_V << CACHE_L2_IBUS3_CONFLICT_CNT_S)
#define CACHE_L2_IBUS3_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS3_CONFLICT_CNT_S  0

