espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_DBUS3_ACS_HIT_CNT_REG register
 *  L2-Cache bus3 Hit-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_DBUS3_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x37c)
/** CACHE_L2_DBUS3_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-DCache accesses L2-Cache due to
 *  bus3 accessing L1-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS3_HIT_CNT_M  (CACHE_L2_DBUS3_HIT_CNT_V << CACHE_L2_DBUS3_HIT_CNT_S)
#define CACHE_L2_DBUS3_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS3_HIT_CNT_S  0

/** CACHE_L2_DBUS3_ACS_MISS_CNT_REG register
 *  L2-Cache bus3 Miss-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_DBUS3_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x380)
/** CACHE_L2_DBUS3_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-DCache accesses L2-Cache due to
 *  bus3 accessing L1-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS3_MISS_CNT_M  (CACHE_L2_DBUS3_MISS_CNT_V << CACHE_L2_DBUS3_MISS_CNT_S)
#define CACHE_L2_DBUS3_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS3_MISS_CNT_S  0

/** CACHE_L2_DBUS3_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus3 Conflict-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_DBUS3_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x384)
/** CACHE_L2_DBUS3_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-DCache accesses
 *  L2-Cache due to bus3 accessing L1-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS3_CONFLICT_CNT_M  (CACHE_L2_DBUS3_CONFLICT_CNT_V << CACHE_L2_DBUS3_CONFLICT_CNT_S)
#define CACHE_L2_DBUS3_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS3_CONFLICT_CNT_S  0

/** CACHE_L2_DBUS3_ACS_NXTLVL_RD_CNT_REG register
 *  L2-Cache bus3 Next-Level-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_DBUS3_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x388)
/** CACHE_L2_DBUS3_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-DCache accessing L2-Cache due to bus3 accessing L1-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS3_NXTLVL_RD_CNT_M  (CACHE_L2_DBUS3_NXTLVL_RD_CNT_V << CACHE_L2_DBUS3_NXTLVL_RD_CNT_S)
#define CACHE_L2_DBUS3_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS3_NXTLVL_RD_CNT_S  0

/** CACHE_L2_DBUS3_ACS_NXTLVL_WR_CNT_REG register
 *  L2-Cache bus3 WB-Access Counter register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_DBUS3_ACS_NXTLVL_WR_CNT_REG (DR_REG_CACHE_BASE + 0x38c)
/** CACHE_L2_DBUS3_NXTLVL_WR_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of write back when L1-DCache accesses L2-Cache due
 *  to bus3 accessing L1-DCache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_DBUS3_NXTLVL_WR_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS3_NXTLVL_WR_CNT_M  (CACHE_L2_DBUS3_NXTLVL_WR_CNT_V << CACHE_L2_DBUS3_NXTLVL_WR_CNT_S)
#define CACHE_L2_DBUS3_NXTLVL_WR_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS3_NXTLVL_WR_CNT_S  0

/** CACHE_L2_CACHE_ACS_FAIL_ID_ATTR_REG register
 *  L2-Cache Access Fail ID/attribution information register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_ID_ATTR_REG (DR_REG_CACHE_BASE + 0x390)
/** CACHE_L2_CACHE_FAIL_ID : RO; bitpos: [15:0]; default: 0;
 *  The register records the ID of fail-access when L1-Cache accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_ID    0x0000FFFFU
#define CACHE_L2_CACHE_FAIL_ID_M  (CACHE_L2_CACHE_FAIL_ID_V << CACHE_L2_CACHE_FAIL_ID_S)
#define CACHE_L2_CACHE_FAIL_ID_V  0x0000FFFFU
#define CACHE_L2_CACHE_FAIL_ID_S  0
/** CACHE_L2_CACHE_FAIL_ATTR : RO; bitpos: [31:16]; default: 0;
 *  The register records the attribution of fail-access when L1-Cache accesses L2-Cache
 *  due to cache accessing L1-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_ATTR    0x0000FFFFU
#define CACHE_L2_CACHE_FAIL_ATTR_M  (CACHE_L2_CACHE_FAIL_ATTR_V << CACHE_L2_CACHE_FAIL_ATTR_S)
#define CACHE_L2_CACHE_FAIL_ATTR_V  0x0000FFFFU
#define CACHE_L2_CACHE_FAIL_ATTR_S  16

/** CACHE_L2_CACHE_ACS_FAIL_ADDR_REG register
 *  L2-Cache Access Fail Address information register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACS_FAIL_ADDR_REG (DR_REG_CACHE_BASE + 0x394)
/** CACHE_L2_CACHE_FAIL_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The register records the address of fail-access when L1-Cache accesses L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_FAIL_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_FAIL_ADDR_M  (CACHE_L2_CACHE_FAIL_ADDR_V << CACHE_L2_CACHE_FAIL_ADDR_S)
#define CACHE_L2_CACHE_FAIL_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_FAIL_ADDR_S  0

/** CACHE_L2_CACHE_SYNC_PRELOAD_INT_ENA_REG register
 *  L1-Cache Access Fail Interrupt enable register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_INT_ENA_REG (DR_REG_CACHE_BASE + 0x398)
/** CACHE_L2_CACHE_PLD_DONE_INT_ENA : HRO; bitpos: [5]; default: 0;
 *  Configures interrupt of L2-Cache preload-operation done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_DONE_INT_ENA    (BIT(5))
#define CACHE_L2_CACHE_PLD_DONE_INT_ENA_M  (CACHE_L2_CACHE_PLD_DONE_INT_ENA_V << CACHE_L2_CACHE_PLD_DONE_INT_ENA_S)
#define CACHE_L2_CACHE_PLD_DONE_INT_ENA_V  0x00000001U
#define CACHE_L2_CACHE_PLD_DONE_INT_ENA_S  5
/** CACHE_L2_CACHE_PLD_ERR_INT_ENA : HRO; bitpos: [12]; default: 0;
 *  Configures interrupt of L2-Cache preload-operation error.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_ERR_INT_ENA    (BIT(12))
#define CACHE_L2_CACHE_PLD_ERR_INT_ENA_M  (CACHE_L2_CACHE_PLD_ERR_INT_ENA_V << CACHE_L2_CACHE_PLD_ERR_INT_ENA_S)
#define CACHE_L2_CACHE_PLD_ERR_INT_ENA_V  0x00000001U
#define CACHE_L2_CACHE_PLD_ERR_INT_ENA_S  12

/** CACHE_L2_CACHE_SYNC_PRELOAD_INT_CLR_REG register
 *  Sync Preload operation Interrupt clear register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_INT_CLR_REG (DR_REG_CACHE_BASE + 0x39c)
/** CACHE_L2_CACHE_PLD_DONE_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The bit is used to clear interrupt that occurs only when L2-Cache preload-operation
 *  is done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_DONE_INT_CLR    (BIT(5))
#define CACHE_L2_CACHE_PLD_DONE_INT_CLR_M  (CACHE_L2_CACHE_PLD_DONE_INT_CLR_V << CACHE_L2_CACHE_PLD_DONE_INT_CLR_S)
#define CACHE_L2_CACHE_PLD_DONE_INT_CLR_V  0x00000001U
#define CACHE_L2_CACHE_PLD_DONE_INT_CLR_S  5
/** CACHE_L2_CACHE_PLD_ERR_INT_CLR : WT; bitpos: [12]; default: 0;
 *  The bit is used to clear interrupt of L2-Cache preload-operation error.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_ERR_INT_CLR    (BIT(12))
#define CACHE_L2_CACHE_PLD_ERR_INT_CLR_M  (CACHE_L2_CACHE_PLD_ERR_INT_CLR_V << CACHE_L2_CACHE_PLD_ERR_INT_CLR_S)
#define CACHE_L2_CACHE_PLD_ERR_INT_CLR_V  0x00000001U
#define CACHE_L2_CACHE_PLD_ERR_INT_CLR_S  12

/** CACHE_L2_CACHE_SYNC_PRELOAD_INT_RAW_REG register
 *  Sync Preload operation Interrupt raw register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_INT_RAW_REG (DR_REG_CACHE_BASE + 0x3a0)
/** CACHE_L2_CACHE_PLD_DONE_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation is
 *  done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_DONE_INT_RAW    (BIT(5))
#define CACHE_L2_CACHE_PLD_DONE_INT_RAW_M  (CACHE_L2_CACHE_PLD_DONE_INT_RAW_V << CACHE_L2_CACHE_PLD_DONE_INT_RAW_S)
#define CACHE_L2_CACHE_PLD_DONE_INT_RAW_V  0x00000001U
#define CACHE_L2_CACHE_PLD_DONE_INT_RAW_S  5
/** CACHE_L2_CACHE_PLD_ERR_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation error
 *  occurs.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_ERR_INT_RAW    (BIT(12))
#define CACHE_L2_CACHE_PLD_ERR_INT_RAW_M  (CACHE_L2_CACHE_PLD_ERR_INT_RAW_V << CACHE_L2_CACHE_PLD_ERR_INT_RAW_S)
#define CACHE_L2_CACHE_PLD_ERR_INT_RAW_V  0x00000001U
#define CACHE_L2_CACHE_PLD_ERR_INT_RAW_S  12

/** CACHE_L2_CACHE_SYNC_PRELOAD_INT_ST_REG register
 *  L1-Cache Access Fail Interrupt status register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_INT_ST_REG (DR_REG_CACHE_BASE + 0x3a4)
/** CACHE_L2_CACHE_PLD_DONE_INT_ST : RO; bitpos: [5]; default: 0;
 *  The bit indicates the status of the interrupt that occurs only when L2-Cache
 *  preload-operation is done.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_DONE_INT_ST    (BIT(5))
#define CACHE_L2_CACHE_PLD_DONE_INT_ST_M  (CACHE_L2_CACHE_PLD_DONE_INT_ST_V << CACHE_L2_CACHE_PLD_DONE_INT_ST_S)
#define CACHE_L2_CACHE_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L2_CACHE_PLD_DONE_INT_ST_S  5
/** CACHE_L2_CACHE_PLD_ERR_INT_ST : RO; bitpos: [12]; default: 0;
 *  The bit indicates the status of the interrupt of L2-Cache preload-operation error.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_ERR_INT_ST    (BIT(12))
#define CACHE_L2_CACHE_PLD_ERR_INT_ST_M  (CACHE_L2_CACHE_PLD_ERR_INT_ST_V << CACHE_L2_CACHE_PLD_ERR_INT_ST_S)
#define CACHE_L2_CACHE_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L2_CACHE_PLD_ERR_INT_ST_S  12

