espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_CACHE_SYNC_PRELOAD_EXCEPTION_REG register
 *  Cache Sync/Preload Operation exception register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_EXCEPTION_REG (DR_REG_CACHE_BASE + 0x3a8)
/** CACHE_L2_CACHE_PLD_ERR_CODE : RO; bitpos: [11:10]; default: 0;
 *  The value 2 is Only available which means preload size is error in L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_ERR_CODE    0x00000003U
#define CACHE_L2_CACHE_PLD_ERR_CODE_M  (CACHE_L2_CACHE_PLD_ERR_CODE_V << CACHE_L2_CACHE_PLD_ERR_CODE_S)
#define CACHE_L2_CACHE_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L2_CACHE_PLD_ERR_CODE_S  10

/** CACHE_L2_CACHE_SYNC_RST_CTRL_REG register
 *  Cache Sync Reset control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_SYNC_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x3ac)
/** CACHE_L2_CACHE_SYNC_RST : HRO; bitpos: [5]; default: 0;
 *  Configures reset sync-logic inside L2-Cache. Recommend that this should only be
 *  used to initialize sync-logic when some fatal error of sync-logic occurs.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_SYNC_RST    (BIT(5))
#define CACHE_L2_CACHE_SYNC_RST_M  (CACHE_L2_CACHE_SYNC_RST_V << CACHE_L2_CACHE_SYNC_RST_S)
#define CACHE_L2_CACHE_SYNC_RST_V  0x00000001U
#define CACHE_L2_CACHE_SYNC_RST_S  5

/** CACHE_L2_CACHE_PRELOAD_RST_CTRL_REG register
 *  Cache Preload Reset control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_PRELOAD_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x3b0)
/** CACHE_L2_CACHE_PLD_RST : HRO; bitpos: [5]; default: 0;
 *  Configures reset preload-logic inside L2-Cache. Recommend that this should only be
 *  used to initialize preload-logic when some fatal error of preload-logic occurs.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_PLD_RST    (BIT(5))
#define CACHE_L2_CACHE_PLD_RST_M  (CACHE_L2_CACHE_PLD_RST_V << CACHE_L2_CACHE_PLD_RST_S)
#define CACHE_L2_CACHE_PLD_RST_V  0x00000001U
#define CACHE_L2_CACHE_PLD_RST_S  5

/** CACHE_L2_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG register
 *  Cache Autoload buffer clear control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG (DR_REG_CACHE_BASE + 0x3b4)
/** CACHE_L2_CACHE_ALD_BUF_CLR : HRO; bitpos: [5]; default: 0;
 *  Configures clear autoload-buffer inside L2-Cache. If this bit is active, autoload
 *  will not work in L2-Cache. This bit should not be active when autoload works in
 *  L2-Cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ALD_BUF_CLR    (BIT(5))
#define CACHE_L2_CACHE_ALD_BUF_CLR_M  (CACHE_L2_CACHE_ALD_BUF_CLR_V << CACHE_L2_CACHE_ALD_BUF_CLR_S)
#define CACHE_L2_CACHE_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L2_CACHE_ALD_BUF_CLR_S  5

/** CACHE_L2_UNALLOCATE_BUFFER_CLEAR_REG register
 *  Unallocate request buffer clear registers
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_UNALLOCATE_BUFFER_CLEAR_REG (DR_REG_CACHE_BASE + 0x3b8)
/** CACHE_L2_CACHE_UNALLOC_CLR : HRO; bitpos: [5]; default: 0;
 *  The bit is used to clear the unallocate request buffer of l2 icache where the
 *  unallocate request is responded but not completed.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_UNALLOC_CLR    (BIT(5))
#define CACHE_L2_CACHE_UNALLOC_CLR_M  (CACHE_L2_CACHE_UNALLOC_CLR_V << CACHE_L2_CACHE_UNALLOC_CLR_S)
#define CACHE_L2_CACHE_UNALLOC_CLR_V  0x00000001U
#define CACHE_L2_CACHE_UNALLOC_CLR_S  5

/** CACHE_L2_CACHE_ACCESS_ATTR_CTRL_REG register
 *  L2 cache access attribute control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ACCESS_ATTR_CTRL_REG (DR_REG_CACHE_BASE + 0x3bc)
/** CACHE_L2_CACHE_ACCESS_FORCE_CC : HRO; bitpos: [0]; default: 1;
 *  Configures force the request to l2 cache with cacheable attribute, otherwise, the
 *  attribute is propagated from L1 cache or CPU, it could be one of cacheable and
 *  non-cacheable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_CC    (BIT(0))
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_M  (CACHE_L2_CACHE_ACCESS_FORCE_CC_V << CACHE_L2_CACHE_ACCESS_FORCE_CC_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_S  0
/** CACHE_L2_CACHE_ACCESS_FORCE_WB : HRO; bitpos: [1]; default: 1;
 *  Configures force the request to l2 cache with write-back attribute, otherwise, the
 *  attribute is propagated from L1 cache or CPU, it could be one of write-back and
 *  write-through.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_WB    (BIT(1))
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_M  (CACHE_L2_CACHE_ACCESS_FORCE_WB_V << CACHE_L2_CACHE_ACCESS_FORCE_WB_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_S  1
/** CACHE_L2_CACHE_ACCESS_FORCE_WMA : HRO; bitpos: [2]; default: 1;
 *  Configures force the request to l2 cache with write-miss-allocate attribute,
 *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
 *  write-miss-allocate and write-miss-no-allocate.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA    (BIT(2))
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_M  (CACHE_L2_CACHE_ACCESS_FORCE_WMA_V << CACHE_L2_CACHE_ACCESS_FORCE_WMA_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_S  2
/** CACHE_L2_CACHE_ACCESS_FORCE_RMA : HRO; bitpos: [3]; default: 1;
 *  Configures force the request to l2 cache with read-miss-allocate attribute,
 *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
 *  read-miss-allocate and read-miss-no-allocate.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA    (BIT(3))
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_M  (CACHE_L2_CACHE_ACCESS_FORCE_RMA_V << CACHE_L2_CACHE_ACCESS_FORCE_RMA_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_S  3

