espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_L2_CACHE_OBJECT_CTRL_REG register
 *  Cache Tag and Data memory Object control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_OBJECT_CTRL_REG (DR_REG_CACHE_BASE + 0x3c0)
/** CACHE_L2_CACHE_TAG_OBJECT : HRO; bitpos: [5]; default: 0;
 *  Configures set L2-Cache tag memory as object. This bit should be onehot with the
 *  others fields inside this register.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_TAG_OBJECT    (BIT(5))
#define CACHE_L2_CACHE_TAG_OBJECT_M  (CACHE_L2_CACHE_TAG_OBJECT_V << CACHE_L2_CACHE_TAG_OBJECT_S)
#define CACHE_L2_CACHE_TAG_OBJECT_V  0x00000001U
#define CACHE_L2_CACHE_TAG_OBJECT_S  5
/** CACHE_L2_CACHE_MEM_OBJECT : HRO; bitpos: [11]; default: 0;
 *  Configures set L2-Cache data memory as object. This bit should be onehot with the
 *  others fields inside this register.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_MEM_OBJECT    (BIT(11))
#define CACHE_L2_CACHE_MEM_OBJECT_M  (CACHE_L2_CACHE_MEM_OBJECT_V << CACHE_L2_CACHE_MEM_OBJECT_S)
#define CACHE_L2_CACHE_MEM_OBJECT_V  0x00000001U
#define CACHE_L2_CACHE_MEM_OBJECT_S  11

/** CACHE_L2_CACHE_WAY_OBJECT_REG register
 *  Cache Tag and Data memory way register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_WAY_OBJECT_REG (DR_REG_CACHE_BASE + 0x3c4)
/** CACHE_L2_CACHE_WAY_OBJECT : HRO; bitpos: [2:0]; default: 0;
 *  Configures way of the tag-object will be accessed.
 *  7: way7
 *
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_WAY_OBJECT    0x00000007U
#define CACHE_L2_CACHE_WAY_OBJECT_M  (CACHE_L2_CACHE_WAY_OBJECT_V << CACHE_L2_CACHE_WAY_OBJECT_S)
#define CACHE_L2_CACHE_WAY_OBJECT_V  0x00000007U
#define CACHE_L2_CACHE_WAY_OBJECT_S  0

/** CACHE_L2_CACHE_ADDR_REG register
 *  Cache address register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_ADDR_REG (DR_REG_CACHE_BASE + 0x3c8)
/** CACHE_L2_CACHE_ADDR : HRO; bitpos: [31:0]; default: 1073741824;
 *  Those bits stores the address which will decide where inside the specified tag
 *  memory object will be accessed.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_ADDR_M  (CACHE_L2_CACHE_ADDR_V << CACHE_L2_CACHE_ADDR_S)
#define CACHE_L2_CACHE_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_ADDR_S  0

/** CACHE_L2_CACHE_DEBUG_BUS_REG register
 *  Cache Tag/data memory content register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_L2_CACHE_DEBUG_BUS_REG (DR_REG_CACHE_BASE + 0x3cc)
/** CACHE_L2_CACHE_DEBUG_BUS : R/W; bitpos: [31:0]; default: 972;
 *  This is a constant place where we can write data to or read data from the tag/data
 *  memory on the specified cache.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_DEBUG_BUS    0xFFFFFFFFU
#define CACHE_L2_CACHE_DEBUG_BUS_M  (CACHE_L2_CACHE_DEBUG_BUS_V << CACHE_L2_CACHE_DEBUG_BUS_S)
#define CACHE_L2_CACHE_DEBUG_BUS_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_DEBUG_BUS_S  0

/** CACHE_LEVEL_SPLIT1_REG register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_LEVEL_SPLIT1_REG (DR_REG_CACHE_BASE + 0x3d0)
/** CACHE_LEVEL_SPLIT1 : HRO; bitpos: [31:0]; default: 976;
 *  Reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_LEVEL_SPLIT1    0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT1_M  (CACHE_LEVEL_SPLIT1_V << CACHE_LEVEL_SPLIT1_S)
#define CACHE_LEVEL_SPLIT1_V  0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT1_S  0

/** CACHE_CLOCK_GATE_REG register
 *  Clock gate control register
 */
#define CACHE_CLOCK_GATE_REG (DR_REG_CACHE_BASE + 0x3d4)
/** CACHE_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures clock gate when access all registers in this module.
 */
#define CACHE_CLK_EN    (BIT(0))
#define CACHE_CLK_EN_M  (CACHE_CLK_EN_V << CACHE_CLK_EN_S)
#define CACHE_CLK_EN_V  0x00000001U
#define CACHE_CLK_EN_S  0

/** CACHE_TRACE_ENA_REG register
 *  Clock gate control register
 */
#define CACHE_TRACE_ENA_REG (DR_REG_CACHE_BASE + 0x3d8)
/** CACHE_L1_CACHE_TRACE_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures L1-Cache trace for the performance counter and fail tracer
 */
#define CACHE_L1_CACHE_TRACE_ENA    (BIT(0))
#define CACHE_L1_CACHE_TRACE_ENA_M  (CACHE_L1_CACHE_TRACE_ENA_V << CACHE_L1_CACHE_TRACE_ENA_S)
#define CACHE_L1_CACHE_TRACE_ENA_V  0x00000001U
#define CACHE_L1_CACHE_TRACE_ENA_S  0
/** CACHE_L2_CACHE_TRACE_ENA : HRO; bitpos: [1]; default: 0;
 *  Configures L2-Cache trace for the performance counter and fail tracer
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_L2_CACHE_TRACE_ENA    (BIT(1))
#define CACHE_L2_CACHE_TRACE_ENA_M  (CACHE_L2_CACHE_TRACE_ENA_V << CACHE_L2_CACHE_TRACE_ENA_S)
#define CACHE_L2_CACHE_TRACE_ENA_V  0x00000001U
#define CACHE_L2_CACHE_TRACE_ENA_S  1

/** CACHE_REDUNDANCY_SIG0_REG register
 *  Cache redundancy signal 0 register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_REDUNDANCY_SIG0_REG (DR_REG_CACHE_BASE + 0x3dc)
/** CACHE_REDCY_SIG0 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_REDCY_SIG0    0xFFFFFFFFU
#define CACHE_REDCY_SIG0_M  (CACHE_REDCY_SIG0_V << CACHE_REDCY_SIG0_S)
#define CACHE_REDCY_SIG0_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG0_S  0

/** CACHE_REDUNDANCY_SIG1_REG register
 *  Cache redundancy signal 1 register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_REDUNDANCY_SIG1_REG (DR_REG_CACHE_BASE + 0x3e0)
/** CACHE_REDCY_SIG1 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_REDCY_SIG1    0xFFFFFFFFU
#define CACHE_REDCY_SIG1_M  (CACHE_REDCY_SIG1_V << CACHE_REDCY_SIG1_S)
#define CACHE_REDCY_SIG1_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG1_S  0

/** CACHE_REDUNDANCY_SIG2_REG register
 *  Cache redundancy signal 2 register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_REDUNDANCY_SIG2_REG (DR_REG_CACHE_BASE + 0x3e4)
/** CACHE_REDCY_SIG2 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_REDCY_SIG2    0xFFFFFFFFU
#define CACHE_REDCY_SIG2_M  (CACHE_REDCY_SIG2_V << CACHE_REDCY_SIG2_S)
#define CACHE_REDCY_SIG2_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG2_S  0

