espressif/esp-idf/components/soc/esp32s31/register/soc/cache_reg.h
/** CACHE_REDUNDANCY_SIG3_REG register
 *  Cache redundancy signal 3 register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_REDUNDANCY_SIG3_REG (DR_REG_CACHE_BASE + 0x3e8)
/** CACHE_REDCY_SIG3 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_REDCY_SIG3    0xFFFFFFFFU
#define CACHE_REDCY_SIG3_M  (CACHE_REDCY_SIG3_V << CACHE_REDCY_SIG3_S)
#define CACHE_REDCY_SIG3_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG3_S  0

/** CACHE_REDUNDANCY_SIG4_REG register
 *  Cache redundancy signal 0 register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define CACHE_REDUNDANCY_SIG4_REG (DR_REG_CACHE_BASE + 0x3ec)
/** CACHE_REDCY_SIG4 : RO; bitpos: [3:0]; default: 0;
 *  Those bits are prepared for ECO.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define CACHE_REDCY_SIG4    0x0000000FU
#define CACHE_REDCY_SIG4_M  (CACHE_REDCY_SIG4_V << CACHE_REDCY_SIG4_S)
#define CACHE_REDCY_SIG4_V  0x0000000FU
#define CACHE_REDCY_SIG4_S  0

/** CACHE_DATE_REG register
 *  Version control register
 */
#define CACHE_DATE_REG (DR_REG_CACHE_BASE + 0x3fc)
/** CACHE_DATE : R/W; bitpos: [27:0]; default: 38810384;
 *  version control register. Note that this default value stored is the latest date
 *  when the hardware logic was updated.
 */
#define CACHE_DATE    0x0FFFFFFFU
#define CACHE_DATE_M  (CACHE_DATE_V << CACHE_DATE_S)
#define CACHE_DATE_V  0x0FFFFFFFU
#define CACHE_DATE_S  0

#ifdef __cplusplus
}
#endif
